{"The Media[edit]":{"text":"Edwards supports net neutrality. In addition, he has outlined a plan that will establish high-speed internet availability to all American homes and business by the year 2010.[38]He is also a vocal critic of the Fox News Channel. He has accused the network of having a \"right-wing agenda\" and lacking objectivity in their reporting.[39] He has boycotted debates hosted by the network, saying \"there's just no reason for Democrats to give Fox a platform.\"[40][41]"},"Health care[edit]":{"Revenue sources[edit]":{"text":"The total public cost of the plan would be $90–$120 billion per year, paid for by eliminating the 2001 tax cuts for individuals earning more than $200,000 per year.[27] Employers would be required to either cover their employees or to pay a payroll tax that will be used to partially fund regional health insurance pools (called \"Health Markets\") that are overseen by the federal government. Individuals who are not covered by their employers or by an expanded Medicaid program (covering individuals and families with incomes up to 250% of the poverty level) or Medicare will be required to purchase insurance from these Health Markets. Insurance companies must compete to win the right to be one of the providers in these Health Markets and must provide full comprehensive care (including mental health parity). In addition, one of the insurance plans will be directly provided by the federal government (similar to, but separate from Medicare). If a majority of individuals choose to purchase their insurance from the government plan, Edwards has stated that this could eventually lead to a single-payer health care system. In addition, there will also be a broad subsidy for those individuals who have to purchase insurance on their own. The subsidy is given on a sliding scale to individuals and families making up to roughly $100,000 per year (this is a significantly larger subsidy than is provided in the Massachusetts health care plan, another mandated insurance program)."},"text":"On February 5, 2007, Edwards unveiled his plan for universal health care. The plan subsidizes health insurance purchases for poorer Americans, requires that all Americans purchase health care,[24] \"requires that everybody get preventive care,\" [25] and requires employers to offer health insurance through the Medicare system as one option for their workers. Since Medicare has lower administrative costs — under 4%, versus 20% or more for many HMOs[26] — Edwards believes that individuals will be able to save on health care by using the public option. While it is not a single-payer plan, the plan states that \"over time, the system may evolve toward a single-payer approach if individuals and businesses prefer the public plan.\" and make Medicare the de facto national health program.Edwards said \"The bottom line is we're asking everybody to share in the responsibility of making health care work in this country. Employers, those who are in the medical insurance business, employees, the American people — everyone will have to contribute in order to make this work.\"[27] The plan includes methods for cutting costs in the health care system and creation of revenue sources.[28]","Cost Containment[edit]":{"text":"There are six ways in which Edwards proposes to reduce costs in the health care system."}},"Crime[edit]":{"text":"When asked how to prevent inner city kids from participating in violence, Edwards said, with implied criticism of \"The idea that we're just gonna keep incarcerating, keep incarcerating, pretty soon we're not going to have a young African-American male population in America. They're all going to be in prison, or dead. One of the two.\" Instead of supporting such a notion, he said the government should spend more money on health care and education in order to prevent young people from leading a life of crime.[37]"},"Economic Policy[edit]":{"Energy Independence and Stopping Global warming[edit]":{"text":"John Edwards' positions on energy are documented on his 2008 Presidential Campaign website.[5]In March 2007 he was the first presidential candidate to make his campaign “carbon neutral.” He started buying carbon offsets to reduce his carbon emissions and having his offices buy recycled paper products.[6][7]One of the main focuses of his campaign was fighting global warming.[8] He has said \"Why has America not addressed global warming in a serious way? There's a very simple answer for that. Oil companies, power companies, gas companies and their lobbyists in Washington, D.C.\" [9] He voted against drilling in the Arctic five times, and supports the standard that would require renewable sources to be the source of 10 percent of America's electricity by 2020.Edwards endorses the widespread goal of 80% reductions of greenhouse gas emissions below 1990 levels by the year 2050. He has denounced the Bush administration for not signing the Kyoto treaty and supports the McCain-Lieberman bill to establish a cap-and-trade system to reduce carbon dioxide emissions.[10] This would involve capping emissions, reducing the cap every year, and auctioning off the right to emit a certain quantity of greenhouse gases. He would then use this estimated $10 billion to fund research for alternative energy sources, in an effort to end the United States reliance on imported foreign oil."},"End Poverty in 30 Years[edit]":{"text":"One of Edwards' main themes as a political figure is the problem of poverty in America. He believes that poverty can be cut by one third by 2016 and eliminated by 2036. He supports adoption of the National Academy of Science's recommendations for measuring poverty, which he claims would add 1 million people to the \"poverty\" class. His plan involves several tactics. These include stronger families, better schools and government-funded housing vouchers. Edwards argues in favor of creating one million housing vouchers over five years in order to place poor people in middle-class neighborhoods and in areas where jobs are available. He also supports strengthening labor unions and raising the minimum wage to $8.40.[1][2] Edwards has stated, \"If we truly believe that we are all equal, then we should live together too.\"[3][4]"},"College for everyone[edit]":{"text":"Edwards has stated that if people agree to work part-time during their first year at a public-college, the government should pay for their tuition, books and fees.Edwards has advocated his College for Everyone program based on proposal made in his 2004 campaign and the successful College for Everyone pilot program that Edwards and the Carolina non-profit organization Promise and Opportunity Foundation began at Greene Central High School in Snow Hill, North Carolina, a high school in rural eastern North Carolina with a high percentage of economically disadvantaged students.Under Edwards' College for Everyone program, the government would help all qualified students pay for college tuition, fees and books for college students who agree to work part-time ten hours a week if they \"complete coursework that prepares them for further education, stay out of trouble, and enroll in a participating public university or community college.\" Funds would be provided for two million students.Other aspects of the plan include strong preparation in high school, with College for Everyone students being required to complete a college-prep curriculum in high school and Edwards administration \"working with school districts to strengthen high school curricula.\"The most significant part of the College for Everyone is its proposed overhaul of the student loan program. Edwards has called for an end to large federal subsidies for banks that make student loans, which would free up $6 billion. Instead, subsidies would be replaced with loans directly from the U.S. Department of Education, \"receiving loans that have very similar terms but are far less expensive for taxpayers.\""},"text":""},"Foreign Policy[edit]":{"War on Terrorism[edit]":{"text":"Edwards has criticized the handling of the War on Terrorism by the Bush Administration. Edwards feels that the War on Terrorism was misnamed: \"It is now clear that George Bush's misnamed 'War on Terror' has backfired — and is now part of the problem.\"[29]He went on later to say, \"The War on Terror is a slogan designed only for politics, not a strategy to make America safe. It's a bumper sticker, not a plan.\""},"text":"","Iraq and the Middle East[edit]":{"text":"Edwards voted for the 2002 Iraq War Resolution, and was one of 16 Senators to co-sponsor an early version of that bill, Joe Lieberman's S.J Res 46, which was not brought to the floor for a vote.[30] Three years after the war began, in November 2005, Edwards said that the decision to go to war in Iraq was a mistake. He apologized for his vote, saying that the intelligence reports which led to the decision were \"deeply flawed and, in some cases, manipulated to fit a political agenda.\" He favors gradual troop withdrawal and concurrent training of Iraqi troops, as well as removing American contractors, instead awarding such reconstruction contracts to Iraqi businesses to promote the Iraqi economy and reduce unemployment in Iraq.[31]On January 14, 2007 Edwards spoke at New York City's Riverside Church as keynote speaker at a Martin Luther King Day commemoration. In the speech Edwards criticized silence on the \"escalation of the war in Iraq,\" reminding people about King's vocal opposition to the Vietnam War forty years earlier.[32]In a February 2007 appearance on Meet the Press, Edwards told Tim Russert, \"over time, when I reflected on what I thought was going to be necessary going forward, to have some moral foundation to work on issues like poverty and genocide, things that I care deeply about, I could no longer defend this vote. It was pretty simple. And I got to the place I felt like I had to say it and had to say it publicly. And so— what? — a year — a year or so ago I did that.\"[27] He subsequently apologized for that military authorization vote.Edwards was a vocal critic of the Iraq War troop surge of 2007, calling the surge the \"McCain Doctrine\" in reference to Sen. John McCain's support for the strategy.[33] He has stated that he cannot guarantee to pull all U.S. combat troops from Iraq by the end of the next presidential term in 2013, but added he would \"immediately draw down 40,000 to 50,000 troops.\"[34] In October 2007, Edwards called for limits on the role of private military contractors in Iraq and elsewhere.[35] At the beginning of 2008, Edwards proposed withdrawal of all troops from Iraq in the first 10 months if he became president.Despite President Bush's vetoes of funding bills with withdrawal timetables, Edwards urged Congressional Democrats to not acquiesce, but instead to continually present bills that include such timetables.[36]"}},"Social Policy[edit]":{"National Service[edit]":{"text":"John Edwards opposes a military draft.[11]"},"LGBT issues[edit]":{"text":"During his 2004 Vice Presidential run, Edwards stated he was opposed to same-sex marriage.[15] In late December 2006, in an interview with George Stephanopoulos of ABC News, Edwards said, \"Do I believe they should have the right to marry? I'm just not there yet...\"[16] Edwards opposes a constitutional amendment banning same-sex marriage, preferring to leave that decision up to individual states.[15] He supports the repeal of the Defense of Marriage Act (DOMA).[17] He does support letting states decide on civil unions and partnership benefits.[15]"},"Abortion[edit]":{"text":"Edwards supports legal access to abortion. He received a 100% rating from NARAL each year he was in the Senate, indicating a pro-choice voting record. He also supports public funding for abortion services for low-income women.[12] Edwards issued a press statement saying he was \"saddened\" by the passage of the Partial-Birth Abortion Ban Act, and described this law as \"offensive to women.\" Although absent from the official vote,[13] Edwards had voted against the bill in previous versions.[14]"},"Immigration[edit]":{"text":"Edwards supported the expansion of the H-1B visa program to increase the number of work visas for immigrant workers.[18] Edwards supports expanding legal immigration to the United States while working with Mexico to provide better border security and stop illegal trafficking.[19]On February 7, 2007 Edwards said in a Cox News Service Q&A that \"We want to change the immigration system, so people can get on the path to citizenship.\"[20]"},"text":"","Cannabis legalization[edit]":{"text":"Edwards has said he is against the legalization of recreational Cannabis.[23] He currently supports legal use of marijuana for medical purposes. He said that if given doctors' approval, seriously ill patients should be allowed to use marijuana.[citation needed]"},"Civil liberties[edit]":{"text":"Edwards voted in favor of the 2001 version of the USA PATRIOT Act along with all but one senator, Russ Feingold of Wisconsin.[21] He subsequently criticized the Bush administration for \"abusing its powers in implementing the [Patriot Act].\"[22] Edwards was no longer in the Senate when the Patriot Act was reauthorized."}}}