{"Structure of government[edit]":{"Campaign finance regulation[edit]":{"text":"Johnson believes the only necessary campaign finance reform is a mandate of \"100% transparency.\"[7]In 2012, Johnson suggested that he would support the consideration of a public financing system for federal campaigns if elected. He also signaled support for a constitutional amendment process to overturn the US Supreme Court's ruling in the case of Citizens United v. Federal Election Commission.[34]"},"States' rights[edit]":{"text":"Johnson says, \"After great deliberation, the Founders clearly based the blueprint for our government on the fundamental idea that there must be strict constraints on Federal power — an idea from which we have strayed much too far.\" [37] He believes \"that the proper balance needs to be restored between the different branches of government,\" which \"includes the rights of states.\"[37]"},"text":"","Judicial appointments[edit]":{"text":"Johnson promises to appoint only those judges \"who will interpret the Constitution according to its original meaning.\" He believes that any \"court decision that does not follow this original meaning of the Constitution should be revisited.\"[38]"},"Eminent domain[edit]":{"text":"Johnson opposes using the eminent domain power to benefit private entities.[7]"},"Civil liberties[edit]":{"text":"Johnson believes the \"government should protect the value of individuals and their civil liberties\" and \"should not intervene in the private lives of individual citizens unnecessarily. Personal liberty and freedom from unwarranted governmental control or regulation should allow law-abiding individuals to pursue their own desires as long as they are not causing harm to other people.\"[35] He believes the role of government is to \"protect us from individuals who might or do us harm,\" but \"should be out of our lives for the most part.\" He believes \"our civil liberties are being eroded\" and that Americans are \"giving up [their] civil rights in the name of fear.\"[35]Johnson opposes the USA PATRIOT Act, and believes it should be allowed to expire.[36] He believes this would \"restore proper judicial oversight to federal investigations and again require federal investigators to prove probable cause prior to executing a search.\"[36] Johnson says \"habeas corpus should be respected entirely, requiring the government to either charge incarcerated individuals with a crime or be released.\"[36]Johnson supports private alternatives to the TSA, which he says \"should take a risk-based approach to airport security. Only high-risk individuals should be subjected to invasive pat-downs and full-body scans.\"[36] He believes non-government airport screeners \"can be held fully accountable for their successes and failures.\"[36]"}},"Military and foreign policy[edit]":{"Uganda[edit]":{"text":"In April 2012, Gary Johnson stated he supported the United States' efforts to aid African troops in tracking down Lord’s Resistance Army leader Joseph Kony who heads what he called arguably \"the worst terrorist group that’s been on the planet for the last 20 years.” He stated that although Congress had passed legislation authorizing U.S. intervention, signed by Obama, and that in such case “I would have had plans to immediately ask for a volunteer force and gone in and wipe ‘em out.\"[23]"},"Iraq[edit]":{"text":"Johnson opposed the Iraq War since its beginning,[4] and called for the American presence in Iraq to end.[29] He says that because \"Saddam Hussein has been out of power in Iraq for nearly eight years,\" American troops \"must leave so Iraq can have a chance to grow into a responsible member of the world community.\"[22]"},"Non-state terrorism[edit]":{"text":"Johnson says the United States \"should be protected from terrorism and those that attack America should be brought to justice quickly and efficiently,\" and believes it \"should be proactive in such matters.\"[21] He opposed the USA PATRIOT Act, and has said that it should be allowed to expire.[7]Johnson opposes \"physical or psychological torture\" for any \"criminal or terrorist suspect captured by the U.S.\" He believes that \"individuals incarcerated unjustly by the U.S.,\" \"whether at Guantanamo Bay or elsewhere,\" \"should have the ability to seek compensation through the courts,\" \"must be given due process via the courts or military tribunals, and must not be held indefinitely without regard to those fundamental processes.\"[22]Though Johnson believes the practice of holding persons at Guantanamo Bay without charge or hearing should end, he does not necessarily favor closing the detention camp there. He says that, even if it were closed, there would have to be \"some facility somewhere\" like it to hold enemy combatants. Johnson has said that trying enemy combatants by military tribunal is \"a fair way to go about trying these individuals\" that does not infringe on their civil liberties.[27]"},"text":"Johnson believes it \"is important to have a strong defense both at home and abroad,\"[21] and that the \"military should remain the most potent force for good on Earth,\"[22] but believes the greatest threat to national security at present is that \"we're bankrupt.\" He would include a 43% cut to the military's budget in his proposed balanced budget by concentrating on defense, rather than offense.[7] He has stated: “When you talk about a 43 percent reduction in military spending, that’s going back to 2003 funding levels, not the end of the world\".[23] He advocates making \"better use of military alliances which allow greater sharing of the human and financial burdens at less cost of protecting national interests.\"[22]Johnson says the United States \"should resort to military action as the last option and only as provided in the Constitution.\"[22] He believes the continuing American military presence in Europe, in Japan and in South Korea should be reduced by at least 43%, and that the United States should end its military involvements in Afghanistan immediately. During the Iraq War, Johnson called for the end of U.S. military involvement in Iraq and Libya. He would propose cuts to the military's uniformed and civilian personnel, research and development, intelligence, and nuclear weapons,[7][24] all of which would be \"carefully considered\" rather than \"across the board.\" He supports reducing the U.S. nuclear arsenal, saying, \"Do we really need to blow up the world 23 times over, or would eight times be sufficient?\"[25] Because Johnson has talked about humanitarian interventions, many libertarians have questioned if he is as committed to noninterventionism as congressman Ron Paul, who was running for president as a Republican.[26]Johnson said in an April 2012 Daily Caller interview that he favors withdrawing or reducing American forces in Europe and East Asia, but not necessarily the Middle East. He also said he stood by comments to the Weekly Standard that he might support waging war for humanitarian reasons, saying he would not \"sit idly by and watch something like the Holocaust go down.\" He also stated that while he thought drone attacks create more enemies than they kill, he would not necessarily stop the drone attacks in Pakistan or Yemen, leaving all options on the table.[23]","Afghanistan[edit]":{"text":"Johnson initially supported the war in Afghanistan as a response to the September 11 attacks, reasoning \"We were attacked, and we attacked back.\" However, he opposes continued military involvement in Afghanistan, stating that \"after being in Afghanistan for six months I think we effectively wiped out al Qaeda.\"[28] He also believes the United States \"should not be borrowing money to build roads, bridges, schools and other infrastructure in foreign countries, especially when such help is currently needed at home. Non-military foreign aid around the world is something we cannot currently afford.\"[21] On April 9, 2012, Johnson told The Daily Caller that while he would withdraw military forces, he would not rule out putting U.S. military bases in Afghanistan.[23]"},"Israel[edit]":{"text":"While running as a Republican, Johnson stated that he \"supports the right of Israel to exist as a sovereign country and believes that the United States should protect that right militarily if needed.\"[21] He also stated that Israel is an important ally, and that America's military alliance with Israel should be maintained, but that he opposes financial aid to Israel, as he does to all countries.[7] He has said he would not follow Israel or any other ally into a war that it had initiated.[30]"},"Libya[edit]":{"text":"Johnson opposed U.S. involvement in the Libyan Civil War.[31] He believes there is no \"clear goal for our military actions in Libya,\" and dislikes that \"the American people are footing the bill\" for military operations there.[22]"},"Iran[edit]":{"text":"Johnson told the Daily Caller that the United States has not engaged Iran diplomatically in a serious manner. He would remind them that if “Iran launches a nuclear warhead they can be assured that they will no longer exist” and that the attack \"will be from Israel.” He also would offer to open up trade with Iran.[23] During his Libertarian Party campaign he stated that he does not believe Iran is a military threat and would use all his presidential power to prevent Israel from attacking Iran.[30]"},"Cuba[edit]":{"text":"Johnson does not oppose charter flights to Cuba.[32]"},"Ukraine[edit]":{"text":"In 2014, following the Russian annexation of Crimea and amidst pro-Russian unrest in Ukraine, Johnson expressed the opinion that the United States should not get involved in Ukraine due to a lack of risk to American national security.[33] He stated that U.S. involvement in Ukraine \"would be like Russia getting involved in the affairs of Puerto Rico.\"[33]"}},"Economic policy[edit]":{"Social Security and Medicare[edit]":{"text":"Johnson believes in continuing Social Security, Medicare, and Medicaid for people who have already paid into the system because \"there are people in need,\" and \"government is the only entity able to provide in some cases.\"[20] But he believes in what he calls enacting \"responsible entitlement reform,\" because the notion \"that we can control spending and balance the budget without reforming Medicare, Medicaid and Social Security\" is \"lunacy.\"[10]Johnson says Social Security is valuable and is fixable without raising taxes.[7] He wants \"Social Security to reflect today's realities without breaking trust with retirees.\"[10] He supports raising the retirement age, multi-pronged means testing for Social Security recipients, and changing the escalator built into Social Security from the wage index to the inflation rate. He wants Congress to investigate privatizing part or all of Social Security with the goal being that the investment of contributions could be self-directed.[7]Johnson supports cutting federal Medicare and Medicaid expenditures by 43% by ending the federal, top-down bureaucracy that controls these programs, including all strings and mandates to states. Instead, he would block grant the remaining funds to the states to control all aspects of their own Medicaid and Medicare programs, making for \"50 laboratories of innovation\" from which best practices would emerge and eventually be duplicated.[7] He believes the states will \"innovate, find efficiencies and provide better service at lower cost.\" He says \"common-sense cost savings\" will place Medicare and Medicaid \"on a path toward long-term solvency.\"[10]Johnson believes that funding for Social Security and Medicare should not come from payroll taxes, but instead should be funded out of revenues from the FairTax.[7]"},"Budget, deficits[edit]":{"text":"Johnson has said that the United States is heading toward an economic crisis similar to the 1998 Russian financial crisis, and that it can be stopped only by balancing the federal budget.[7][8] As such, he promised to submit a balanced budget for the year 2013 and promises to veto any bills containing expenditures in excess of revenues.[7] He promises to look at every decision as a cost-benefit analysis.[9] His budget would cut federal expenditures by 43% in every area, \"across the board,\"[7] including \"responsible entitlement reform,\" because the \"math is simple: federal spending must be cut not by millions or billions, but by trillions.\" He calls the notion \"that we can control spending and balance the budget without reforming Medicare, Medicaid and Social Security\" \"lunacy.\"[10] Johnson supports amending the U.S. Constitution to require an annual balanced budget.[11] Johnson opposes earmarks, and would veto any bills containing them.[10]Johnson did not support the Troubled Asset Relief Program, the American Recovery and Reinvestment Act of 2009, the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010, or any other \"bailout\" or \"stimulus\" bills, and opposes President Barack Obama's proposed American Jobs Act.[7][8] He has said that the federal spending in these laws is wasteful and ineffectual,[7] and calls them \"bloated.\"[10] He once quipped, \"My next-door neighbor's two dogs have created more shovel ready jobs than this current administration.\"[12]Johnson supports ending the federal personal and corporate income tax system and replacing it with the FairTax reform proposal (while systematically reducing these taxes to near-zero levels), a national consumption tax on new goods and services. He believes the FairTax would \"reboot\" the American economy without impacting those at or under the poverty level, who would not be subject to it. He believes that abolishing the federal corporate income tax, which he says is the second highest in the world, would create tens of millions of jobs immediately.[7] Due to his stance on taxes, David Weigel described him as \"the original Tea Party candidate\".[13]"},"Health care[edit]":{"text":"Johnson believes that the \"costs of health care are out of control and something needs to be done to return health care to fiscal solvency.\" He does \"not believe that government should be taking over the health care system.\" Instead, he believes that a \"market-based approach should be the foundation of any solution. A health care insurance system that is privately owned and managed is the best approach to solving our health care problems.\" He favors tort reform and control of frivolous lawsuits as means cutting costs of health care.[19]Johnson opposed the Patient Protection and Affordable Care Act, and believes it should be repealed.[7] He also opposed the Medicare Prescription Drug, Improvement, and Modernization Act, which he calls \"the failed Medicare prescription drug plan,\" and believes it should be repealed."},"Federal Reserve[edit]":{"text":"Johnson has said the Federal Reserve \"needs to be reviewed and managed effectively\"[16] by congressionally auditing it,[10] and that its actions \"should be transparent\". He has stated that Congress should \"take a close look at how the Federal Reserve Bank is operated and regulated. If changes need to be made within the Federal Reserve Bank, they should be made.\"He says, \"We need to know where the money that is being printed is going,\"[16] such as \"the extent to which the Fed has purchased private assets at home and abroad.\"[10] He blames high inflation on the lack of transparency in the Federal Reserve.[16] Johnson opposes quantitative easing, which he says is merely \"printing money and buying debt,\" and which he believes causes \"malinvestment, inflation, and prolonged unemployment.\"[10] He also states that he would not veto a bill that would end the Federal Reserve.[17]While Johnson supported ending the Federal Reserve when questioned about the issue in an online town hall,[18] Johnson only mentions three reforms of the Federal Reserve on his website \"Conduct an audit to provide true transparency of the Federal Reserve's lending practices\", \"Establish clear Congressional oversight\", and \"Get the Federal Reserve out of the business of printing money and buying debt through quantitative easing.\" In a YouTube interview, he says, \"The Federal Reserve's original mandate was price stability. Added on to that was unemployment, or [rather] employment, which I think are at odds with one another. [The] Federal Reserve and central banks should be about a strong U.S. dollar and not a weak U.S. dollar. That's what we have. We have zero percent interest rates, because let's face it. If we didn't have zero percent interest rates right now we would be in the midst of that monetary collapse because of the debt that Americans hold and can't repay.\" Gary also has stated that the Federal Reserve is not a private entity. \"We own the Federal Reserve. There is this misconception that the Federal Reserve is a private entity. It's one thing to borrow money, which is an ok phenomenon. But it is another thing to print money.\""},"text":"","Energy[edit]":{"text":"Johnson favors building new coal-fired and nuclear power plants. He supports private sector research and development of renewable energy, but does not believe doing so is the government's job.[7]"},"Free-market capitalism[edit]":{"text":"Johnson supports free markets and free-market capitalist economics.[7] He says, \"Free markets and limited government are the foundation of prosperity.\"[8] He believes government should foster the free market by allowing businesses freedom to compete without restrictions.[7][8] He opposes government subsidies to business; he believes they wrongly \"pick winners and losers,\" which he says is the consumer's job, not the government's.[7]"},"Free trade[edit]":{"text":"Johnson supports free trade and opposes tariffs, \"period.\" He believes free market trade corrects inequities between trading partners, such as foreign countries' subsidies for certain industries.[7]"},"Labor unions[edit]":{"text":"Johnson says his only issue with trade unions, including teachers' unions, is that they require both good and bad workers to be treated the same. He believes businesses should be allowed to reward good workers and fire bad workers, without collective intervention. He views public-sector unions that contribute to political campaigns as \"dangerous.\"[7]"},"Environment[edit]":{"text":"Johnson has stated that the best environmental practices are due to a good economy.[7] He says \"America needs to be a land with a clean environment,\" and supports \"clean-air and clean-water action and believe[s] in conservationism.\" He cites the Environmental Protection Agency as an example of good government.[14] Johnson has stated he agrees that human carbon emissions do impact the climate. However, he opposes mandatory cap-and-trade policies, and favors allowing private businesses to build more coal-fired power plants, creating jobs.[15]"},"Employment[edit]":{"text":"Johnson believes the main remedy for unemployment is ending \"uncertainty\" for private business. He points to his beliefs on the budget, tax reform, immigration reform, and the environment as ending that uncertainty. He does not believe that government can actually create jobs, but instead that it can foster certainty in private business, which in turn creates jobs.[7]"}},"Social policy[edit]":{"Stem cell research[edit]":{"text":"Johnson opposes public funding of stem cell research, and instead \"should only be completed by private laboratories that operate without federal funding.\"[36]"},"Gun rights[edit]":{"text":"Johnson does not believe in limiting the types or sizes of guns that private citizens can own. He believes the Second Amendment is \"clear,\" and establishes an individual right for citizens.[7]Johnson has stated he is open for debate on the subject of gun control and is open to a discussion on preventing those the government deems mentally ill from possessing weapons.[48]"},"Internet issues[edit]":{"text":"Johnson believes the Internet \"should remain independent, accessible and market-based.\"[44] He opposes Internet neutrality, because he believes it impedes business competition.[7] He also opposes government subsidies to Internet service providers.[44] Additionally, he opposes FCC \"rules regulating content, Internet speeds, and pricing for services,\" because the \"government should not be in the business of picking winners and losers in the content marketplace.\"[44]Under the existing tax system, Johnson does not support taxing internet sales.[7] He says, \"The Internet has flourished and society has benefited immeasurably because it has remained relatively free of taxation. The moratorium on access and service taxation must be made permanent.\"[44] However, he supports the FairTax system, which he acknowledged would apply to internet sales.[7]Johnson opposes any censoring of political speech online, and believes that \"online gambling should be legal for adults.\"[44]"},"Death penalty[edit]":{"text":"Johnson opposes the death penalty completely.[45] Initially, as Governor of New Mexico, he had sought to expand capital sentences to minors, while limiting appeals; he now calls that position \"naïve.\"[45] He believes government inevitably \"makes mistakes with regard to the death penalty,\" and does not \"want to put one innocent person to death to punish 99 who are guilty.\"[45]"},"Education[edit]":{"text":"On the state level, Johnson believes in \"school choice.\" As governor of New Mexico, he sought to implement a school voucher system, which he believes would transform public education into a more \"effective\" system.[7]On the federal level, Johnson believes the Department of Education should be abolished because federal control of state education funding negatively impacts the states: he claims that 11 cents out of every dollar states spent on education comes from the Department of Education, but accepting the money comes with 16 cents of \"strings attached.\" Johnson believes that block-granting education funds to the states without strings, thereby returning all control of education to the states, is the best choice, because it would create \"50 laboratories of innovation\" from which best practices would emerge. He believes that the No Child Left Behind Act and other \"federal mandates\" create a \"terrible\" system of education, and believes they should be repealed. He says that a \"homogenous\" national education system does not work.[7]Johnson believes there is a higher education bubble, and blames it on federal student loan programs. He believes the government should not be \"in the student loan business.\" Instead, he supports a free market in education as a remedy to the bubble.[7]"},"Abortion[edit]":{"text":"Gary Johnson supports \"a woman's right to choose up until the point of viability\"[39] and wants to keep abortion legal.[40] He has been very vocal in his beliefs.[41] He supports legislation banning late-term abortions and mandating parental notification for minors seeking an abortion.[42] Johnson believes Roe v. Wade was wrongly decided and should be overturned because it \"expanded the reach of the Federal government into areas of society never envisioned in the Constitution.\" He believes that laws regarding abortion should \"be decided by the individual states.\"[38]"},"Crime[edit]":{"text":"Johnson blames a great amount of crime in the United States on the failure of drug prohibition, just as occurred with nationwide alcohol prohibition in the 1920s.[43] He says, \"Since only criminal gangs and cartels are willing to take the risks associated with large-scale black market distribution, the War on Drugs has made a lot of dangerous people and organizations very rich and very powerful.\"[43] He says that, like alcohol prohibition, drug prohibition creates \"overdose deaths, gang violence, and other prohibition-related harm.\"[43] He points to his views on ending the War on Drugs as a remedy for most violent crime in America.[43]Johnson believes that crimes \"committed online,\" including \"fraud and child pornography,\" \"should be investigated and treated identically as crimes committed offline.\"[44]"},"Homosexuality issues[edit]":{"text":"Johnson says that \"government doesn't belong in the bedroom.\"[35][35] He believes that the government should not regulate marriage at all.[51] He believes the government \"should not impose its values upon marriage\" but instead \"should protect the rights of couples to engage in civil unions if they wish, as well as the rights of religious organizations to follow their beliefs.\"[36]He applauded the repeal of Don't ask, don't tell, and opined that the repeal was \"long overdue.\"[52]Formerly a supporter of civil unions for same-sex couples, on December 1, 2011, Johnson voiced his support for same-sex marriage. He believes that \"denying those rights and benefits to gay couples is discrimination, plain and simple.\"[53] He has also stated that marriage laws should treat every individual equally.[54]In 2013, Johnson was a signatory to an amicus curiae brief submitted to the Supreme Court in support of same-sex marriage during the Hollingsworth v. Perry case.[55]Gary Johnson favors a federal law to legalize gay marriage across the United States, rather than leaving the issue up to the individual states.[56]"},"Immigration[edit]":{"text":"Johnson believes two approaches to immigration should be implemented: (1) \"simplify legal immigration\" and (2) \"tackle illegal immigration.\"[49] He says, \"Immigration into the United States by ambitious, willing workers and their families is a good thing. Not only is it a historical and energizing part of American culture and experience, it is vital to our economy. These positive benefits should not be sacrificed or reduced in any solution to stop illegal immigration.\"[50]Johnson favors issuing work visas, rather than granting amnesty citizenship or permanent residency, to people who want to work in the United States so that they pay payroll and income taxes,[7] and favors a two-year grace period to current illegal immigrants to obtain these visas.[49] He would require background checks of visa applicants,[49] because federal \"authorities do need to know who is crossing our borders and be able to prevent criminals from entering the country.\"[50] He believes that, once a worker obtains a visa, the worker \"should have access to the normal procedures for gaining permanent status and citizenship, and should be able to bring their families to the U.S. after demonstrating ability to support them financially.\"[49] Johnson does not support immigration quotas.[7]Under the present system, Johnson does not support \"cracking down\" on illegal immigration or creating penalties for businesses that hire undocumented immigrants.[7] Instead, he believes the work visa program will reduce illegal immigration.[49] But once the program is implemented, he believes in enforcing \"a 'one strike, you're out' rule for immigrants who circumvent the\" work visa process,[49] as well as imposing and enforcing \"sanctions on employers for noncompliance with immigration laws.[49]Johnson opposes building a fence or wall along the Mexican border or placing National Guard units there,[7] because \"security measures along the borders are just not enough\" and \"do not completely solve the immigration problem.\"[50] He believes that much of the Mexican-American border problems are due to drug prohibition, and that ending the prohibition of marijuana and the War on Drugs would end 75% of the violence along the border.[7][43][49]Johnson opposed Arizona SB 1070, and says he would have vetoed it were he the governor, though he understands and supports the spirit behind it. He says that the bill was devastating to drawing business to Arizona and believes the bill will create racial discrimination.[7]"},"text":"Johnson has stated, \"I am not a social conservative in any way, shape, or form.\" He believes the majority of Republicans are not social conservatives, but rather are fiscal conservatives. He says he respects and understands socially conservative beliefs, but he has a difference of opinion. He says Republicans come together over fiscal issues, which are his primary concern.[7]","Drinking age[edit]":{"text":"Johnson is in favor of lowering the drinking age to 18, or eliminating the drinking age outright.[46]"},"Drug policy[edit]":{"text":"Johnson says his drug policy is \"Don't do drugs.\"[47] He believes drugs are \"harmful, addictive and destructive to our lives and society.\"[47] He believes the same about alcohol, and has not had a drink in decades.[47]However, Johnson believes that the War on Drugs has not been successful, and should be ended.[47] He \"believes it is insane to arrest roughly 800,000 people a year for choosing to use a natural substance that is, by any reasonable objective standard, less harmful than alcohol, a drug that is advertised at every major sporting event.\"[43] He compares present-day drug prohibition to the failed alcohol prohibition in the 1920s.[47] He says \"90% of the drug problem is prohibition-related, not use-related.\"[47]Johnson believes that marijuana should be legalized, regulated, and taxed, \"just like tobacco.\"[47] But he promises \"it will never be legal for a person to smoke marijuana, become impaired, and get behind the wheel of a car or otherwise do harm to others, and it will never be legal for kids to smoke marijuana.\"[43][47] If elected, he would de-schedule marijuana by executive order.[7] He says this \"would lead to a lower price for the product and eliminate the criminal element from its distribution, much like the repeal of the prohibition of alcohol many decades back.\"[47]Johnson does not advocate outright legalization of other drugs.[7][47] Instead, he believes other drugs should be treated as a health problem rather than a criminal justice problem.[7] He believes these steps will lessen crime in the United States, help balance the budget, increase the quality of courts and prisons,[47] and protect civil liberties.[35]"},"Tobacco control[edit]":{"text":"Johnson opposes special sin taxes on cigarettes.[7]"}}}