{"Foreign policy[edit]":{"Iraq War[edit]":{"text":"Cynthia McKinney is a supporter of pacifism through diplomacy. She believes the war in Iraq was the United States' way of getting Iraq's natural resources. She states that the only thing separating this war from brutal wars of the past is that now we have more technology. She states the war is immoral and illegal, and that troops should be pulled out of Iraq immediately.[10]"},"Nuclear weapons[edit]":{"text":"Cynthia McKinney supports the reduction of nuclear weapons in the U.S. She is a strong supporter of the Comprehensive Nuclear-Test-Ban Treaty, which bans all nuclear explosions for every circumstance everywhere, and also honors the Nuclear Non-Proliferation Treaty. She also wants to re-enter the Anti-Ballistic Missile Treaty, which was an agreement removed under George W. Bush in 2002 after it had limited anti-ballistic missile systems used to protect nuclear weapons in the U.S. and Soviet Union. She also wants to ban the manufacture and use of depleted uranium. Other nuclear plans she disproves of are the \"Star Wars\" and \"Nukes in Space\" plans.[13]"},"Kosovo[edit]":{"text":"Cynthia McKinney voted yes to prevent the United States from invading Kosovo in 1999.[11] She also wants to close United Nations psychiatric hospitals in Kosovo because there is proof many prisoners have been raped and beaten in front of apathetic staff in the facility.[12]"},"Israel and Palestine[edit]":{"text":"McKinney believes the United States should start listening to Israeli and Palestinian officials, not to the American Israel Public Affairs Committee. She believes the United States should not decide a 2-state policy, but instead ask the advocates in the Middle East. She says that she opposes \"the Israeli occupation of and genocidal policies toward Palestine.\" [9]"},"text":"","Pakistan[edit]":{"text":"\"Free and fair elections, not U.S. troops, are the best strategy for achieving peace and stability in Pakistan.\" is the belief of Cynthia McKinney in Pakistan. McKinney has met with former Prime Minister of Pakistan Benazir Bhutto - although she has refused to meet with former President of Pakistan Pervez Musharraf because she believed he was a dictator - and feels that the United States would be very useful to Pakistan to help end skewed elections. She hopes that America does not declare war on Pakistan only because of the aftermath of Bhutto's resign. [14]"},"Czech Republic[edit]":{"text":"Cynthia McKinney is in strong favor of the citizens of the Czech Republic with their anti-Star Wars missile strikes. She states that the George W. Bush Administration has deceived the citizens of the Czech Republic, who participated in a hunger strike in order to hault the program. In a letter of apology to the Czech Republic, she stated \"Dr. Martin Luther King, Jr. once remarked that the United States was the greatest purveyor of violence on the planet. Sadly, that has not changed.\"[15]"},"Cuba[edit]":{"text":"McKinney has voted to keep travel restrictions on United States' citizens until Cuba has released all political prisoners and extradited all criminals sought after by America. [9]"}},"Economic policy[edit]":{"Financial crisis & bailout[edit]":{"text":"She is against the $700 billion bailout to Wall Street. She offered a counterpart plan, \"A Gift for a Generation,\" that includes: a moratorium on foreclosures; elimination of all adjustable-rate mortgages and their renegotiation into 30- or 40-year loans; establishment of new mortgage lending practices to end predatory and discriminatory practices; establishment of criteria and construction goals for affordable housing; redefinition of credit and regulation of the credit industry so that discriminatory practices are completely eliminated; full funding for initiatives that eliminate racial and ethnic disparities in home ownership; recognition of shelter as a right according to the UN's Declaration of Human Rights; target funds to cushion job loss and provide for retraining of those at the bottom of the income scale as the economy transitions; close all tax loopholes and repeal of the Bush tax cuts for the top 1% of income earners; fairly tax corporations, denying federal subsidies to those who relocate jobs overseas repeal NAFTA; appoint former Comptroller General David Walker to fully audit all recipients of taxpayer cash infusions, including JP Morgan, Bear Stearns, Fannie Mae, Freddie Mac, and AIG, and to monitor their trading activities into the future; eliminate all derivatives trading; nationalize the Federal Reserve and establish a federally owned, public banking system that makes credit available for small businesses, homeowners, manufacturing operations, renewable energy and infrastructure investments; and criminally prosecute any activities that violated the law, including conflicts of interest that led to the current crisis.[6]"},"Health care[edit]":{"text":"Cynthia McKinney supports single-payer health care. She also wants to eliminate insurance from health care and believes affordable health care is part of national security.[4] She also believes if medication is cheaper internationally, then citizens should be able to purchase it. She also supports cheaper drugs in the U.S. through federal negotiation and opposes uniform sterilization.[5]"},"Technology[edit]":{"text":"In 2005 McKinney voted to support the Broadcast Decency Enforcement Act of 2005-- which penalizes companies or people for obscene, or other grotesque broadcasting. She also wants America to adopt the Canadian Broadcasting Company's principles and co-sponsored the Anti-Spamming Act, which punished criminals for spamming online. [7]"},"Tax reform[edit]":{"text":"McKinney has voted no on tax cuts for small businesses, income tax, capital gains, dividends, and estate tax, but she did vote to eliminate the marriage penalty.[2]"},"Defense spending[edit]":{"text":"McKinney believes the defense spending of the United States is too high and unreasonable. She believes the budget should have been raised after the September 11th attacks, but if they were used properly they could now be lowered. [1]"},"Network neutrality[edit]":{"text":"In June, 2006 McKinney voted to create U.S. network neutrality. This follows her stance for a non-discriminatory nation.[8]"},"text":"","Free trade[edit]":{"text":"McKinney wants to put a stop to free trade agreements, such as the North American Free Trade Agreement and Central America Free Trade Agreement. She also is unsupportive of Fast Track, giving China a most favoured nation status, and the World Trade Organization.[3]"}},"Social policy[edit]":{"Education[edit]":{"text":"McKinney is a strong supporter of education. She has often stated that it is wrong public education receives $38 billion annually while the Pentagon receives $700 billion annually. She also believes reforms like No Child Left Behind hurt the education system, and that free higher education and better primary education is what will improve school systems throughout the nation. She also voted yes on a substitute bill to lower student loan interest rates and increase black college and Hispanic college quality and quantity. She voted yes on a bill for state-testing and voted no on bills to allow vouchers in the District of Columbia, allowing vouchers in private schools and parochial schools, and no on a bill that would only give federal aid to schools that allowed school prayer.[23]"},"Abortion[edit]":{"text":"McKinney is a firm believer of abortion rights. She opposed bills that would have restricted interstate travel for minors looking for an abortion, made it a crime to harm a fetus while committing another crime, and banned Family Planning in the U.S. and globally. She also voted in 2000 against the Partial-Birth Abortion Ban Act, which came into effect in 2003. In 2001 she was on EMILY's List, a pro-choice group, and in 2006 she received the lowest possible score on the pro-life group National Right to Life Committee's scale assessing politicians record on the issue of abortion. [17]"},"Crime[edit]":{"text":"It is the main focus of McKinney's stance on crime that capital punishment should be replaced with life imprisonment. She has voted no on bills that would make death penalty appeals harder and the prosecution and sentencing of juvenile delinquency. She has voted yes on bills that would keep habeas corpus rights in death penalty appeals, as well as yes on bills to replace the death penalty and finding alternative sentences to capital punishment. She also supports stronger sentencing for hate crimes.[17]"},"Immigration[edit]":{"text":"McKinney believes that there should be no skilled worker visas, but that there should be no separation barrier between the U.S. and Mexico or Canada. She also believes it is unjust to say that illegal immigrants have stolen jobs in the nation. She has voted to keep the Minutemen Project secretive for immigrants and voted no on extending immigrant residency rules.[24]"},"text":"","LGBT rights[edit]":{"text":"McKinney supports gay adoption, voting no on a District of Columbia bill that would ban them in 1999, and received an 80% rating by the Human Rights Campaign for a pro-gay rights stance. [17]"},"Affirmative action[edit]":{"text":"McKinney feels that affirmative action should be kept in college admissions, which resulted in her voting no on the Higher Education Amendments Act of 1997 that would have made it so every form of post-secondary education would disregard race. The National Association for the Advancement of Colored People gave McKinney a 97% pro-affirmative action stance. [22]"},"Gun control[edit]":{"text":"McKinney supports strict gun control on all people who may be a danger to society, which may even include police officers and government officials.[25] In 1999 she voted no on a bill that would decrease gun waiting period and in 2005 voted no on a bill that would exempt gun companies from accidental death lawsuits as well as prevent the manufacturing of armor-piercing shots and shells.[26]"}},"Energy and environmental policy[edit]":{"Everglades[edit]":{"text":"Early in her career, McKinney voted against the Florida Everglades Amendment, an amendment that would make taxpayers responsible for repairing the damage done by sugar-growing on the Everglades.[21] Seeing as Green politics is the main stance of the Green Party, Cynthia McKinney supports the preservation of the Everglades."},"Alternative energy sources[edit]":{"text":"In her own words, McKinney states \"I viewed Stockton’s corn fields now primed to supply the newly constructed ethanol plant instead of satisfy human food needs.\"[18] She, as well as other Greens, believe ethanol should not be the main focus of alternative energy because it will lessen the food supply.[19]McKinney has maintained the stance that the United States should become nuclear power and carbon power free. [17] She says that there are safer and more effective ways to get clean energy in America besides nuclear power, mainly because the waste cannot be disposed of properly. She called it a \"carbon-intense way to boil water.\" [20]"},"Energy dependence[edit]":{"text":"\"Leave the oil in the soil.\" is McKinney's main philosophy on energy dependence, stating that this approach would push the economy to creating jobs and using environmental technology to use as energy.[16]"},"text":"","ANWR[edit]":{"text":"McKinney has opposed Arctic National Wildlife Refuge drilling, and in 2001 supported permanently preserving Alaska's ANWR. [16][17]"}}}