{"Historical views[edit]":{"text":"Roosevelt's definitive 1882 book The Naval War of 1812 was the standard work on the topic for two generations and is still extensively quoted. Roosevelt undertook extensive and original research, computing British and American man-of-war broadside throw weights.[13] However, his biographies Thomas Hart Benton (1887)[14] and Gouverneur Morris (1888)[15] are considered[by whom?] hastily written and superficial.[16] His four-volume history of the frontier titled The Winning of the West (1889–1896) had a notable impact on historiography, as it presented a highly original version of the frontier thesis elaborated upon by his friend Frederick Jackson Turner in 1893.Roosevelt argued the frontier conditions created a new race: the American people that replaced the \"scattered savage tribes, whose life was but a few degrees less meaningless, squalid, and ferocious than that of the wild beasts with whom they held joint ownership.\" He believed, \"the conquest and settlement by the whites of the Indian lands was necessary to the greatness of the race and to the well-being of civilized mankind.\" His many articles in upscale magazines provided a much-needed income. He was later chosen president of the American Historical Association."},"Corporate Regulations[edit]":{"text":"In the Eighth Annual Message to Congress (1908), Roosevelt mentioned the need for federal government to regulate interstate corporations using the Interstate Commerce Clause, also mentioning how these corporations fought federal control by appealing to states' rights:— \"Of course there are many sincere men who now believe in unrestricted individualism in business, just as there were formerly many sincere men who believed in slavery -- that is, in the unrestricted right of an individual to own another individual. These men do not by themselves have great weight, however. The effective fight against adequate government control and supervision of individual, and especially of corporate, wealth engaged in interstate business is chiefly done under cover; and especially under cover of an appeal to States' rights.... The chief reason, among the many sound and compelling reasons, that led to the formation of the National Government was the absolute need that the Union, and not the several States, should deal with interstate and foreign commerce; and the power to deal with interstate commerce was granted absolutely and plenarily to the central government... The proposal to make the National Government supreme over, and therefore to give it complete control over, the railroads and other instruments of interstate commerce is merely a proposal to carry out to the letter one of the prime purposes, if not the prime purpose, for which the Constitution was founded. It does not represent centralization. It represents merely the acknowledgement of the patent fact that centralization has already come in business...— I believe that the more far-sighted corporations are themselves coming to recognize the unwisdom of the violent hostility they have displayed during the last few years to regulation and control by the National Government of combinations [monopolies] engaged in interstate business. The truth is that we who believe in this movement of asserting and exercising a genuine control, in the public interest, over these great corporations have to contend against two sets of enemies, who, though nominally opposed to one another, are really allies in preventing a proper solution of the problem. There are, first, the big corporation men, and the extreme individualists among business men, who genuinely believe in utterly unregulated business -- that is, in the reign of plutocracy; and, second, the men who, being blind to the economic movements of the day, believe in a movement of repression rather than of regulation of corporations, and who denounce both the power of the railroads and the exercise of the Federal power which alone can really control the railroads.\" [4]"},"Immigration[edit]":{"text":"In an 1894 article on immigration, Roosevelt said, \"We must Americanize in every way, in speech, in political ideas and principles, and in their way of looking at relations between church and state. We welcome the German and the Irishman who becomes an American. We have no use for the German or Irishman who remains such... He must revere only our flag, not only must it come first, but no other flag should even come second.\"[1]"},"Conservationist[edit]":{"text":"In a speech that Roosevelt gave at Osawatomie, Kansas, on August 31, 1910, he outlined his views on conservation of the lands of the United States:Conservation means development as much as it does protection. I recognize the right and duty of this generation to develop and use the natural resources of our land but I do not recognize the right to waste them, or to rob, by wasteful use, the generations that come after us. I ask nothing of the nation except that it so behave as each farmer here behaves with reference to his own children. That farmer is a poor creature who skins the land and leaves it worthless to his children. The farmer is a good farmer who, having enabled the land to support himself and to provide for the education of his children, leaves it to them a little better than he found it himself. I believe the same thing of a nation.Moreover, I believe that the natural resources must be used for the benefit of all our people, and not monopolized for the benefit of the few, and here again is another case in which I am accused of taking a revolutionary attitude. People forget now that one hundred years ago there were public men of good character who advocated the nation selling its public lands in great quantities, so that the nation could get the most money out of it, and giving it to the men who could cultivate it for their own uses. We took the proper democratic ground that the land should be granted in small sections to the men who were actually to till it and live on it. Now, with the water-power, with the forests, with the mines, we are brought face to face with the fact that there are many people who will go with us in conserving the resources only if they are to be allowed to exploit them for their benefit. That is the one of the fundamental reasons why the special interests should be driven out of politics.Of all the questions which can come before this nation, short of the actual preservation of its existence in a great war, there is none which compares in importance with the great central task of leaving this land even a better land for our descendants than it is for us, and training them into a better race to inhabit the land and pass it on. Conservation is a great moral issue, for it involves the patriotic duty of insuring the safety and continuance of the nation. Let me add that the health and vitality of our people are at least as well worth conserving as their forests, waters, lands, and minerals, and in this great work the national government must bear most important part.[3]"},"Views on Civilization[edit]":{"text":"In The Winning of the West (1889–1896), Roosevelt's frontier thesis stressed a struggle between \"civilization\" and supposed savagery. Excerpts:On August 13 and 14, 1906, Brownsville, Texas was the site of what has come to be known as the Brownsville Affair. Racial tensions were high between white townsfolk and black infantrymen stationed at Fort Brown. On the night of August 13, one white bartender was killed and a white police officer was wounded by rifle shots in the street. Townsfolk, including the mayor, accused the infantrymen as the murderers. Without a chance to defend themselves in a hearing, President Roosevelt dishonorably discharged the entire 167 member regiment due to their accused \"conspiracy of silence\". Further investigations in the 1970s found that the black infantrymen were not at fault, and the Nixon Administration reversed all of the dishonorable discharges.[5]On the other hand, Roosevelt felt that the equality for the black race would come through progress from one generation to the next.[6] For this, he was lauded by liberal whites, and was received as the usher of a new era in the black community.[7] William McGill, a black preacher in Tennessee, wrote: \"The administration of President Roosevelt is to the Negro what the heart is to the body. It has pumped life blood into every artery of the Negro in this country.\"[8] Pope Leo XIII remarked approvingly of TR’s determination “to seek equality of treatment of all the races.”[9]Roosevelt wrote to a friend that, regarding the difficult issue of race relations, “I have not been able to think out any solution of the terrible problem offered by the presence of the Negro on this continent, but of one thing I am sure, and that is that inasmuch as he is here and can neither be killed nor driven away, the only wise and honorable and Christian thing to do is to treat each black man and each white man strictly on his merits as a man, giving him no more and no less than he shows himself worthy to have.”[10] Additionally, Roosevelt risked outrage (and perhaps physical harm) while speaking to a heavily armed crowd in Butte, Montana during his 1903 Western tour: “I fought beside colored troops at Santiago [Cuba], and I hold that if a man is good enough to be put up and shot at then he is good enough for me to do what I can to get him a square deal.”[11]Perhaps his attitude is best understood in comparison to those of others in his time, who accused him of “mingling and mongrelization” of the white race; notably Democratic Sen. Benjamin Tillman of South Carolina, who commented on Roosevelt's dining with Booker T. Washington: “The action of President Roosevelt in entertaining that nigger will necessitate our killing a thousand niggers in the South before they learn their place again.”[12]"},"Direct Election of Senators[edit]":{"text":"The direct election of senators(which later became the 17th amendment) was an important initiative for progressives of the era, with Roosevelt being among the supporters of the idea. He spoke frequently[17] on the campaign trail[18] about the issue, and it is included in the platform of the Progressive Party (United States, 1912).[19]"},"Square Deal[edit]":{"text":"Theodore Roosevelt introduced the phrase \"Square Deal\" to describe his Progressive views in a speech delivered after leaving the office of the Presidency in August 1910. So many of the specifics outlined in the address anticipate Franklin Roosevelt's New Deal that he could hardly have been disappointed in the work of his kinsman, had he lived to witness it:— \"Practical equality of opportunity for all citizens, when we achieve it, will have two great results. First, every man will have a fair chance to make of himself all that in him lies; to reach the highest point to which his capacities, unassisted by special privilege of his own and unhampered by the special privilege of others, can carry him, and to get for himself and his family substantially what he has earned. Second, equality of opportunity means that the commonwealth will get from every citizen the highest service of which he is capable. No man who carries the burden of the special privileges of another can give to the commonwealth that service to which it is fairly entitled.— I stand for the square deal. But when I say that I am for the square deal, I mean not merely that I stand for fair play under the present rules of the game, but that I stand for having those rules changed so as to work for a more substantial equality of opportunity and of reward for equally good service... When I say I want a square deal for the poor man, I do not mean that I want a square deal for the man who remains poor because he has not got the energy to work for himself. If a man who has had a chance will not make good, then he has got to quit... Now, this means that our government, National and State, must be freed from the sinister influence or control of special interests. Exactly as the special interests of cotton and slavery threatened our political integrity before the Civil War, so now the great special business interests too often control and corrupt the men and methods of government for their own profit. We must drive the special interests out of politics... For every special interest is entitled to justice, but not one is entitled to a vote in Congress, to a voice on the bench, or to representation in any public office. The Constitution guarantees protection to property, and we must make that promise good. But it does not give the right of suffrage to any corporation. The true friend of property, the true conservative, is he who insists that property shall be the servant and not the master of the commonwealth; who insists that the creature of man's making shall be the servant and not the master of the man who made it. The citizens of the United States must effectively control the mighty commercial forces which they have themselves called into being.\""}}