{"Foreign policy[edit]":{"Iraq War[edit]":{"text":"On March 19, 2003, Bush ordered an invasion of Iraq, launching the Iraq War. That night, he addressed the nation, stating that he decided to invade Iraq \"to disarm Iraq, to free its people and to defend the world from grave danger\".[8] The United States and its allies charged that Saddam Hussein's government possessed weapons of mass destruction (WMD), and thus posed a serious and imminent threat to the security of the United States and its coalition allies.[9][10] This assessment was supported by the U.K. intelligence services, but not by other countries such as France, Russia and Germany. It was later and after the war revealed that here were never any weapons of mass distraction and this was confirmed by multiple international and national commissions.[11][12][13]"},"Homeland security[edit]":{"text":"After the attacks on the World Trade Center on September 11, 2001, President Bush founded the Cabinet Department of Homeland Security. He initially opposed it, saying that it was unnecessary because its concerns were already the province of other agencies; then changed his mind in June 2002 to approve of the proposal, with its official creation delayed until November 2002 due to disagreements over whether or not employees of the department should have the usual labor protections.[14]"},"text":"","Iran[edit]":{"text":"Bush had declared Iran part of the \"axis of evil\" for its alleged support of terrorism."}},"Economic policy[edit]":{"Fiscal policy and taxation[edit]":{"text":"George Bush supports enacting generous tax cuts in the model of Ronald Reagan's supply-side fiscal policies. He believes this helps the economy at large."},"Entitlement Reform[edit]":{"text":"Bush supports the privatization of Social Security by allowing individuals to set up personal retirement accounts.[4] He also supported the expansion of Medicare to cover prescription drugs using private insurance through his Medicare Part D program."},"Health care[edit]":{"text":"Bush supports a free-market health care system, and opposes a universal health plan.In 2004, Bush planned a health care program that he said would cover as many as 10 million people who lack health insurance at a cost of $102 billion over the next decade.[7]"},"Trade[edit]":{"text":"Bush is a supporter of free trade, calling on nations to embrace free trade.[6]"},"text":"","Energy policy[edit]":{"text":"George Bush supports nuclear power and expanded domestic drilling.[citation needed] Bush pledged to work toward reduced reliance on foreign oil by reducing fossil fuel consumption and increasing alternative fuel production.[1] He lifted a ban on offshore drilling in 2008,[2] and said at the time, \"This means that the only thing standing between the American people and these vast oil reserves is action from the U.S. Congress.\"[2] Bush had said in June 2008, \"In the long run, the solution is to reduce demand for oil by promoting alternative energy technologies. My administration has worked with Congress to invest in gas-saving technologies like advanced batteries and hydrogen fuel cells... In the short run, the American economy will continue to rely largely on oil. And that means we need to increase supply, especially here at home. So my administration has repeatedly called on Congress to expand domestic oil production.\"[3]In 2008, Bush announced that the United States would commit $2 billion towards an international fund to promote clean energy technologies, saying, \"along with contributions from other countries, this fund will increase and accelerate the deployment of all forms of cleaner, more efficient technologies in developing nations like India and China, and help leverage substantial private-sector capital by making clean energy projects more financially attractive.\""},"Free-market capitalism[edit]":{"text":"Bush generally supports free-market capitalism, but claims to understand the importance of government involvements in private financial affairs if they are projected to have a negative impact on the economy as a whole. In November 2008, Bush claimed, \"Our aim should not be more government. It should be smarter government.\"[5]During the beginning of his first term, Bush enacted corporate tax cuts in the hopes that the economy would flourish as a result. Later, in 2008, Bush supported major bailout plans for mortgage lenders and auto makers who were facing bankruptcy. Bush also enacted the first major economic stimulus in the face of an economy on the down-turn, which handed free checks to all private tax-paying citizens."}},"Social policy[edit]":{"Death penalty[edit]":{"text":"Bush supports the death penalty. As governor of Texas he allowed 152 executions.[16] Bush commuted the sentence of one prisoner on death row, Henry Lee Lucas, on June 15, 1998.[17]"},"Prayer in public schools[edit]":{"text":"Bush supported \"voluntary, student-led prayer\" but not \"teacher-led prayers.\"[26]"},"Stem cell research[edit]":{"text":"Bush opposes federal funding for research relating to newly-derived embryonic stem cell lines. He supports federal funding for research on pre-existing embryonic stem cell lines.[27] [15]"},"Education: No Child Left Behind[edit]":{"text":"No Child Left Behind was proposed by President George W. Bush on January 23, 2001, just three days after his inaugural. It was coauthored by Representatives John Boehner (R-OH), George Miller (D-CA), and Senators Edward Kennedy (D-MA) and Judd Gregg (R-NH). The United States House of Representatives passed the bill on May 23, 2001 (voting 384–45),[6] and the United States Senate passed it on June 14, 2001 (voting 91–8).[7] President Bush signed it into law on January 8, 2002."},"LGBT issues[edit]":{"text":"Bush opposes same-sex marriage. During his 2004 reelection campaign, he called for an amendment to the U.S. Constitution that would ban same-sex marriage in the United States but allow for the possibility of civil unions on the state level.[24] He also stated in the famous Wead tapes that he would not \"kick gays\" and worried his refusal to do so might upset his evangelical supporters, and that \"I think it is bad for Republicans to be kicking gays.\"[25]"},"Abortion[edit]":{"text":"Bush has a strong pro-life stance, consistently opposing abortion while supporting parental notification for minor girls who want abortions, the Mexico City Policy, a ban on intact dilation and extraction (commonly known as partial-birth abortion), adoption tax credits, and the Unborn Victims of Violence Act.[15]"},"text":"","Environment[edit]":{"text":"Bush opposed the Kyoto Protocol, saying that the treaty neglected and exempted 80 percent of the world's population[18] and would have cost tens of billions of dollars per year.[19] Bush announced the Clear Skies Act of 2003,[20] aimed at amending the Clean Air Act to reduce air pollution through the use of emissions trading programs. The initiative was introduced to Congress, but failed to make it out of committee.Bush has said that global warming is real[21] and has noted that it is a serious problem, but he asserts there is a \"debate over whether it's manmade or naturally caused\".[22] He announced plans to reaffirm the United States' commitment to work with major economies, and, through the United Nations, to complete an international agreement that will slow, stop, and eventually reverse the growth of greenhouse gases; he stated, \"this agreement will be effective only if it includes commitments by every major economy and gives none a free ride.\"[23]"}},"Civil liberties[edit]":{"Anti-terrorism and domestic surveillance[edit]":{"text":"Bush is a supporter of anti-terrorist surveillance and information-gathering methods (see U.S. PATRIOT Act)."},"Gun laws[edit]":{"text":"While Bush has supported regulated gun control, he generally supports guns; in June 1999 he said he opposed requiring child-safety locks on guns; and supported concealed carrying permits.[15]"},"Habeas Corpus[edit]":{"text":"The November 13, 2001, Presidential Military Order gave the President of the United States the power to detain suspects, suspected of connection to terrorists or terrorism as an unlawful combatant. As such, it was asserted that a person could be held indefinitely without charges being filed against him or her, without a court hearing, and without entitlement to a legal consultant. Many legal and constitutional scholars contended that these provisions were in direct opposition to habeas corpus and the United States Bill of Rights.[citation needed]"},"Flag burning[edit]":{"text":"Bush supports a constitutional amendment banning flag burning.[citation needed]"},"text":""}}