{"Foreign policy[edit]":{"Nuclear weapons[edit]":{"text":"According to several scholars and Reagan biographers, including Paul Lettow, John Lewis Gaddis, Richard Reeves, Lou Cannon, and Reagan himself in his autobiography, Ronald Reagan earnestly desired the abolition of all nuclear weapons. He proposed to Gorbachev that if a missile shield could be built, all nuclear weapons be eliminated and the missile shield technology shared, the world would be much better off.Paul Lettow in particular has written that Reagan's opposition to nuclear weapons started at the dawn of the nuclear age and in December 1945, Reagan was only prevented from leading an anti-nuclear rally in Hollywood by pressure from the Warner Brothers studio.[10]In his autobiography, An American Life, Reagan wrote, \"The Pentagon said at least 150 million American lives would be lost in a nuclear war with the Soviet Union — even if we 'won.' For Americans who survived such a war, I couldn't imagine what life would be like. The planet would be so poisoned the 'survivors' would have no place to live. Even if a nuclear war did not mean the extinction of mankind, it would certainly mean the end of civilization as we knew it. No one could 'win' a nuclear war. Yet as long as nuclear weapons were in existence, there would always be risks they would be used, and once the first nuclear weapon was unleashed, who knew where it would end? My dream, then, became a world free of nuclear weapons.... For the eight years I was president I never let my dream of a nuclear-free world fade from my mind.\" Reagan wrote that he believed the mutually assured destruction policy formulated by John Kennedy to be morally wrong.Reagan and Soviet Leader Mikhail Gorbachev signed the INF Treaty in 1987 (and ratified in 1988), which was the first in Cold War history to mandate the destruction of an entire class of nuclear weapons.[11]"},"Cold War[edit]":{"text":"Ronald Reagan served as president during the later part of the Cold War, an era of political and ideological disagreement between the United States and the Soviet Union. Reagan labeled the U.S.S.R. an \"Evil Empire\" that would be consigned to the \"ash heap of history\"; he later predicted that communism would collapse.[1] He reversed the policy of détente[2] and massively built up the United States military.[3] Through it, he ordered production of the MX missile, the LGM-118A Peacekeeper, and implemented the B-1 bomber program that had been canceled by the Carter administration.[4] He also monitored the deployment of the Pershing II missile in West Germany.[5]He proposed the Strategic Defense Initiative (SDI), a defense project[6] that planned to use ground and space-based missile defense systems to protect the United States from attack.[7] Reagan believed that this defense shield could make nuclear war impossible.[6][8] Reagan was convinced that the Soviet Union could be defeated rather than simply negotiated with.[9]"},"text":"","Iran-Iraq[edit]":{"text":"Originally neutral in the Iran–Iraq War of 1979 to 1988, the Reagan administration began supporting Iraq because an Iranian victory would not serve the interests of the United States.[12] In 1983, Reagan issued a National Security Decision Directive memo, which called for heightened regional military cooperation to defend oil facilities, measures to improve U.S. military capabilities in the Persian Gulf, directed the secretaries of state and defense and the chairman of the Joint Chiefs of Staff to take appropriate measures to respond to tensions in the area.[12]"}},"Economic policy[edit]":{"Economic plans, taxes, and deficit[edit]":{"text":"Reagan believed in policies based on supply-side economics and advocated a laissez-faire philosophy,[13] seeking to stimulate the economy with large, across-the-board tax cuts.[14][15] Reagan pointed to improvements in certain key economic indicators as evidence of success.[3] The policies proposed that economic growth would occur when marginal tax rates were low enough to spur investment,[16] which would then lead to increased economic growth, higher employment and wages.Reagan did not believe in raising income taxes. During his presidential tenure, the top federal income tax rates were lowered from 70% to 28%.[17] However, it has also been acknowledged that Reagan did raise taxes on eleven occasions during his Presidency in an effort to both preserve his defense agenda and combat the growing national debt and budget deficit.[18]In order to cover the growing federal budget deficits, and the decreased revenue that resulted from the cuts, the United States borrowed heavily both domestically and abroad, raising the national debt from $1.1 trillion to $2.7 trillion.[19] Reagan described the new debt as the \"greatest disappointment\" of his presidency.[19]"},"Social Security[edit]":{"text":"Reagan was in favor of making Social Security benefits voluntary.[25] According to Reagan biographer Lou Cannon, \"I have no doubt that he shared the view that Social Security was a Ponzi scheme. He was intrigued with the idea of a voluntary plan that would have allowed workers to make their own investments. This idea would have undermined the system by depriving Social Security of the contributions of millions of the nation’s highest-paid workers.\"[25]Although Reagan was for a limited government, and against the idea of a welfare state, Reagan continued to fully fund Social Security and Medicare because the elderly were dependent on those programs."},"Healthcare[edit]":{"text":"Reagan was opposed to socialized healthcare, universal health care, or publicly funded health care. In 1961, while still a member of the Democratic party, Reagan voiced his opposition to single-payer healthcare in an 11-minute recording;[23] the idea was beginning to be advocated by the Democratic party. In it, Reagan stated:\"One of the traditional methods of imposing statism or socialism on a people has been by way of medicine. It is very easy to describe a medical program as a humanitarian project... Under the Truman administration, it was proposed that we have a compulsory health insurance program for all people in the United States, and of course, the American people unhesitatingly rejected this... In the last decade, 127 million of our citizens, in just ten years, have come under the protection of some privately-owned medical or hospital insurance. The advocates of [socialized healthcare], when you try to oppose it, challenge you on an emotional basis... What can we do about this? Well you and I can do a great deal. We can write to our Congressmen, to our Senators. We can say right now that we want no further encroachment on these individual liberties and freedoms. And at the moment, the key issue is we do not want socialized medicine... If you don't, this program I promise you will pass just as surely as the sun will come up tomorrow. And behind it will come other federal programs that will invade every area of freedom as well have known it in this country, until one day, as Norman Thomas said, we will awake to find that we have socialism. If you don't do this and if I don't do it, one of these days you and I are going to spend our sunset years telling our children, and our children's children, what it once was like in America when men were free.\"[23][24]"},"text":"","Free trade[edit]":{"text":"Reagan was a supporter of free trade.[20] When running for president in 1979, Reagan proposed a \"North American accord\", in which goods could move freely throughout Canada, the U.S. and Mexico.[21] Largely dismissed at the time, Reagan was serious in his proposal. Once in office, he signed an agreement with Canada to that effect.[20] His \"North American accord\" later became the official North American Free Trade Agreement (NAFTA), signed by President George H. W. Bush and ratified by President Bill Clinton.[21]Reagan understood free trade as including the use of tariffs to protect American jobs and industry against foreign competition. He imposed a temporary 100% tariff on Japanese electronics as well as other tariffs on a variety of industrial products, which resulted in some free-market advocates criticizing his policies as protectionist in practice.[22]"},"New Deal[edit]":{"text":"Reagan wrote that he was never trying to undo the New Deal. He admired Franklin Delano Roosevelt and voted for him four times.[citation needed]"}},"Social policy[edit]":{"Education[edit]":{"text":"Reagan was a supporter of prayer in U.S. schools.[54] On 25 February 1984, in his weekly radio address, he said: \"Sometimes I can't help but feel the first amendment is being turned on its head. Because ask yourselves: Can it really be true that the first amendment can permit Nazis and Ku Klux Klansmen to march on public property, advocate the extermination of people of the Jewish faith and the subjugation of blacks, while the same amendment forbids our children from saying a prayer in school?\"[54] However, President Reagan did not pursue a constitutional amendment requiring school prayer in public schools.[55] Reagan mischaracterized the Supreme Court decisions on school prayer, as no decision of the Court has ever held that a child is prohibited from praying on his own. The effect of the school prayer decisions is to prohibit public school authorities from requiring children to participate in prayer.Reagan was particularly opposed to the establishment of the Department of Education, which had occurred under his predecessor, Jimmy Carter. This view stemmed from his less-government intervention views.[56] He had pledged to abolish the department, but did not pursue that goal as president.[56]"},"Abortion[edit]":{"text":"Reagan was pro-life.[28] He was quoted as saying, \"If there is a question as to whether there is life or death, the doubt should be resolved in favor of life.\" In 1982, Ronald Reagan stated: \"Simple morality dictates that unless and until someone can prove the unborn human is not alive, we must give it the benefit of the doubt and assume it is (alive). And, thus, it should be entitled to life, liberty and the pursuit of happiness.\" [28]As Governor of California, Reagan signed into law the \"Therapeutic Abortion Act\", in an effort to reduce the number of \"back room abortions\" performed in California.[29] As a result, approximately one million abortions would be performed; Reagan blamed this on doctors, arguing that they had deliberately misinterpreted the law.[28] At the time that the law was signed, Reagan had been in office for four months, and stated that had he been more experienced as governor he would not have signed it.[30] He then declared himself to be pro-life.Reagan managed to gain the support of pro-life groups when running for president, despite his authorization of the \"Therapeutic Abortion Act\", by advocating a constitutional amendment that would have prohibited all abortions except when necessary to save the life of the mother.[28] He saw \"abortion on demand\" as emotionally harmful.[28]"},"Civil rights[edit]":{"text":"While running for president, Reagan pledged that if given the chance, he would appoint a woman to the Supreme Court of the United States.[34] As President, Ronald Reagan opposed the Equal Rights Amendment because he felt that women were already protected by the Fourteenth Amendment, although as Governor of California Reagan had supported the amendment and offered to help women's groups achieve its ratification.[35] Reagan pulled his support for the ERA shortly before announcing his 1976 candidacy for President; the 1976 Republican National Convention renewed the party's support for the amendment but in 1980 the party qualified its 40-year support for ERA. Despite opposing the ERA, Reagan did not actively work against the amendment, which his daughter Maureen (who advised her father on various issues including women's rights) and most prominent Republicans supported.Reagan established a \"Fifty States Project\" and councils and commissions on women designed to find existing statutes at the federal and state levels and eradicate them, the latter through a liaison with the various state governors. Elizabeth Dole, a Republican feminist and former Federal Trade Commissioner and advisor to Presidents Johnson, Nixon, and Ford (who would go on to become Reagan's Transportation Secretary) headed up his women's rights project.Reagan did not support many civil rights bills throughout the years.[36] He opposed the Civil Rights Act of 1964[37] and the Voting Rights Act of 1965 signed into law by President Lyndon B. Johnson.[36] In 1982 he signed a bill extending the Voting Rights Act for 25 years after a grass-roots lobbying and legislative campaign forced him to abandon his plan to ease that law's restrictions.[38] In 1988 he vetoed the Civil Rights Restoration Act, but his veto was overridden by Congress. Reagan had argued that the legislation infringed on states' rights and the rights of churches and business owners.[39]Reagan did not consider himself a racist, and dismissed any attacks aimed at him relating to racism as attacks on his personal character and integrity.[36]There are critics who claim that Reagan gave his 1980 presidential campaign speech, about states' rights,[40] in Philadelphia, Mississippi. This also happens to be the place where three civil rights workers were killed in 1964.[41] However, despite the critics' claims, Reagan had actually given it at the Neshoba County Fair, in the unincorporated community of Neshoba, Mississippi, seven miles away. It was a popular campaigning spot, as presidential candidates John Glenn and Michael Dukakis both campaigned there as well.[42][43]He also said (while campaigning in Georgia) that Confederate President Jefferson Davis was \"a hero of mine.\"[44] However, Reagan was offended that some accused him of racism.[44] In 1980, Reagan said the Voting Rights Act was \"humiliating to the South\",[45] although he later supported extending the Act.[46] He opposed Fair Housing legislation in California (the Rumford Fair Housing Act),[47] but in 1988 signed a law expanding the Fair Housing Act of 1968.[48] Reagan was unsuccessful in trying to veto another civil rights bill in March of the same year.[49] Reagan engaged a policy of Constructive engagement with South Africa in spite of apartheid due to the nation being a valuable anti-communist ally, opposing pressure from Congress and his own party for tougher sanctions until his veto was overridden.[50] Reagan opposed the Martin Luther King holiday at first, and signed it only after an overwhelming veto-proof majority (338 to 90 in the House of Representatives and 78 to 22 in the Senate) voted in favor of it.[51] Congress overrode Reagan's veto of the Civil Rights Restoration Act of 1988.[49][52] Reagan said the Restoration Act would impose too many regulations on churches, the private sector, and state and local governments.[53]"},"text":"","Drugs[edit]":{"text":"Reagan was serious when it came to his opposition to illegal drugs.[32] He and his wife sought to reduce the use of illegal drugs through the Just Say No Drug Awareness campaign, an organization Nancy Reagan founded as first lady.[32] In a 1986 address to the nation by Ronald and Nancy Reagan, the president said, \"[W]hile drug and alcohol abuse cuts across all generations, it's especially damaging to the young people on whom our future depends... Drugs are menacing our society. They're threatening our values and undercutting our institutions. They're killing our children.\"[33]But Reagan also reacted to illegal drugs outside of Just Say No; the FBI added five hundred drug enforcement agents, began record drug crackdowns nationwide, and established thirteen regional anti-drug task forces under Reagan.[32] In the address with the first lady, President Reagan reported on the progress of his administration, saying,\"Thirty-seven Federal agencies are working together in a vigorous national effort, and by next year our spending for drug law enforcement will have more than tripled from its 1981 levels. We have increased seizures of illegal drugs. Shortages of marijuana are now being reported. Last year alone over 10,000 drug criminals were convicted and nearly $250 million of their assets were seized by the DEA, the Drug Enforcement Administration. And in the most important area, individual use, we see progress. In 4 years the number of high school seniors using marijuana on a daily basis has dropped from 1 in 14 to 1 in 20. The U.S. military has cut the use of illegal drugs among its personnel by 67 percent since 1980. These are a measure of our commitment and emerging signs that we can defeat this enemy.\"[33]"},"Energy and oil[edit]":{"text":"As president, Reagan removed controls on oil prices, resulting in lower prices and an oil glut.[57] He did not reduce U.S. dependency on oil by imposing an oil-importing fee because of his opposition to taxation.[57] He trusted the free marketplace.[57] Lower global oil prices had the effect of reducing the income that the Soviet Union could earn from its oil exports."},"Environment[edit]":{"text":"Reagan dismissed acid rain and proposals to halt it as burdensome to industry.[26] In the early 1980s, pollution had become an issue in Canada; Prime Minister Pierre Trudeau objected to the pollution originating in U.S. factory smokestacks in the midwest.[27] The Environmental Protection Agency implored Reagan to make a major budget commitment to reduce acid rain; Reagan rejected the proposal and deemed it as wasteful government spending.[27] He questioned scientific evidence on the causes of acid rain.[27]"},"Crime and capital punishment[edit]":{"text":"Reagan was a supporter of capital punishment. As California's Governor, Reagan was beseeched to grant executive clemency to Aaron Mitchell, who had been sentenced to death for the murder of a Sacramento police officer, but he refused.[31] Mitchell was executed the following morning.[31] It was the only execution during his eight years as governor; he had previously granted executive clemency to one man on death row who had a history of brain damage.[31]He approved the construction of three new prisons as president in 1982, as recommended by Attorney General William French Smith.[31]"}}}