{"Education[edit]":{"text":"Barr advocates the abolition of the Department of Education as well as elimination of federal grants and regulation; he also supports the repeal of the No Child Left Behind act. He believes the education should return to the local level. He supports state-level tax credits to parents who educate their children via private education or homeschooling. He believes the quality of education will benefit more from a competitive market-based system than from a government-controlled system.\"[16]"},"Environmental policy[edit]":{"text":"Barr believes the free market needs to be the foundation of the United States' energy policy. Supports drilling in the Arctic National Wildlife Refuge.[18]"},"Foreign policy[edit]":{"Trade[edit]":{"text":"Barr supports free trade, and believes that the United States should promote and encourage \"private involvement around the world\". He contends that \"the most effective way to preserve peace is through an expanding free market, backed by a full range of cultural and other private relationships\".[5]"},"Foreign aid[edit]":{"text":"Barr asserts that foreign aid has \"proved to be a drain on the U.S. economy while doing little good for the recipients\", and that \"aid is routinely used by corrupt foreign governments to oppress their people and enrich powerful elites. Foreign aid almost always discourages economic and political reform, while subsidizing nations which often work against U.S. interests.\"[7]"},"text":"","United Nations[edit]":{"text":"Barr calls the United Nations \"an enormous disappointment\" and asserts that the \"U.S. should push to roll back the UN’s functions and slash America’s financial contribution\".[8]"},"War in Iraq[edit]":{"text":"Barr considers the invasion and occupation of Iraq to have been mistakes. He asserts that American presence \"emboldens both insurgents and terrorists\", and has cost \"hundreds of billions of U.S. taxpayer dollars.\" He supports \"withdrawal without undue delay.\"[6]"},"Iran[edit]":{"text":"He has stated that \"an attack on Iran would be unnecessary, counterproductive, costly and dangerous\", that \"[t]here is no imminent threat, and only an imminent threat can ever justify a preemptive strike\", and concludes \"any nonproliferation strategy must begin with diplomacy and include a willingness to address the other side\"."}},"Economic policy[edit]":{"Social Security[edit]":{"text":"Barr favors a transformation of the current Social Security system into one of \"individualized system of private accounts.\"[3] He maintains that Social Security is not sustainable in its current form.[4]"},"Taxation[edit]":{"text":"Barr advocates repealing the Sixteenth Amendment, which would effectively abolish the income tax and the Internal Revenue Service. He would replace the current tax system with a form of consumption tax, and mentions the Fair Tax as a possible alternative after the income tax is repealed first. \"Meaningful tax reform begins with reining in government spending.\"[1]"},"text":"","Monetary policy[edit]":{"text":"He would increase transparency and oversight in the operations of the Federal Reserve, while \"reconsidering the Fed’s almost total control over the money supply.\"[2]"}},"Borders and immigration[edit]":{"text":"Barr supports better border security to crack down on illegal immigration while also supporting reforms that will \"sharply increase\" legal immigration. Supports ending birthright citizenship and ending government benefits and services for illegal immigrants.[17]"},"Health policy[edit]":{"text":"Barr favors cutting costs by reducing controls and regulations. He maintains that Medicare and Medicaid are financially unstable, and \"need to be transformed to emphasize patient choice, focus on the truly needy, and add cost-saving incentives.\"[19]"},"Civil liberties[edit]":{"Privacy[edit]":{"text":"As a congressman, Barr voted for the Patriot Act, but only after his amendments adding \"sunset clauses\" were added to the final bill.[12] He has since publicly renounced his vote on that issue, and now staunchly opposes the Patriot Act.[13][14] Stating his present position on the subject at the 2008 Libertarian National Convention, Barr said of the Patriot Act: \"I'd drive a stake through its heart, shoot it, burn it, cut off its head, burn it again, and scatter its ashes to the four corners of the world.\"[15]"},"Marriage[edit]":{"text":"Barr opposes any federal definition of marriage, whether by statute or constitutional amendment. He believes the states should be free to determine what constitutes marriage.[10] Barr does support same-sex marriage though.[11]"},"text":"","Gun ownership rights[edit]":{"text":"Barr supports the right to bear arms as an individual right. \"I oppose any law requiring registration of, or restricting the ownership, manufacture, or transfer or sale of firearms or ammunition to law-abiding citizens.\"[9]"}}}