{"Foreign policy[edit]":{"Overview[edit]":{"text":"His first major speech on foreign policy was delivered on April 23, 2007, to the Chicago Council on Global Affairs. He identified the problems that he believes the current foreign policy has caused, and the five ways the United States can lead again, focused on \"common security\", \"common humanity\", and remaining \"a beacon of freedom and justice for the world\":[12]During the speech, Obama called for an expansion of the United States Armed Forces \"by adding 65,000 soldiers to the Army and 27,000 Marines\", an idea previously introduced by Secretary of Defense Robert Gates.In a Washington, DC, speech entitled \"A New Strategy for a New World\"[13] delivered July 15, 2008, Obama stated five main foreign policy goals:"},"text":"Obama's overall foreign policy philosophy has been postulated as \"The Obama Doctrine\" by Washington Post columnist E. J. Dionne, which Dionne explains as \"a form of realism unafraid to deploy American power but mindful that its use must be tempered by practical limits and a dose of self-awareness.\"[10] A New York Times op-ed article by David Brooks identified Obama as having enormous respect for and being deeply influenced by the philosophy of Reinhold Niebuhr.[11]"},"Economic policy[edit]":{"text":"Barack Obama's current economic advisors are Alan B. Krueger and Jeffrey Liebman.[2][3]In 2006, Obama wrote: \"We should be asking ourselves what mix of policies will lead to a dynamic free market and widespread economic security, entrepreneurial innovation and upward mobility [...] we should be guided by what works.\"[4]Speaking before the National Press Club in April 2005, he defended the New Deal social welfare policies of Franklin D. Roosevelt, associating Republican proposals to establish private accounts for Social Security with social Darwinism.[5]In response to the recession, Obama signed into law the American Recovery and Reinvestment Act of 2009 shortly after taking office. The law featured large amounts of infrastructure spending, funding for states, tax cuts, and other stimulative measures. After the 2010 midterm elections, he signed into law the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010 which extended the Bush tax cuts for all incomes, temporarily cut the payroll tax, and reduced a number of other taxes."},"Federal emergency management / Disaster relief[edit]":{"text":"Obama has proposed cuts of $1 billion, or 3%, to the Federal Emergency Management Agency (FEMA) for 2013. More money would be given to state and local programs under Obama's proposal.[8]"},"Social policy[edit]":{"text":"The Almanac of American Politics (2008) rated Obama's overall social policies in 2006 as more conservative than 21 percent of the Senate, and more liberal than 77 percent of the Senate (18 percent and 77 percent, respectively, in 2005).[15]In 2010, Obama signed into law the Don't Ask, Don't Tell Repeal Act of 2010 which ended a policy of not allowing gays to state their sexual orientation openly in the military. In May 2012, he became the first sitting U.S. president to announce his support for the legalization of same-sex marriage.[16]During his second inaugural address on January 21, 2013, Obama called for full equality for gays: “Our journey is not complete until our gay brothers and sisters are treated like anyone else under the law — for if we are truly created equal, then surely the love we commit to one another must be equal as well.” This was a historic moment, being the first time that a president mentioned gay rights or the word gay in an inaugural address.[17][18]"},"Law enforcement and security policy[edit]":{"text":"United States electronic surveillance has reached an all-time high under Obama, with increased monitoring of emails, text messages and phone conversations.[14]"},"Energy policy[edit]":{"text":"President Obama's energy policy can be understood by looking at the different investments in clean energy that were evident in the American Recovery and Reinvestment Act of 2009.[specify]On March 31, 2010 at Andrews Air Force base, President Obama announced a “Comprehensive Plan for Energy Security”, stating that \"moving towards clean energy is about our security. It’s also about our economy. And it’s about the future of our planet.\"[6] The President's plan includes raising fuel efficiency standards. He also announced a decision to double the number of hybrid vehicles in the federal government's fleet and a decision to expand domestic offshore oil and gas exploration in Alaska, the eastern Gulf of Mexico, and off the east coast of the United States.[7]"}}