{"Foreign policy[edit]":{"European debt crisis[edit]":{"text":"In November 2011, when Italy was at the forefront of the European debt crisis, Romney said that Congress and the Federal Reserve should not consider plans to bail out Italy in the event its debt crisis deteriorate.[183]In December 2011, Romney stated: \"I kind of like America. I'm not looking for it to be fundamentally transformed into something else. I don't want it to become like Europe.\"[184] In January 2012, Romney said: \"We want to ensure that we remain a free and prosperous land of opportunity. This president takes his inspiration from the capitals of Europe; we look to the cities and small towns of America.\"[185] Romney accused President Obama of wanting to \"turn America into a European-style entitlement society.\"[186]"},"France[edit]":{"text":"An internal Romney campaign document released in 2007 by the media suggested that Romney criticize France and attempt to convey the message \"Hillary = France.\"[187] Governor Romney has said he \"loves\" France, where he served as a missionary for the Church of Jesus Christ of Latter-day Saints for two years. When a New Hampshire voter asked Romney why he kept \"bashing\" France on the campaign trail, Romney announced, \"My kids are on vacation there right now. I love France. I speak French, lived in France. I have nothing but respect for the French people.\"[188] Romney has said that the next president must re-engage France, and called French president Nicolas Sarkozy a potential \"blood brother.\"[189]In his February 7, 2008 appearance at the Conservative Political Action Committee, during which he withdrew from the Presidential race, Romney mentioned France in less flattering terms. \"[U]nless America changes course,\" he said, \"we will become the France of the 21st century — still a great nation, but no longer the leader of the world, no longer the superpower.\"[190]"},"China[edit]":{"text":"Romney has accused China of \"cheating\" and \"stealing American jobs\".[170][171] He warned China that if he is elected to the White House, there will be consequences for unfair trade, saying: \"Unless China changes its ways, on day one of my presidency I will designate it a currency manipulator and take appropriate counteraction.\" and \"A trade war with China is the last thing I want, but I cannot tolerate our current trade surrender.\"[172]At the press conference, Romney was asked whether the China's abuses of human rights troubled him. \"I am not an expert on the practices of other countries, and don't consider myself sufficiently qualified to characterize the practices of any one country,\" Romney said.[173] In July 2012, Romney said, \"We face another challenge in a rising China. China is attentive to the interests of its government, but it too often disregards the rights of its people. It's selective in the freedoms it allows.\"[174]"},"Syria[edit]":{"text":"Romney released the following statement concerning Bashar al-Assad, the President of Syria, in August 2011:It has taken President Obama far too long to speak out forcefully against Assad and his vicious crackdown in Syria. In the early stages of this crisis, the Obama Administration referred to Assad as a \"reformer,\" which had the effect of emboldening Assad and discouraging the dissidents. America must show leadership on the world stage and work to move these developing nations toward modernity. This means using the bullhorn of the presidency and not remaining silent for too long while voices of freedom and dissent are under attack.[229]Romney would overturn the existing policy against sending arms to moderate elements of the Syrian opposition, rejecting the idea that they would pass the weapons on to Al-Queda.[230]"},"Libya[edit]":{"text":"Concerning the involvement of the American military in the 2011 Libyan civil war, Romney initially said in March that Obama had waited too long before becoming involved, and he also criticized Obama for ruling out the use of United States ground forces.[216] The next month, he said that he supported the \"specific, limited mission\" of enforcing a no-fly zone, but that Obama's support for the ouster of Libyan leader Muammar Gaddafi constituted \"mission creep and mission muddle.\"[216] In October, after Gaddafi's death, Romney said, \"I think people across the world recognize that the world is a better place without Muammar Gaddafi.\"[216]"},"Role of culture in producing prosperity[edit]":{"text":"In Romney's 2010 book No Apology, Romney concludes that culture and values play an important role in determining the prosperity and success of countries.[252] He made similar statements during a visit to Israel in 2012, in which he compared the higher Israeli GDP to the Palestinian GDP, as well as Chile's GDP to Ecuador's GDP and Mexico's GDP to America's GDP, raising the ire of the Palestinian Authority who accused Romney of racism and of being out of touch,[253] but he denied that he was criticizing Palestinian culture and instead was merely pointing out that \"choices a society makes have a profound impact on the economy and the vitality of a society.\"[254] Romney also mentioned in his speech a book written by former Harvard professor David Landes named The Wealth and Poverty of Nations, in which Landes concludes, \"If you could learn anything from the economic history of the world it’s this: culture makes all the difference.\"[255]"},"Russia[edit]":{"text":"During the 2012 presidential campaign, Romney said that Russia is \"without question, our number one geopolitical foe. They - they fight every cause for the world's worst actors.\"[220][221] He called President Vladimir Putin \"a real threat to the stability and peace of the world.\"[222] Romney wants to \"deter Russian ambitions\" to its south by enhancing diplomatic ties, increasing military training and assistance, and negotiating trade pacts and educational exchanges with Central Asian states.\"[223]Romney has opposed ratification of New START, a bilateral nuclear arms reduction treaty between the United States and the Russian Federation,[224][225] in part because he wishes to deploy defensive missiles on submarines.[226][227] He has written that the idea of the abolition of nuclear weapons put forward by Ronald Reagan may not be realistic.[228]"},"War on Terror[edit]":{"text":"During the debate in South Carolina held May 15, 2007 Romney stated that in his view \"We ought to double\" the Guantanamo Bay detention camp. He then went on to say, in reference to combatants captured in Iraq, \"I want them in Guantanamo where they don't get the access to lawyers they get when they're on our soil. I don't want them in our prisons. I want them there.\"[243]In Romney's speech at the 2007 Iowa Republican Straw Poll, he praised the U.S. military for not allowing prisoners to have judicial review of their cases.[244]Romney opposes the use of torture;[245] and supports the limited use of enhanced interrogation techniques to stop an imminent wide-scale terrorist attack.[246] During the second Presidential debate, Romney supported the use of enhanced interrogation techniques in handling suspects at the Guantanamo Bay detention facility, saying, \". . . enhanced interrogation techniques have to be used -- not torture but enhanced interrogation techniques, yes.\"[247] When asked directly whether waterboarding was torture, Romney stated, \"[A]s a presidential candidate, I don't think it's wise for us to describe specifically which measures we would and would not use. [...] And I get that advice from Cofer Black, who is a person who was responsible for counterterrorism in the CIA for some 35 years. I get that advice by talking to former generals in our military.\"[248] According to Blackwater expert Jeremy Scahill, Romney advisor Cofer Black has been, \"a key figure in the extraordinary rendition program, the government-sanctioned kidnap-and-torture program, where prisoners like Maher Arar are sent to third-country hellholes to be tortured.\"[249]"},"Iraq[edit]":{"text":"Romney supported the invasion of Iraq[200] and the \"troop surge\". He criticized mismanagement of Iraq post-invasion, stating that both diplomatic and military efforts should be used to achieve success in the region.[108][201]In his 2007 speech announcing that he would run for president in 2008, Romney said, \"so long as there is a reasonable prospect of success, our wisest course is to seek stability in Iraq, with additional troops endeavoring to secure the civilian population.\" He stated that instability in Iraq could lead to civil war and that \"Iraq's Sunni region could become a base for al-Qaeda; that its Shia region could be seized by Iran; that Kurd tension could destabilize Turkey\" and that the broader Middle East and the United States could be drawn into conflict.[202]In a 2007 Republican presidential debate, Romney mistakenly said that the Iraq war could have been avoided if Saddam Hussein had allowed IAEA inspectors into the country. CNN contributor Paul Begala criticized this remark and called it \"[a] huge mistake, a gaffe that -- that's, if this were a general election debate, would be a disqualifier,\" pointing out that inspectors had been allowed into Iraq.[203]In October 2011, Romney criticized the Obama administration's announcement that all American combat troops had been withdrawn from Iraq calling the withdrawal either “naked political calculation or simply sheer ineptitude.”[204]"},"Venezuela[edit]":{"text":"Romney has said that President Obama is \"simply naive\" to dismiss the threat Venezuela poses to the United States.[237] As governor of Massachusetts, however, he praised a fuel pact with Venezuela that brought reduced-price oil to his state.[238]"},"War in Afghanistan[edit]":{"text":"Romney supported the War in Afghanistan. In 2011 he stated regarding Afghanistan:I want those troops to come home based upon not politics, not based upon economics, but instead based upon the conditions on the ground determined by the generals … But I also think we have learned that our troops should not go off and try to fight a war of independence for another nation. Only the Afghanis can win Afghanistan’s independence from the Taliban.[239]In 2012, when Secretary of Defense Leon Panetta outlined a plan to withdraw U.S. combat troops by 2013 if possible, Romney criticized the announcement, saying, \"Why in the world do you go to the people that you’re fighting with and tell them the date you’re pulling out your troops?\"[204][240] Romney's 2012 presidential election campaign website similarly criticized the Obama Administration for announcing a timetable for withdrawal of U.S. troops from Afghanistan, and reiterated his position that in a Romney presidency, decisions about when to withdraw troops would be made based on the advice of commanders in the field, not electoral politics.[241]In July 2012, Romney said that he would maintain troop numbers through 2013, then would withdraw them in 2014, as currently scheduled, with the possibility of maintaining troop levels for a longer period if needed.[242]"},"War Powers[edit]":{"text":"In the 2008 presidential debates, Romney left open whether it was always necessary for the U.S. Congress to issue a declaration of war before engaging in military actions. Romney stated that if he were president he would consult with his lawyers before he came to a conclusive interpretation of the War Powers Clause in the US Constitution.[250] In June 2012 during a Face the Nation interview Romney stated regarding military action against Iran: \"I don’t believe at this stage, therefore, if I’m president that we need to have a war powers approval or special authorization for military force.\"[251]"},"text":"","European allies[edit]":{"text":"Romney said we have \"42 allies and friends\" around the world,[178] including 25 NATO allies in Europe.[179]Romney would restore 'Anglo-Saxon' relations between the United Kingdom and the United States, and return Winston Churchill's bust which was removed from the White House when President Obama moved in.[180]In his speech, Romney said of Poland, \"On behalf of our countrymen, I express deep appreciation for your willingness to fight with us, to stand with us, and to be our friends in times of crisis and military conflict.\" He added: \"In a turbulent world, Poland stands as an example and defender of freedom.\"[181]Romney accused President Obama of abandoning Poland and the Czech Republic.[182]"},"U.S. place in the world[edit]":{"text":"Romney's 2010 book, No Apology: The Case for American Greatness, expresses Romney's belief in American exceptionalism.[231] Romney doesn't want the United States to \"become like Europe.\"[184]On the other hand, The Economist found that, aside from rhetoric, Romney's stated foreign policy positions offer in many instances broad continuity with those of the Obama administration,[232] and that Obama's policies have closely followed the path set by the Bush administration.[233]Romney believes China should provide direct humanitarian aid instead of indirect aid through the United States via loans.[234]Romney criticized at the time Democratic presidential candidate Barack Obama for saying that in his first year as president, he would meet with the leaders of several nations hostile to the government of the United States, including Syria, North Korea, Cuba, and Iran. Stating an opposing viewpoint Romney said, \"Having the president meet with the authoritarian tyrants of the world is remarkably poor judgment.\"[235] Romney has recently charged that President Obama \"went around the Middle East and apologized for America.\"[236]"},"Pakistan[edit]":{"text":"On July 7, 2007, Romney said, \"In places like Pakistan, America needs to work not just on a military front.\" He said he would send in his proposed \"Special Partnership Force\", a team of Central Intelligence Agency agents and Army special forces that would work with the local population to aid in military support, gun supplies, and \"to help make sure that they have the rule of law, water projects, bridges built.\"[217]In 2007, Romney criticized then-candidate Barack Obama for stating that, as President, he would launch military strikes against \"high-value terrorist targets\" in Pakistan, even without the Pakistani government's approval.[218] In 2011, after such a strike resulted in the death of Osama bin Laden, Romney said that, if he had been President, he would have done \"exactly the same thing.\"[219]"},"Israel and the Arab-Israeli conflict[edit]":{"text":"In October 2011, during his 2012 presidential campaign, Romney said, \"I believe our relationship with Israel, a nation which shares our values and is our best friend in the Middle East, should be of support and confidence rather than criticism and blame.\"[205] In December 2011, he said, “I will travel to Israel on my first foreign trip [as president]. I will reaffirm as a vital national interest Israel’s existence as a Jewish state. I want the world to know that the bonds between Israel and the United States are unshakable.\"[194]On the question of whether the U.S. Embassy in Israel in Tel Aviv should be moved to Jerusalem, Romney said in October 2011, \"The actions that I will take will be actions recommended and supported by Israeli leaders. I don’t seek to take actions independent of what our allies think is best, and if Israel’s leaders thought that a move of that nature would be helpful to their efforts, then that’s something I’ll be inclined to do.... I don’t think America should play the role of the leader of the peace process, instead we should stand by our ally.\"[205] During a trip to Israel in July 2012, he reiterated that if elected president he would seek to move the U.S. embassy from Tel Aviv to Jerusalem, which he called the capital of Israel (and which he has said the U.S. should formally recognize as the capital of Israel,[206] although Palestinians and other Arabs also claim Jerusalem as the capital of a Palestinian state[207]), if the government of Israel desired such a move.[208][209][210]Regarding the Arab–Israeli conflict, in a January 2012 Republican debate, Romney said, \"Well, the reason that there’s not peace between the Palestinians and Israel is because there is — in the leadership of the Palestinian people are Hamas and others who think like Hamas, who have as their intent the elimination of Israel. And whether it’s in school books that teach how to kill Jews, or whether it’s in the political discourse that is spoken either from Fatah or from Hamas, there is a belief that the Jewish people do not have a right to have a Jewish state.\" Romney added, \"There are some people who say should we have a two state solution, and the Israelis would be happy to have a two state solution. It's the Palestinians who don't want a two state solution, they want to eliminate the state of Israel. And I believe America must say the best way to have peace in the Middle East is not for us to vacillate and appease, but it is to say we stand with our friend Israel. We are committed to a Jewish state in Israel. We will not have an inch of difference between ourselves and our ally Israel.\"[211] Despite his pessimism about a two-state solution being achieved in the short term, Romney has defended the two-state solution to the Arab-Israeli conflict as an ideal that ought to be included in the Republican Party platform.[212]In candid remarks to high-value donors at a secretly recorded May 2012 private fundraiser, Romney said of the Israeli-Palestinian conflict, \"I look at the Palestinians not wanting to see peace anyway, for political purposes, committed to the destruction and elimination of Israel, and these thorny issues, and I say, 'There's just no way.' And so what you do is you say, 'You move things along the best way you can.' You hope for some degree of stability, but you recognize that this is going to remain an unsolved problem. We live with that in China and Taiwan. All right, we have a potentially volatile situation but we sort of live with it, and we kick the ball down the field and hope that ultimately, somehow, something will happen and resolve it.\" He also noted that he had recently received a call from a former U.S. Secretary of State who had suggested that there might be a prospect for accord after the Palestinian elections. Romney made clear in his remarks at the fundraiser that he was opposed to the U.S. exerting any pressure on Israel to help reach a compromise: \"The idea of pushing on the Israelis to give something up to get the Palestinians to act is the worst idea in the world.\"[213]In response to President Obama's pledge to maintain Israel's \"Qualitative Military Edge\" over the other countries in the region, Romney has said he would do \"the opposite from Obama\".[214][215]Romney supported an international campaign to hold one minute of silence at the 2012 London Olympics to remember the Israeli athletes killed in the 1972 Munich Massacre at the Olympics by the Palestinian terrorist organization Black September."},"Cuba[edit]":{"text":"Romney favors keeping the United States embargo against Cuba in place.[175] He said: \"The Cuban people still live in constant fear of a brutal totalitarian regime that has demonstrated time and again its utter disregard for basic human dignity.\"[176]Romney accused President Obama of a policy of “appeasement” toward Cuba. \"This president has decided to give a gift, to Castro, to allow remittances to come from the United States to go into Cuba and help the economy of Cuba. He’s allowed more traveling into Cuba\", Romney said.[177]"},"Iran[edit]":{"text":"In a June 2007 Republican debate, Romney was asked about \"the use of tactical nuclear weapons\" to stop Iran from developing a nuclear bomb and responded that \"You don't take options off the table, but what you do is stand back and say, 'What's going on here?' You see what's happening in Sudan and Afghanistan, in Iraq and Iran.\"[191] In 2007 he also stated he would use \"blockade, bombardment and surgical military strikes\" against Iran if necessary.[192] In September of that year he protested Iran's president Mahmoud Ahmadinejad speaking at the 62nd session of the United Nations General Assembly, stating that the invitation should be revoked and he should instead be greeted with an indictment under the Genocide Convention for threats against Israel. He stated that failure to act should lead the United States to reconsider its level of support and funding for the United Nations.[193]In 2011, Romney advocated both overt and covert means to get Iran to stop its nuclear weapons development program. He said that “Ultimately, regime change is what’s going to be necessary.”[194] In 2012 he called on President Obama “to impose crippling economic sanctions on the Iranian regime, support the Iranian dissidents, and convey through actions – not just words – that the military option is very real and very credible.”[192]In June 2012, Romney said \"I can assure you, if I'm President, the Iranians will have no question but that I would be willing to take military action if necessary to prevent them from becoming a nuclear threat to the world.\"[195] In his July 2012 trip to Israel he said that preventing Iran from obtaining a nuclear \"capability\" should be America's \"highest national security priority.\"[196][197] Romney has said of using military force against Iran, \"I don't believe at this stage, therefore, if I'm President, that we need to have war powers approval or a special authorization for military force.\"[198] He has refused to state if he would be open to using direct diplomacy to settle the issue with the Iranians.[199]"}},"Economic policy[edit]":{"Budget[edit]":{"text":"In March 2012, Romney endorsed the House Budget Committee proposed budget for the fiscal year 2013, a newer version of Paul Ryan's The Path to Prosperity.[22][23]"},"Jobs plan[edit]":{"text":"Romney argued during the 2012 presidential election campaign that his proposals to reduce government regulation of business activity and to revise the federal tax code and federal trade and energy policies would foster an environment that would lead businesses to create 12 million jobs within his first four years in office.[129][130]Glenn Kessler of The Washington Post fact-checked the claim and identified numerous problems with it, citing Moody's Analytics and the sources provided by Romney's own campaign staffers.[131]"},"Financial industry regulation and Occupy Wall Street[edit]":{"text":"Romney says a major contributor to America’s faltering economy has been what he views as excessive regulation.[91] He has promised to repeal the Dodd–Frank Wall Street Reform and Consumer Protection Act. The Act implemented Wall Street reform with goals that included \"improving accountability and transparency in the financial system\" and protecting consumers. Romney criticized the Act as being \"overwhelming\" in length, but he said that one provision, distinguishing between home mortgages and high-risk securities in terms of the capital requirements, \"does make sense\",[92] and the Sarbanes-Oxley Act, which was enacted to prevent accounting scandals such had occurred with the Enron corporation, with plans to eventually replace them with more streamlined regulations.[93][94][95] He also proposes instituting measures that would make it more difficult for federal agencies to impose new regulations.[91][96]Regarding the Occupy Wall Street protests, Mitt Romney has stated he favors growing the middle class but said blaming Wall Street bankers is the wrong way to go.[97]"},"Technology[edit]":{"text":"Romney has said the government should invest more in technologies that will help the United States, such as power generation, fuel cells, nanotechnology, and materials science. During his 2012 presidential campaign, his website included a statement he had made while commenting on the importance of investing in technology research and development during a 2006 interview:\"In technology, we as a country already invest an enormous amount--for instance, in defense technology, space technology, health--but we also need to invest in some of the emerging technologies that are important at a basic science level such as fuel cell technology, power generation, materials science, automotive technology. We have to recognize that where we invest as a nation, both from a government standpoint but also from a private standpoint, those are the areas we've been most successful.\"[165]In his 2010 book, No Apology: The Case for American Greatness, Romney wrote that one of government's useful roles is in fostering innovation.[166]"},"Stimulus[edit]":{"text":"As governor of Massachusetts, Romney favored the use of economic stimulus measures, using both federal funding and state funding to help lift the state's sluggish economy. Just months into his tenure as governor, in April 2003, while he shied away from any public endorsement of the tax cuts proposed by the Bush Administration, he argued for federal funds to stimulate the local economy: \"I very much support an economic stimulus.... An economic stimulus is a good thing for Massachusetts.\"[144] That same year, he proposed his own economic stimulus package of tax credits and grants to promote the state's high technology industry, ultimately totaling $100 million when agreed to by the legislature.[145] Two years later, in February 2005, he proposed a much larger stimulus package, totaling $600 million, that he said would create 20,000 jobs over 5 years. The most controversial provision would have devoted $37 million to stimulate job creation by paying businesses $30,000 for each new employee hired.[145]In early January 2009, Romney supported the $750 billion federal economic stimulus package proposed by the incoming president, Barack Obama, who had not yet taken office. Romney said at the time:\"I frankly wish that the last Congress would have dealt with the stimulus issue and that the president [outgoing President George W. Bush] could assign that before leaving office. I think there is need for economic stimulus. Americans have lost about $11 trillion in net worth. That translates into about $400 billion a year less spending that they'll be doing, and that's net of additional government programs like Medicaid and unemployment insurance. And government can help make that up in a very difficult time.... I'd move quickly. These are unusual times. But it has to be something which relieves pressure on middle-income families. I think a tax cut is necessary for them as well as for businesses that are growing. We'll be investing in infrastructure and in energy technologies.\"[146]However, as a candidate for president in May 2012, Romney said that the economic stimulus package that had been enacted in February 2009 (the American Recovery and Reinvestment Act of 2009) had been a waste of money that did little to jump-start the economy, and that the federal government had inflated the numbers of jobs that had been created or preserved by the various projects funded through the stimulus program.[147]Soon after the Republican victory in the 2012 Wisconsin gubernatorial recall election, Romney criticized Obama's stimulus policy, saying that Obama \"wants another stimulus, he wants to hire more government workers. He says we need more fireman, more policeman, more teachers. Did he not get the message of Wisconsin? The American people did. It's time for us to cut back on government and help the American people.\"[148]"},"Trade[edit]":{"text":"Romney supports free trade, including agreements such as NAFTA and CAFTA, and has said that his business experience has given him an edge on trade policy.[167] He also has said that nations adopting protectionist tariffs and policies eventually crumble.[167] During the 2012 presidential campaign, he said that, if elected, he would seek \"fast track\" Trade Promotion Authority to more rapidly negotiate trade agreements, finalize the Trans-Pacific Partnership, and work to create a \"Reagan Economic Zone\" that would codify the principles of free trade at the international level and provide a way to punish countries that violate free trade policies.[167]Romney has favored getting tougher with China on trade issues and has pushed to renegotiate trade deals with China to help eliminate the Trade Deficit. He opposes currency manipulation and intellectual property theft by China and has said that he would be willing to impose tariffs when necessary.[108] Romney opposed what he viewed as protectionist sanctions on Chinese tires.[168][169]"},"Federal emergency management / Disaster relief[edit]":{"text":"As governor of Massachusetts, Romney requested federal disaster assistance to help with cleaning up after storms.[87]During the 2012 presidential primary campaign, when asked what the federal government’s role should be in responding to natural disasters, Romney suggested that responsibility for handling disasters should be taken from FEMA, the federal agency dedicated to disaster relief, and given to the states, or outsourced to the private sector: \"Every time you have an occasion to take something from the federal government and send it back to the states, that's the right direction. And if you can go even further, and send it back to the private sector, that's even better. Instead of thinking in the federal budget, what we should cut -- we should ask ourselves the opposite question. What should we keep? We should take all of what we're doing at the federal level and say, what are the things we're doing that we don't have to do? And those things we've got to stop doing, because we're borrowing $1.6 trillion more this year than we're taking in.\"[88][89] Asked whether by that he specifically meant disaster relief, he replied, “we cannot afford to do those things without jeopardizing the future for our kids. It is simply immoral, in my view, for us to continue to rack up larger and larger debts and pass them on to our kids, knowing full well that we'll all be dead and gone before it's paid off. It makes no sense at all.”[89]The Romney campaign told reporters in October 2012, as the nation's East coast braced for Hurricane Sandy, that \"Gov. Romney believes that states should be in charge of emergency management in responding to storms and other natural disasters in their jurisdictions.... As the first responders, states are in the best position to aid affected individuals and communities and to direct resources and assistance to where they are needed most. This includes help from the federal government and FEMA.\"[87] The Romney campaign released a statement following the storm stating, \"I believe that FEMA plays a key role in working with states and localities to prepare for and respond to natural disasters. As president, I will ensure FEMA has the funding it needs to fulfill its mission, while directing maximum resources to the first responders who work tirelessly to help those in need, because states and localities are in the best position to get aid to the individuals and communities affected by natural disasters.\"[90]"},"Taxation[edit]":{"text":"As the new Governor of Massachusetts in 2003, Romney declined to publicly support the federal tax cuts proposed by the Bush Administration.[144] (Romney reportedly told members of the state's congressional delegation that he would not \"be a cheerleader\" for proposals he did not agree with but that he felt he needed to \"keep a solid relationship with the White House.\")[144] Romney also said he was open to increases in the federal gasoline tax, to support transportation construction projects.[144] In 2007, after leaving the governor's office and deciding to seek the party' presidential nomination, Romney said that he had supported the Bush tax cuts overall.[149] In that same year, Romney signed the anti-tax pledge put forth by Americans for Tax Reform, pledging no new taxes or increases of existing taxes.[150] (In 2002, he had refused to sign an anti-tax pledge because he considered them \"government by gimmickry.\")[151]Romney opposed the Tax Relief, Unemployment Insurance Reauthorization, and Job Creation Act of 2010, the compromise tax package between President Obama and the Republicans Congressional leadership that centered around a two-year extension of the Bush tax cuts.[152] He said, \"because the extension is only temporary, a large portion of the investment and job growth that characteristically accompanies low taxes will be lost. [And] It will also add to the deficit.\"[152]During his 2012 presidential campaign, Romney said he would seek income tax law reforms that he said would help lower federal deficits and would stimulate economic growth. Among the series of tax changes he proposed were: reducing individual income tax rates across the board by 20 percent, maintaining the Bush administration-era tax rate of 15 percent on investment income from dividends and capital gains (and eliminating this tax entirely for those with annual incomes less than $200,000), cutting the top tax rate on corporations from 35 percent to 25 percent, and eliminating the estate tax and the alternative minimum tax.[153][154] He promised that the loss of government revenue from these tax cuts would be offset by closing loopholes and reining in tax deductions and credits available to taxpayers with the highest incomes, so that his tax plan would not raise federal deficits.[154][155][156] Non-partisan analyses of Romney’s tax plan estimated that it could have added more than $3 trillion to the federal deficit,[157] and would have favored the highest-earning Americans,[158] possibly raising annual taxes on middle-class earners by as much as $2,000.[159] Romney and supporters of his tax plan said that such analyses were unreliable because they were based on assumptions about specific measures that were not detailed in the plan[160][161] and because they had not adequately accounted for the positive effects on economic growth that Romney said his plan would generate.[158] And that lower tax rates would lower rates of Tax evasion.[162]Romney said that the tax deductions his plan might limit could include charitable contributions, home mortgage interest payments, or health-care expenses.[163] And that he might limit all deductions to $17,000 per taxpayer.[164]"},"Campaign finance[edit]":{"text":"In his 1994 Senate campaign, Romney advocated spending limits on congressional campaigns and suggested abolishing political action committees.[24] In his 2002 gubernatorial campaign, Romney proposed taxing private political contributions in order to finance publicly funded campaigns.[24] In 2007 Romney began criticizing the McCain-Feingold Law, saying \"We step into dangerous territory when politicians start eviscerating our fundamental freedoms in the name of amorphous principles, like campaign finance reform.\"[24] He wrote in 2007: \"The original intent of McCain-Feingold was to reduce the role of money and special interests in our political system. But on this too it has been a failure. Political spending has been driven into secret corners and more power and influence has been handed to hidden special interests. What is really needed is greater transparency, and disclosure, of campaign contributions – not more restrictions on political speech.\"[25]In November 2011, Romney said that the U.S. Supreme Court had made the right decision in its 2010 Citizens United v. Federal Election Commission ruling, but that he did not like some of the consequences of it: \"I'm not wild about the idea of corporations making political contributions as a concept. I think their decision was a correct decision. I support their decision. I wish we could find a way to get money out of politics. I haven't found a way to do that.\"[26] In January 2012, in the midst of the Republican Party presidential nomination primaries battle, Romney criticized the existence of Super PACs that were playing a large role in the campaign, saying, \"I’ll tell you, there have been some—there have been some attacks on me that have just been outrageous and completely inaccurate and have been shown to be inaccurate. That’s the nature of the process. I hope it ends. ... We all would like to have super PACs disappear, to tell you the truth … I think this has to change.\"[27] A Romney spokesman added at the time that Romney viewed laws limiting regular donations to candidates' campaigns as too restrictive, which resulted in money going to Super PACs instead, and that it would be better if candidates' campaigns could receive those monies directly and take responsibility for ads made with them.[27]"},"Labor unions[edit]":{"text":"Romney has been critical of former Michigan Gov. Jennifer Granholm (D) and the United Auto Workers (UAW) labor union. During a campaign speech in Michigan on June 9, 2011, he was quoted as saying \"They're out there working very hard for their friend, Barack Obama,\" he added. \"I think the union folks basically bought and paid for his last campaign, so he's taking care of them and they're taking care of him.\"[132]Romney opposes the Employee Free Choice Act, a bill that would add penalties for labor violations and would allow union recognition based on signed requests from a majority of the workers.[133] He has called for \"cutting off funding\" for the National Labor Relations Board.[134]"},"Space exploration[edit]":{"text":"The U.S. Space Shuttle program was officially retired shortly before the 2012 presidential primary campaign began in earnest. During the primary campaign, rival Republican candidate Newt Gingrich promised that if elected he would work to reinvigorate the nation's space program with a goal of establishing a permanent colony on the moon within a decade and seeking to have humans travel to Mars in the near future.[139] Commenting on Gingrich's proposals, Romney said that before committing to any particular space program, he would take advice from experts in the field. He expressed doubt that a moonbase would be a practical goal if the costs were on the order of $550 billion.[140][141] He received the endorsement of Michael D. Griffin and Eric C. Anderson, among others.[142][143]"},"Deficit[edit]":{"text":"Romney (like several other Republican candidates) signed the \"cut, cap and balance\" pledge, under which an increase in the federal debt ceiling would be contingent on major cuts in spending, caps on spending, and a balanced-budget amendment to the Constitution.[39]Romney opposed the Budget Control Act of 2011 that was passed to resolve the United States debt-ceiling crisis as part of a deal struck between President Obama and congressional leaders, including his future running mate, Paul Ryan.[40][41] Romney later criticized Obama for failing to specify the true impact of the resulting sequestration, as required by law.[42]"},"Agriculture[edit]":{"text":"In his 1994 Senate campaign, Romney called for the \"virtual elimination\" of the federal Department of Agriculture[1] and for reductions in farm subsidies.[2] In 2007, when questioned about these views, a Romney for President Iowa campaign spokesman responded: \"Governor Romney believes that investing in agriculture is key to our economy and families.\"[3]During the 2012 presidential election campaign, Romney took positions on agricultural subsidies that some media reports characterized as vague and somewhat contradictory.[4][5][6] In May 2011, just days after rival Republican presidential candidate Tim Pawlenty had declared that federal subsidies for the production of ethanol fuel should be phased out, Romney said that he was a supporter of ethanol subsidies.[7] Five months later, while speaking on agricultural subsidies at a roundtable discussion with Iowa farmers and business leaders, Romney said, “I’m not running for office based on making promises of handing out money.... We’re going to have to live within our means.”[8] He also said that while he had supported ethanol subsidies in the past in order to help the ethanol fuel industry become established, and that he continued to believe that ethanol should play a role in meeting the nation’s energy needs, he agreed with the discontinuation of the tax credit for production of ethanol from corn that was scheduled to occur two months later.[8] On the subject of agricultural subsidies more generally, Romney wrote in response to a 2012 questionnaire from the American Farm Bureau Federation that \"other nations subsidize their farmers, so we must be careful not to unilaterally change our policies in a way that would disadvantage agriculture here in our country.\"[9] He made similar remarks on the campaign trail in August 2012, without explicitly referring to subsidies: \"We don't want to find ourselves with regards to our food supply in the same kind of position we are in with our energy supply, so it's important for us to make sure that our farmers are able to stay on the farm and raise the crops that we need to have a secure source of food. So I believe in supports that will allow us to do that.\"[10]Romney’s position on federal mandates that require gasoline producers to include ethanol in gasoline blends has been less clear.[6] The Romney campaign responded to a survey question asking for Romney’s position on ethanol use mandates by saying the ethanol industry “has made important strides in reducing America's dependence on foreign oil” and ethanol “should continue to have prospects for growing its share in transportation fuels.”[6] Romney wrote to the American Farm Bureau Federation, \"The increased production of biofuels plays an important part in my plan to achieve energy independence. In order to support increased market penetration and competition among energy sources, I am in favor of maintaining the Renewable Fuel Standard.\"[9]Romney declined to respond to survey questions from the Iowa Corn Growers Association requesting his positions on crop insurance and conservation during the presidential primary campaign.[4] He responded to an American Farm Bureau Federation questionnaire in 2012 by saying, \"my immediate priority [as president] should be given to enacting disaster relief for those not traditionally covered by crop insurance as this year’s drought has worsened.\"[9]"},"Energy and the environment[edit]":{"text":"Romney’s positions on energy policy and environmental protection regulations shifted from his time as governor of Massachusetts to his campaign for the presidency in the 2012 election.[43][44][45][46]As a candidate for governor of Massachusetts in 2002,[47] and later as governor,[48] Romney prioritized policies that would promote energy conservation and reduce environmental pollution. He said that he was \"absolutely committed\" to renewable energy and that \"I think the global warming debate is now pretty much over and people recognize the need associated with providing sources which do not generate the heat currently provided by fossil fuels.\"[49]Campaigning for the governorship, he argued in support of measures such as imposing higher taxes on SUVs to help reduce auto emissions and conserve energy; revitalizing urban neighborhoods using fees charged to developers for cutting down trees in suburban areas; and doubling the rate of cleanup of brownfield lands.[47]In his first 100 days in office as governor, he proposed expansion of the beverage container deposit law (bottle bill), a switch by state government agencies to the use of environmentally friendly cleansers, and clean up of the state's “Filthy Five” power plants.[50] He appointed a prominent environmentalist, Douglas Foy, to oversee energy development, transportation, housing, and environmental affairs.[50] Foy helped develop an energy and environment plan that included 72 public and private initiatives, with a goal of deriving 15 percent of the state’s electricity from renewable sources such as wind, solar, and nonpolluting fuel cells by 2020, and of reducing greenhouse gas emissions of state agencies by 25 percent. The plan also proposed to impose strict emissions standards on older power plants and sought to substantially reduce soot emissions from diesel buses, trucks, and heavy construction equipment.[48]Arguing for environmental protection regulations in 2003, Romney said that \"if the choice is between dirty power plants or protecting the health of the people of Massachusetts, I will always come down on the side of public health.\"[51] He insisted that a coal power plant not delay in meeting tough emissions standards even at the cost of losing jobs: \"I will not create jobs or hold jobs that kill people.... And that plant, that plant kills people.\"[44]As governor, he also argued for limits on oil and gas drilling in order to protect the environment. In his state of the Commonwealth address in January 2005, Romney said, “I'm concerned about the preservation of our natural resources. I will file legislation to protect our oceans from off shore drilling and commercial development. The oceans should not be up for grabs like some Wild West land rush.”[52] He signed into law a bill to protect against oil spills and to increase penalties for polluters.[44][53]He pursued policies to make greater use of carpooling and public transit, and sought tax credits to stimulate purchases of hybrid and other more fuel-efficient vehicles.[54][55]Romney argued that tax policy should be used to promote energy conservation. When his lieutenant governor supported a temporary suspension of the state gasoline tax to provide consumers some relief during a period of especially high gasoline prices in 2006, Romney rejected the proposal, arguing that maintaining the tax would help encourage energy conservation: “I don’t think that now is the time, and I’m not sure there will be the right time, for us to encourage the use of more gasoline.... I am very much in favor of people recognizing that these high gasoline prices are probably here to stay and that the appropriate action for us to take is to find ways to find fuel conservation.”[56]He highlighted support for government investment in developing sources of renewable energy, such as wind and solar, early in his administration,[46][57] although he opposed a proposal that would have sited a wind farm in Nantucket Sound off Cape Cod, where he said the visual impact would be detrimental to the state's tourist economy.[49]Romney initially supported a regional greenhouse gas cap-and-trade initiative for New England and eastern Canada,[58] but he ultimately withdrew his support when he was unable to ensure establishment of certain limits on the penalty fees businesses would be charged for exceeding emissions allowances.[59] A week later, his administration issued a rule allowing companies to pay a fine instead of having to clean up emissions of toxins like mercury.[60] Both decisions were made as Romney announced he would not run for a second term as governor and began to focus on entering the 2008 presidential campaign.[60] Some former Romney policy advisors later told the New York Times that his political team had been afraid that, with industry being opposed to the cap-and-trade proposal, Romney's having included Massachusetts in the Regional Greenhouse Gas Initiative would have made Romney's chance of winning a presidential campaign very unlikely.[44]Early in the 2012 presidential campaign, in June 2011, Romney said, \"I don't speak for the scientific community, of course, but I believe the world's getting warmer. I can't prove that, but I believe based on what I read that the world is getting warmer. And number two, I believe that humans contribute to that. I don't know how much our contribution is to that, because I know that there have been periods of greater heat and warmth in the past but I believe we contribute to that. And so I think it's important for us to reduce our emissions of pollutants and greenhouse gases that may well be significant contributors to the climate change and the global warming that you're seeing.\"[61][62] Several weeks later, in October 2011, he said, \"My view is that we don't know what's causing climate change on this planet. And the idea of spending trillions and trillions of dollars to try to reduce CO2 emissions is not the right course for us.\"[63] He expressed his opposition to cap and trade plans and to regulation of carbon emissions.[64] In June 2012, Romney's domestic policy advisor Oren Cass told the Los Angeles Times, \"He's a supporter of renewable energy, as long as it's anything that would be economically competitive. He doesn't know the extent to which climate change is occurring or that human activity is causing it.... What you won't see are mandates or taxes or regulations that interfere with economic activity.\"[60]In August 2012, during a week of heavy fundraising from oil company executives,[65][66] Romney put forward what he called a comprehensive[65][66] energy plan that he said would allow North America to become independent of foreign oil imports within a decade.[67]Romney’s energy proposal called for aggressively expanding drilling for fossil fuels, such as oil and natural gas, by easing federal regulations.[67][68][69] The plan would seek to increase offshore drilling along the coasts of states like Virginia and the Carolinas, as well as in previously restricted areas of the Arctic National Wildlife Refuge; and would give states more control over energy development on federal lands within their borders (Romney noted that oil companies currently wait an average 307 days for drilling permits from the federal government, while the state of North Dakota takes only 10 days to issue permits to drill on state-owned land[69]). Additionally, the plan called for expansion of coal mining and nuclear energy production.Romney reiterated in the proposal that as president he would approve the Keystone XL pipeline, to carry oil sands crude from western Canada to the U.S. Gulf Coast for refining.[68] (During the campaign, Romney had promised that he would approve the pipeline project by executive order on his first day in office as president.[70])Romney’s written energy policy proposal made no mention of climate change,[69][71] and made little mention of plans to improve energy conservation.[69] During the campaign Romney opposed the U.S. Environmental Protection Agency's (EPA) requirement that the average fuel efficiency of cars be doubled by 2025.[72] \"Governor Romney opposes the extreme standards that President Obama has imposed, which will limit the choices available to American families,\" said Romney spokeswoman Andrea Saul.[73]Romney had previously expressed opposition to federal aid for renewable energy development,[74][75] and his August 2012 energy policy plan proposed eliminating government support in the form of loan guarantees and subsidies for development of renewable types of energy,[71][76][77] sources of energy that Romney had said the Obama administration has been over-reliant on.[65]Romney's energy plan that was unveiled in August 2012 would maintain subsidies for oil companies, which Romney's rival for the presidency, Obama, would eliminate.[78] During the 2008 presidential campaign, in November 2007 when all of the Democratic presidential candidates were calling for eliminating billions of dollars of tax breaks for oil companies, Romney told the New York Times, \"Now is not the right time to raise taxes on our oil companies.\"[79] Throughout most of the 2012 presidential campaign, Romney himself made almost no public statements directly commenting on tax breaks for oil and gas companies; and the Romney campaign declined to respond to repeated requests from the Tampa Bay Times' Politifact and The Washington Post's Fact Checker to clarify his position.[80][81] However, he did tell a town hall gathering in April 2012 that, in contrast to Obama, he did not want to raise taxes on oil companies.[82] Romney's chief energy advisor also testified before Congress twice during the campaign on behalf of the oil and gas industry that Congress should maintain tax benefits for oil and gas producers.[83][84] During the first presidential debate between Romney and Obama, in October 2012, Romney hinted for the first time that as president he might consider eliminating $2.8 billion in tax breaks for oil and gas producers if Congress would agree to cut the tax rate for all corporations by 30%.[85][86]"},"Health care[edit]":{"text":"During his 1994 run for the United States Senate, Romney indicated he would support a bill that included a federal health insurance mandate, saying that he was \"willing to vote for things that [he was] not wild with\".[98]As governor of Massachusetts in 2006, Romney proposed and signed into law a private, market-based reform that ensures every Massachusetts citizen will have health insurance, without a government takeover and without raising taxes.[99][100][101] The legislation requires health insurance for all state residents, provided a plan is available to the individual that deemed affordable according to state standards. Employers with eleven or more employees are mandated to offer approved insurance plans for employees. Romney vetoed eight sections of the legislation, including a $295 per person fee on businesses with eleven employees or more that do not provide health insurance.[102][103] Romney also vetoed provisions providing dental and eyeglass benefits to low income residents on the Medicaid program, and providing health coverage to senior and disabled legal immigrants not eligible for federal Medicaid.[104][105] State legislature overrode all of the vetoes.[106]In August 2007, at the Florida Medical Association, Romney unveiled his proposed national health care plan, which departed significantly from the universal health care measure that he helped forge as governor of Massachusetts. It differed from the Massachusetts plan in that it involved no individual mandate on a national basis but instead offered tax deductions for those buying insurance on their own, and allowing the states to choose their own health care plans.[107]During 2009, as Congress debated proposals for health insurance reform, Romney said that he was in favor of increased health insurance portability, coverage of pre-existing medical conditions, a cap on malpractice lawsuits, the implementation of a streamlined electronic medical records system, an emphasis on preventative care, loosening restrictions on importation of prescription drugs, and tax benefits aimed at making health insurance more affordable for the uninsured and targeted to promote universal access. He said he opposed efforts to provide non-emergency health coverage to undocumented immigrants and he supported the Hyde Amendment prohibiting government funding for elective abortion.[108] Romney opposed a federal single-payer system, but supported state efforts to reduce the uninsured population.[109]Romney opposed the Patient Protection and Affordable Care Act (also known as the Affordable Care Act or Obamacare) that was ultimately passed by Congress and signed by President Obama in 2010.[110] Immediately following its passage, Romney attacked the landmark legislation as \"an unconscionable abuse of power\".[110][111] He said, \"The act should be repealed. That campaign begins today.\"[110] Romney acknowledged that his own plan for near-universal healthcare access in Massachusetts was not perfect and was still a work in progress, but he did not dissociate himself from the Massachusetts plan. Instead, he focused on its having successfully passed the state legislature with bipartisan support while the Obama plan had received no Republican support at all in Congress. He also complained that President Obama had not sought out his expertise in crafting the national plan that became the Affordable Care Act.[111]In June 2012, Romney pledged to enact a system to replace the Affordable Care Act, but did not release details of how it would be paid for.[112] Romney's plan includes expanding health savings accounts to pay for premiums, increased competition and consumer choice, and lawsuit reform.[113] Romney has also praised the cost controls of the mandated universal health care coverage of Israel.[114]In August 2012, Romney indicated that he might retain parts of Obamacare such as coverage for pre-existing conditions, but this was quickly clarified as only ensuring insurance coverage for people who already had insurance coverage.[115] In September 2012, Romney highlighted his success in providing government subsidizes to ensure medical coverage for all the children of Massachusetts.[116] And in October the Romney campaign questioned the assumptions behind a Commonwealth Fund report that Romney's policies would provide health care insurance for 45 million fewer Americans than Obama's policies.[117]While campaigning for the governorship of Massachusetts in 2002, Romney argued that the federal government should pay for medicines for seniors: \"It is outrageous that some senior citizens are forced to choose between paying for their prescription drugs and their groceries. The federal government needs to step in with a plan for our senior citizens, and I will lobby officials on the federal level to provide a Medicare drug benefit.\"[118] (The U.S. Congress would pass legislation providing for Medicare prescription drug coverage - Medicare Part D - the following year.)In February 2012, in an address to the Detroit Economic Club during which he discussed his recently unveiled economic plan and federal budget proposal, Romney said that to help control government healthcare expenditures, as president he would seek to gradually raise the minimum age for Medicare eligibility. The change in eligibility would affect future Medicare beneficiaries who at the time of enactment of the rule change would be 54 years of age or younger; the eligibility age would be raised by one month per year, then eventually tied to life-expectancy.[119][120]Romney named Representative Paul Ryan as his vice-presidential running mate in August 2012. A year earlier, in June 2011, the Republican-controlled U.S. House of Representatives had passed a Republican alternative budget proposed by Ryan, with no Democrats voting for it. One controversial aspect of the proposal concerned Medicare; for those under age 55 as of its enactment, it would replace the existing Medicare system in which the government pays doctors, hospitals, and other medical providers fees for services rendered with a system in which the government would instead pay vouchers (also referred to as premium-support subsidies) to Medicare beneficiaries, who could then use their vouchers to either buy private medical insurance or to obtain coverage in a plan similar to traditional Medicare.[121] Romney said that as president he would sign such a plan if it reached his desk, but he added that he would be putting forward his own plan before debating Obama.[122]During an interview in August 2012, several days after choosing Ryan as his running mate, Romney said, \"Paul Ryan and my plan for Medicare, I think, is the same, if not identical -- it's probably close to identical.\"[121]A 2012 study by the Kaiser Family Foundation said, in October 2012, that a hypothetical Medicare plan along the lines of Romney would raise premiums for nearly 6 out of 10 seniors.[123] The Romney campaign noted that the study did not specifically model any proposal from either campaign.[124]In September 2012, a mailer from the Romney and Ryan campaign indicated they favored a law regarding \"chronic Lyme disease\", a controversial and unrecognized diagnosis, that will provide \"physicians with protection from lawsuits to ensure they can treat the disease with the aggressive antibiotics that are required.\"[125][126]"},"Defense spending levels[edit]":{"text":"During the 2012 presidential campaign, Romney proposed to increase the size of the military by at least 100,000 troops.[28] He called for spending priorities that include an expanded Naval armada estimated at $40 billion.[29] But he did not specify how he would pay for this spending under the current tight Federal budget.[30] John Lehman, a top adviser, said that the shipbuilding funds would come from cuts in the Pentagon.[31] Romney said he would extend Obama administration's current plans of building two attack submarines a year to three submarines a year, and would split the current co-production of submarines into two independent operations.[32]Romney singled out the Bell Boeing V-22 Osprey as a program that would require \"very careful inspection\",[33] however he pledged to ramp up production of jet fighters.[34][35]According to Suzy Khimm, writing in the Washington Post in mid 2012, the Obama administration's 2013 budget would have had defense spending go from about 4.5% of GDP in 2012 to about 3% of GDP in 2013.[36] Romney, by contrast, called for setting a defense spending floor at 4% of GDP.[37] In September 2012, Romney said that he would like to maintain the current level of defense spending relative to GDP.[38]"},"Housing market[edit]":{"text":"Asked \"How will you help with the housing and foreclosure problems in the U.S.?\", Romney responded that it would be best not to try and stop the foreclosure process, to let it run its course and hit the bottom, and that he might be open to some government action to encourage refinancing. He also referred to the Obama administration as having \"slow walked the foreclosure processes that have long existed, and as a result we still have a foreclosure overhang\", and that the credit that was given to first-time home buyers was inadequate to turn around the housing market.[127] He nevertheless is open to some government intervention[128] but demands that it make sense from a business standpoint. Should the foreclosure process run its course, Romney sees recovery for the market[128] as investors are allowed to salvage property values and move people back into their homes as renters, with the possibility to buy when they are fiscally prepared."},"Minimum wage[edit]":{"text":"As governor of Massachusetts and as a candidate for president, Romney has called for tying raises in the national minimum wage to indicators of growth in the economy, such as increases in the inflation rate.[135] He has said that increases in the minimum wage should be moderate and predictable.[136] Commenting in March 2012 on a proposal put forward by some Democratic legislators to raise the minimum wage from $7.25 to $10 per hour, Romney said that an increase in the minimum wage was probably not necessary at that time.[137]However, Romney has recently criticized his party's stance on minimum wage and now believes that it is the time to increase the federal minimum wage in 2016.[138]"},"Unemployment insurance[edit]":{"text":"In 2010, Romney said that\"A decent and humane society must have a strong safety net for the unemployed. I served for 15 years as a lay pastor in my church and saw the heartbreak of joblessness up close; a shattering loss of faith in oneself is but only one of many forms the suffering can take. Nonetheless, the vital necessity of providing for those without work should not be used as an excuse to ignore the very real problems of our unemployment system. In this, as in so many other arenas of government policy, unemployment insurance has many unintended effects. The indisputable fact is that unemployment benefits, despite a web of regulations, actually serve to discourage some individuals from taking jobs, especially when the benefits extend across years. The system is also not designed for a flexible economy like ours in which some employees move from job to job for short periods, and are therefore ineligible for unemployment compensation when they are faced with a protracted spell without work.\"[152]Romney instead offered two possible replacement systems, one involving individual unemployment savings accounts that employees would withdraw from when they lose their jobs, the other keyed on instituting financial incentives for businesses and other employers to hire and train those who had been unemployed for a long time.[152]"},"text":"","Automotive industry[edit]":{"text":"During the 2008 presidential primary campaign, Romney had distinguished his prescription for the automotive industry from rival candidate John McCain's by calling for a five-fold increase, to $20 billion per year over five years, in federal funding for research and development in energy, fuel technology, materials science, and automotive technology. In a January 14 speech, he stated, “I’m not willing to sit back and say, ‘… Too bad for the people who’ve lost their jobs. They’re gone forever.’\"[11][12] As the automotive industry crisis of 2008 arose amidst the near collapse of the private-sector credit market and banking industry in late 2008, Romney argued against a bailout with direct government loans of the auto industry. He proposed that struggling auto manufacturers should undergo managed bankruptcy, after which they should seek loans from the private-sector credit market with government-backed loan guarantees. Writing in an op-ed article published in the New York Times in November 2008 (his original title had been \"The Way Forward for the Auto Industry\" but the editors published the article under the title \"Let Detroit Go Bankrupt\"),[13][14] Romney said, \"If General Motors, Ford and Chrysler get the bailout that their chief executives asked for yesterday, you can kiss the American automotive industry goodbye.\" In referring to his proposal for managed bankruptcy, he said \"[i]t would permit the companies to shed excess labor, pension and real estate costs.\"[15] The Obama Administration ultimately implemented managed bankruptcy reorganizations of the General Motors and Chrysler corporations in combination with the direct government financing that Romney had opposed,[11][16] after which Romney said that he deserved credit for the auto industry's recovery.[17]During the 2012 presidential campaign, Romney criticized the Obama Administration for holding General Motors stock for longer than he thought prudent. He said that the government should sell its General Motors stock holdings quickly and should seek alternatives to what he called excessive automotive industry regulation.[18][19] He also said that fuel economy standards should be determined by market forces rather than by government mandates, and he called electric vehicles “a technology that people aren’t interested in.”[18] GM and Chrysler have denied that their post-bailout returns to the Chinese market are attempts to outsource American jobs, as Romney claimed from a since corrected report by Bloomberg News.[20][21]"}},"Social policy[edit]":{"Gambling[edit]":{"text":"As Governor of Massachusetts, Romney proposed that the state seek $75 million in \"blocking payments\" from casinos in Connecticut, and that, if the payments were not made, Massachusetts legalize casinos within its own borders.[357]In October 2011, Romney told the Las Vegas Sun that he had not yet taken a serious look at the issue of legalizing online poker, but that he would do so and state a position \"[b]efore the caucuses come along\".[358] Just before the Republican caucuses in Nevada, Romney announced his opposition to online gambling, citing the \"social costs and people’s addictive gambling habits.\"[359]"},"Education[edit]":{"text":"Romney supports offering school choice options such as charter schools, school-voucher programs for public and private schools, and home-schooling as an alternative to mandating that students continue to attend underperforming schools in the traditional public school system.[331][332][333] He has called for performance-based pay for public-school teachers, along with bonuses for the best teachers, as an incentive to help improve the quality of education.[331][334]Romney has frequently blamed the influence of teachers unions for the failings of the public education system. He supports legislation championed by Governor Scott Walker of Wisconsin[335] and Governor John Kasich of Ohio[336] stripping collective-bargaining rights from teachers and other public employees. He has stated that superintendents and principals should be able to fire teachers without regard for seniority.[337] During a presidential primary debate in 2011, he said that efforts to reduce classroom size were a ploy by teachers unions to promote the hiring of more teachers; and he vowed, “as president, I will stand up to the National Teachers Unions.”[338]Romney has acknowledged that he has held different views over time on the federal government's role in education. During a debate in the 2008 presidential campaign, he said:[339]\"once upon a time, I said I wanted to eliminate the Department of Education. That was my position when I ran for Senate in 1994. That's very popular with the base. As I've been a governor and seen the impact that the federal government can have holding down the interest of the teachers' unions and instead putting the interests of the kids and the parents and the teachers first, I see that the Department of Education can actually make a difference. So I supported No Child Left Behind. I still do. I know there are a lot in my party that don't like it, but I like testing in our schools. I think it allows us to get better schools, better teachers; allows us to let our kids have the kind of hope that they ought to have.\"However, during a presidential primary debate in 2011 he said, \"education has to be held at the local and state level, not at the federal level. We need to get the federal government out of education.\"[338]During his Senate campaign in Massachusetts in 1994, Romney said that he would support federal funding to schools to teach the importance of family values, ethics, and personal economics, but that he was opposed to public schools' endorsing any specific religious beliefs or teaching prayer.[340] More recently, during his presidential campaigns in 2007 and 2012, he said that while he was not seeking for teachers to lead their classes in prayer in public schools every day, he did believe it to be appropriate for there to be public recognition of the Creator in public schools at graduation ceremonies, football games, and other school events, and he also said that he supported the display of religious symbols such as Nativity scenes in the public square during holidays.[341][342]As governor of Massachusetts in the mid-2000s, Romney opposed the teaching of creationism in public school science classes. He noted during an interview in 2007 that \"If we’re going to talk about more philosophical matters, like why it was created, and was there an intelligent designer behind it, that’s for the religion class or philosophy class or social studies class.\"[343]Romney has supported abstinence-only sex education in public schools.[citation needed] In his run for the Senate in 1994, he said one of the programs that should be taught in schools was \"the importance of getting married before having children.\"[344] In the May 2007 South Carolina debate, Romney said he has always \"fought for abstinence education.\"[247]Romney generally opposes federal financial aid for college and other post-secondary education. While campaigning for the presidency in 2012, he argued that students should not expect government handouts to fund their education. In response to a high school senior who had asked what kind of college tuition assistance Romney would seek to provide as president, Romney replied, “I know that it would be popular for me to stand up and say I’m going to give you government money to make sure you pay for your college. But I’m not going to promise that. What I’m going to tell you is shop around, get a good price.... Don’t take on too much debt, and don’t expect the government to forgive the debt that you take on. Recognize that you’re going to have to pay it back.”[345] He similarly told a law student who had asked what kind of federal assistance might be available in a Romney presidency for graduate students struggling to repay education loans: “I wish I could tell you that there’s a place to find really cheap money or free money and we could pay for everyone’s education. That’s just not going to happen.”[346][347] He encouraged young people to be entrepreneurially-minded and to take risks, even to consider borrowing money from their parents if necessary to further their careers.[348]Romney laid out some of his proposals for higher education reforms in May 2012. His platform called for simplification of the federal financial aid system, which he described as “needlessly complex.”[349] He further proposed abolishing the current federal student lending system that was put in place by the Obama administration, under which the Department of Education makes loans directly to students; Romney proposed returning to the previous arrangement in which private banks and other third-party financial institutions would make the loans and be paid federal subsidies for the service.[349]He also proposed plans to “refocus Pell Grant dollars on the students that need them most.”[349] While he did not provide details explaining how he would reform the Pell grant program, some commentators noted[350][351] that Romney had been generally supportive of federal budget proposals offered by the Republican majority in the House of Representatives that would be likely to reduce the total number of students eligible to receive the grants.[352]"},"Gun ownership[edit]":{"text":"While campaigning to represent Massachusetts in the U.S. Senate in 1994, Romney supported the Brady Bill, which imposed a five-day waiting period on gun sales, and a ban on particular semi-automatic rifles.[360] He said at the time, \"That's not going to make me the hero of the NRA. I don't line up with the NRA.\"[361] In 2002, during his campaign for the governorship, Romney said: \"We do have tough gun laws in Massachusetts; I support them. I won't chip away at them; I believe they protect us and provide for our safety.\"[361]As governor of Massachusetts, in 2004 Romney signed[362] a measure permanently extending a statewide ban on military-style assault weapons, such as AK-47's and Uzi's.[363] At the bill-signing ceremony Romney said, \"Deadly assault weapons have no place in Massachusetts.... These guns are not made for recreation or self-defense. They are instruments of destruction with the sole purpose of hunting down and killing people.\"[362] Proponents of the state semi-automatic assault weapons ban had argued that its passage was necessary because a similar ban at the federal level was also expiring.[363]The bill also included several compromise measures sought by gun enthusiasts to lessen restrictions on lawful gun ownership, including an extension of the term of firearms licenses from 4 to 6 years, reinstatement of a 90-day grace period for citizens renewing expired firearms licenses, and establishment of a firearms license review board empowered to consider reinstating ownership status to those who had lost their licenses after having committed certain non-violent misdemeanors more than 5 years in the past.[364][365]In 2005, Governor Romney declared May 7 to be \"Right to Bear Arms Day\" in Massachusetts,[366] that date having been chosen to coincide with the annual banquet of the Gun Owners' Action League (a Massachusetts gun rights advocacy organization affiliated with the National Rifle Association).[367] Romney's top aides then began meeting almost monthly with members of the Gun Owners' Action League.[366]In August 2006, just before declaring his candidacy for the 2008 Republican nomination for president, Romney joined the National Rifle Association (NRA) as a lifetime member.[360][368][369] Seeking the endorsement of the NRA, Romney made several statements during the campaign regarding his proficiency with and support for firearms:\"I purchased a gun when I was a young man. I've been a hunter pretty much all my life.\"[368]\"Shooting rabbits single shot 22 is pretty hard.\"[370]\"I have a gun of my own. I go hunting myself. I'm a member of the NRA and believe firmly in the right to bear arms. In our state . . . there are a series of laws restricting gun ownership in various ways. Over the past four years, I've worked very closely with the Gun Owners' Action League here, which is an affiliate of the NRA, and we've made some changes which I think they feel have been positive steps.\"[361]\"So I'm a hunter and believe in Second Amendment rights, but I also believe that assault weapons are not needed in the public population.\"[371]The Associated Press reported in early 2007 that Romney's \"hunting experience is limited to two trips at the bookends of his 60 years: as a 15-year-old, when he hunted rabbits with his cousins on a ranch in Idaho, and last year, when he shot quail on a fenced game preserve in Georgia,\"[368] and that Romney had never sought a hunting license in any of the four states where he had resided. Romney replied by saying that he mainly hunted small game in Utah, where a license was not required.[372] He also clarified that he did not 'own' a gun and said that one of his sons keeps two guns at the family vacation home in Utah.[369]In December 2007, still campaigning for the Republican presidential nomination, Romney summed up his general position on gun control at that time as: \"we should check on the backgrounds of people who are trying to purchase guns. We also should keep weapons of unusual lethality from being on the street. And finally, we should go after people who use guns in the commission of crimes or illegally, but we should not interfere with the right of law-abiding citizens to own guns either for their own personal protection or hunting or any other lawful purpose.\"[373] He also said that, had it come before him as president, he would have signed a renewal of the federal assault weapons ban that had expired.[373] The following month, during a presidential primary debate, he noted that the federal assault weapons ban that he would have signed as president had failed in Congress, and he insisted that he would not support any new gun control legislation: \"I do not believe we need new legislation. I do not support any new legislation of an assault weapon ban nature, including that against semiautomatic weapons. I instead believe that we have laws in place that if they're implemented and enforced, will provide the protection and the safety of the American people.\"[374]Romney continued to argue against any new gun control legislation during the 2012 presidential campaign, telling the NRA’s national convention that if elected president, he would “enforce current laws, not create new ones that only serve to burden lawful gun owners.”[375]In the wake of a mass-shooting of unarmed civilians in Aurora, Colorado in July 2012, Romney maintained in a series of interviews that he opposed any new gun control measures.[376][377][378] Referring to the alleged perpetrator of the Aurora massacre, Romney said, \"This person shouldn't have had any kind of weapons and bombs and other devices, and it was illegal for him to have many of those things already.... But he had them. And so we can sometimes hope that just changing the law will make all bad things go away. It won't.\"[379] (However, as reported by The Denver Post, authorities said that the suspect had passed the required background checks and had broken no laws when purchasing an assault-style rifle, a shotgun, and Glock handgun.)[379]"},"Family[edit]":{"text":"Mitt Romney has said that strong families are one of his three pillars, along with military and economy, for a strong America.[356]"},"Abortion and related issues[edit]":{"text":"In a 1994 debate with Senator Ted Kennedy, Romney said: \"One of the great things about our nation ... is that we're each entitled to have strong personal beliefs, and we encourage other people to do the same. But as a nation, we recognize the right of all people to believe as they want and not to impose our beliefs on other people. I believe that abortion should be safe and legal in this country. I have since the time that my mom took that position when she ran in 1970 as a U.S. Senate candidate. I believe that since Roe v. Wade has been the law for 20 years, that we should sustain and support it, and I sustain and support that law, and the right of a woman to make that choice, and my personal beliefs, like the personal beliefs of other people, should not be brought into a political campaign.\"[256][257][258]During the 2002 governor's race, Romney's platform stated, \"As Governor, Mitt Romney would protect the current pro-choice status quo in Massachusetts. No law would change.\"[259] The executive director of Massachusetts NARAL at the time, Melissa Kogut, stated that in her organization's endorsement interview with Romney, he was \"emphatic that the Republican Party was not doing themselves a service by being so vehemently anti-choice.\"[260][261]The Boston Globe on July 26, 2005 quoted Romney saying, \"I am pro-life. I believe that abortion is the wrong choice except in cases of incest, rape, and to save the life of the mother. I wish the people of America agreed, and that the laws of our nation could reflect that view. But while the nation remains so divided over abortion, I believe that the states, through the democratic process, should determine their own abortion laws and not have them dictated by judicial mandate.\"[262] At the May 2007 Republican Presidential debate in South Carolina, Romney stated that \"Roe v. Wade has gone to such an extent that we've cheapened the value of human life.\" He followed by saying \"the people should make [the abortion] decision, not the court.\"[247] Romney's spokesperson has indicated that had Romney been the governor of South Dakota, he would have signed into law the controversial law banning abortion, but he would include exceptions for cases of incest or rape, which the South Dakota law excludes.[263]In statements after leaving the governorship, Romney expressed opposition to \"partial birth\" abortion.[108][264][265]Campaigning in the presidential primaries in 2011, Romney declined to sign a pro-life pledge sponsored by the Susan B. Anthony List to support legislation ending all taxpayer funding of abortion, sign a law to \"protect unborn children who are capable of feeling pain from abortion,\" and nominate judges and appoint executive branch officials who are pro-life. Romney's spokeswoman said he could not sign the pledge because it could have unforeseen deleterious consequences. Romney himself wrote that, \"It is one thing to end federal funding for an organization like Planned Parenthood; it is entirely another to end all federal funding for thousands of hospitals across America.... That is precisely what the pledge would demand and require of a president who signed it.\"[266] He promised that nonetheless he would support pro-life legislation should it come before him as president,[267] such as a Pain-Capable Unborn Child Protection Act, which would ban abortions after 20weeks of pregnancy.[268][269]During the general election campaign in October 2012, he said that as president, \"There's no legislation with regards to abortion that I'm familiar with that would become part of my agenda.\"[267] The following day, his campaign spokeswoman said that \"Gov. Romney would of course support legislation aimed at providing greater protections for life.\"[267]While Romney would prefer to see passage of federal legislation or of a constitutional amendment that would outlaw abortion, he does not believe the public would support such measures;[270][271] as an alternative, he has promised to nominate Supreme Court justices who would help overturn Roe v. Wade, allowing the states to individually decide on the legality of abortion.[272]Throughout the 2012 presidential campaign, Romney vowed that he would eliminate all federal funding for Planned Parenthood if elected.[273]Romney has expressed support for constitutional amendments at both the state and federal level guaranteeing constitutional protections to the unborn from the moment of fertilization. During the 2008 presidential campaign, Romney said that if elected president, he would support an amendment to the U.S. Constitution that would legally define personhood as beginning at conception.[274] In the 2012 presidential campaign, he said that, had he as governor been presented with a state constitutional amendment to define life as beginning at conception, he would have supported it.[275]In a campaign interview on October 9, 2012, Romney stated, \"There’s no legislation with regards to abortion that I’m familiar with that would become part of my agenda.\"[276][277] Democrats charged that Romney was trying to appeal to moderate voters by hiding his true position on reproductive rights.[276] A Romney campaign spokesperson told the conservative National Review Online that Romney \"would, of course, support legislation aimed at providing greater protections for life.\"[277]When he ran for governor in 2002, Romney strongly advocated stem-cell research, and he promised to lobby then-President George W. Bush to embrace it.[278] During Romney's 2008 presidential campaign, he renounced his prior position and said that he agreed with Bush's decision to ban federal funding for research on excess embryos.[278] He said that his views had been drastically altered in 2004 after discussing stem cell research with Douglas Melton, a stem cell researcher at Harvard University. The Harvard Stem Cell Institute was planning research that would have involved therapeutic cloning.[279][280] According to Romney, Melton declared that the research \"is not a moral issue because we kill the embryos at 14 days.\" \"I looked over at Beth Myers, my chief of staff, and we both had exactly the same reaction, which is it just hit us hard,\" recalled Romney. \"And as they walked out, I said, 'Beth, we have cheapened the sanctity of life by virtue of the Roe v. Wade mentality.'\"[280]During his 2012 presidential campaign, Romney opposed research using cloned embryos created by implanting human DNA into donated eggs.[278][chronology citation needed]During the 2012 presidential primary campaign, when asked by a debate moderator whether he believed states have the authority to ban contraception, Romney replied, \"I would totally and completely oppose any effort to ban contraception.\"[281]Romney opposes a rule issued by the Obama Administration's Department of Health and Human Services, in its implementation of the Affordable Care Act, which requires that nearly all health insurance plans offer free contraceptive services as part of preventive care for women.[282][283] Health plans sponsored by religious employers (such as churches) that are non-profit organizations primarily employing and serving members of their own faith are exempt; but the rule does apply to institutions such as church-affiliated hospitals and schools that do not primarily employ and serve members of the faith.[284] Romney supported a legislative measure (the Blunt amendment) that would have allowed employers and health insurance companies to deny coverage for contraceptives and other services that they object to on religious or moral grounds; the amendment failed passage in the Senate.[283] Romney subsequently said that if elected president, he would rescind the contraception coverage requirement.[285]During the second presidential campaign debate with President Barack Obama in October 2012, Obama said that \"Gov. Romney feels comfortable having politicians in Washington decide the health care choices that women are making.... [Gov. Romney] suggested that in fact employers should be able to make the decision as to whether or not a woman gets contraception through her insurance coverage.\" Romney responded, \"I'd just note that I don't believe that bureaucrats in Washington should tell someone whether they can use contraceptives or not. And I don't believe employers should tell someone whether they could have contraceptive care or not. Every woman in America should have access to contraceptives. And the president's statement of my policy is completely and totally wrong.\"[286]"},"Evolution[edit]":{"text":"As Governor of Massachusetts, Romney supported the teaching of evolution, and opposed the teaching of intelligent design, in public school science classes, stating so in December 2005 during his term,[353] and then in May 2007 – shortly after his term concluded – saying, \"In my opinion, the science class is where to teach evolution, or if there are other scientific thoughts that need to be discussed. If we’re going to talk about more philosophical matters, like why it was created, and was there an intelligent designer behind it, that’s for the religion class or philosophy class or social studies class.\"[354] Romney expressed his own views in May 2007 by saying, \"I believe that God designed the universe and created the universe. And I believe evolution is most likely the process he used to create the human body. ... I’m not exactly sure what is meant by intelligent design. But I believe God is intelligent and I believe he designed the creation. And I believe he used the process of evolution to create the human body.\"[354] He said that when faculty members interviewing him for an honors designation asked for his beliefs on the subject before his 1971 graduation from Brigham Young University, he told them that there was \"[no conflict] between true science and true religion\".[354] At a May 2007 Republican Party presidential debate, Romney was not one of several candidates that raised their hands to indicate they did not accept evolution.[355]"},"Immigration[edit]":{"text":"Romney favors increased legal immigration to the United States and opposes illegal immigration,[380] but he would respect the work permits to younger illegal immigrants that President Obama had granted.[381] In 2006, Romney said he would like to see undocumented immigrants register with the government, pay taxes, and apply for citizenship, but that they should not be given any priority or special treatment over immigrants who have applied for citizenship legally.[382] During the 2008 presidential primary campaign, he embraced the support of Arizona's Maricopa County Sheriff Joe Arpaio, known for his very tough stance on immigration. Arpaio served as honorary chair of Romney's Arizona campaign organization[383] and as a campaign surrogate for Romney on immigration.[384]During the 2012 presidential election primary campaign, Romney called Arizona’s approach to illegal immigration “a model for the nation.”[385] He vowed that on his first day in office as president, he would bring an end to the lawsuits the Obama Administration’s Justice Department had brought challenging Arizona’s immigration policy.[385] He also praised the anti-illegal immigration efforts of Kansas Secretary of State Kris Kobach, a law professor who had drafted much of Arizona’s SB 1070 immigration enforcement law and similar measures around the country. Campaigning with Kobach in January 2012, Romney said, “We need more conservative leaders like Kris willing to stand up for the rule of law. With Kris on the team, I look forward to working with him to take forceful steps to curtail illegal immigration and to support states like South Carolina and Arizona that are stepping forward to address this problem.”[386] When the Supreme Court struck down parts of Arizona's SB 1070 in June 2012, a Romney campaign spokesman said that Romney supports the rights of states to make their own immigration laws when the federal government has failed to address illegal immigration.[387]To help combat illegal immigration across the border with Mexico, Romney has said that the U.S. must erect a fence along the entire 2,600 mile border, equipped with technology to detect attempts to breach the barrier, and outfitted with adequate numbers of border patrol agents.[388]Romney also said during the primary campaign that he would seek to make the U.S. a much less hospitable place for undocumented immigrants by eliminating what he called the magnets that attract them.[388][389] An example of a magnet, he said, would be offering to undocumented immigrants the same tuition discounts that are offered to legal residents who attend public colleges in their states, a benefit that rival candidate Governor Rick Perry supported for Texas students who had been brought as children to the U.S. by their undocumented immigrant parents.[389] Romney similarly said that he opposed all forms of amnesty because he regards amnesty as another magnet for illegal immigration.[390] He vowed that as president he would veto the DREAM Act (legislation which would allow individuals who had been brought to the U.S. as children when their families immigrated illegally an opportunity to qualify for permanent residency if they met certain qualifications), because he considered it yet another magnet for illegal immigration.[391][392]Romney has argued that a key step to reducing illegal immigration would be to reduce the job opportunities available for undocumented immigrants. He has said that requiring employers to confirm each worker’s immigration status using an E-Verify-type database, such as in Arizona, and punishing employers who hire workers lacking proper documentation, would lead employers to stop hiring undocumented immigrants, with the result that fewer immigrants would choose to come to the U.S. illegally, and many of those who are already in the U.S. would \"self-deport.\"[393][394][395]In June 2012, President Obama issued an executive order instructing officers of the federal government to defer deporting young undocumented immigrants who had been brought to the U.S. as children and who met certain requirements, such as serving in the military or being successful students.[396] The executive order was intended to temporarily implement parts of the DREAM Act until a permanent fix could being agreed upon by Congress and the White House. When Romney was asked his opinion of the president's executive order, he responded by saying that he would reveal his own long-term policy on the subject at a later date.[397][398] Romney later said that he would respect the work permits that Obama had granted.[381]In terms of promoting more legal immigration, Romney has proposed loosening immigration rules to increase the entry of highly skilled immigrants into the U.S., allowing more high-skill visas to be granted and raising the quotas of high-skilled immigrants allowed from certain countries. Romney has noted that high-skilled immigrants are more likely to start companies and create jobs than other immigrants. He has said the U.S. should grant permanent residency to \"every foreign student who obtains an advanced degree in math, science, or engineering at a U.S. university.\" He has also proposed streamlining the temporary worker visa issuance system so that temporary agricultural and tourism workers could be processed more efficiently. He would seek to speed the processing of immigration applications for close family members of legal residents so that families do not have to wait years to be reunited.[399]"},"Medical marijuana[edit]":{"text":"Romney opposes legalization of marijuana for medicinal use at both the state and federal level.[400][401] He told attendees at a town hall forum in 2007, “I have the same position this week as I had last week: If you elect me President, I'm not going to allow legalization of marijuana. I'm going to fight it tooth and nail.\"[401]"},"Social welfare[edit]":{"text":"In 2005 Romney had joined a group of other governors in asking for additional flexibility in the way states could manage Temporary Assistance for Needy Families program funds and in January 2012 Romney called for increased state funding for child care so that the mothers of two-year-old children can \"have the dignity of work\".[402] However, in August 2012, he stated his opposition to Obama's plan to offer more flexibility to those states that move more people from welfare to work.[403][404]"},"text":"","Crime and punishment[edit]":{"text":"Romney supports sentencing under the three strikes law.[325][326][327] Romney supports mandatory increases in sentencing for repeat drunk drivers and has supported a federal effort to curtail the drug trade in Colombia.[108]As governor of Massachusetts, Romney sought to reinstate the state's death penalty,[328] which had been ruled unconstitutional by the state Supreme Judicial Court in 1982.[329] The legislation Romney proposed would have called for the death penalty in cases that included terrorism, the assassination of law enforcement officials, murders involving prolonged torture, or multiple killings. Under the proposed legislation, for a death sentence to be rendered there would have had to be scientific evidence of the defendant's guilt, such as evidence based on DNA analysis; and the tougher standard of \"no doubt\" of guilt (as opposed to the standard of proof \"beyond a reasonable doubt\" that is traditionally employed in criminal cases) would also have had to be met. The legislation called for a pool of certified capital case lawyers to ensure proper representation for the accused, and would have allowed citizens who do not personally support the death penalty to still serve as jurors in the pre-sentencing phase of trials, during which decisions are made on the defendants' guilt.[328] The bill was defeated in the Massachusetts House of Representatives by a vote of 100-53.[330]"},"Civil liberties[edit]":{"text":"Romney cites both Martin Luther King, Jr. and his father George Romney as role models.[287] In 2007, he stated he had seen the two men march together, but later recanted under pressure, stating he had 'seen' them march together only figuratively.[288][289][290][291]Romney has expressed support for decreasing barriers to entry into the workforce for women and minorities.[292]He has expressed support for Muslims who face discrimination due to their religion.[108]Speaking before The Heritage Foundation, a conservative think tank he consulted on policy issues, as governor of Massachusetts in 2005 Romney suggested that mosques should be wiretapped and foreign students should be placed under surveillance to improve domestic intelligence gathering in the fight against terrorism.[293] He refused to apologize or retract the remarks despite expressions of outrage by Muslims and civil libertarians.[294]As governor of Massachusetts, Romney eliminated the state’s Office of Affirmative Action.[295]Romney has not put forward a clear statement[296] as to whether he supports and would have signed, or would have opposed, the Lilly Ledbetter Fair Pay Act of 2009, which amends the Civil Rights Act of 1964 to require that employers prove that differences in pay are based on qualifications, not gender, and extends the statute of limitations for filing claims of wage discrimination.[297] The legislation was opposed by all but two Republicans in the House of Representatives and five in the Senate; and it was the first piece of legislation signed into law by President Obama. Asked in an April 2012 interview if he would have signed the bill had it come before him as president, Romney said, \"It’s certainly a piece of legislation I have no intention of changing. I wasn’t there three years ago.... I’m not going to go back and look at all the prior laws and say had I been there which ones would I have supported and signed, but I certainly support equal pay for women and — and have no intention of changing that law, don’t think there’s a reason to.”[298] After the topic of equal pay for women was touched on during the second presidential campaign debate between Romney and Obama in October 2012, a top Romney campaign advisor told reporters that Romney was opposed to the passage of the bill at the time but had no plan to repeal it.[299] The following day, the campaign adviser retracted his statement, saying that he was wrong when he said that Romney had been opposed to the act.[299]Prior to Romney's 2008 presidential campaign, he had a varied history regarding LGBT rights in the United States. During his 1994 senate campaign and 2002 Massachusetts gubernatorial campaign, Romney said he would have a better policy providing for domestic partnerships than his Democratic opponents.[300] In 1994, Romney sent a letter to the Log Cabin Republicans saying that he would be a stronger advocate for gay rights in the Senate than his opponent at the time, Senator Edward M. Kennedy. His letter included the phrase \"We must make equality for gays and lesbians a mainstream concern.\"[301] In 2002, Romney spoke regarding domestic partnership benefits, saying, \"All citizens deserve equal rights, regardless of their sexual orientation.\" Romney said that domestic partnership status should be recognized in a way that includes the potential for health benefits and rights of survivorship.[302][303]In 1994, Romney supported the Employment Non-Discrimination Act, a federal legislative proposal to prohibit discrimination based on sexual orientation or gender identity in the workforce, but by 2006 he had changed his mind and opposed it, saying that it would \"unfairly penalize employers at the hands of activist judges.\"[304]Romney supported Bill Clinton's \"Don't ask, don't tell\" policy in 1994, and continued to do so in 2007.[305][306] Romney said in 2007 that he thinks that the \"Don't ask, don't tell\" policy is working and he would not change it, especially in the middle of a war, and that \"we have much bigger issues as a nation that we ought to be talking about than that policy right now.\"[191]In December, 2011, Romney told the Des Moines Register that now that the \"Don't ask, don't tell\" policy has been repealed, \"I’m not planning on reversing that at this stage. I was not comfortable making the change during a period of conflict, due to the complicating features of a new program in the middle of two wars going on, but those wars are winding down, and moving in that direction at this stage no longer presents that problem.”[307]Romney has stated his support for straight marriage and opposition to both same-sex marriage and civil unions,[308] though he supports some domestic partnership benefits and (at the state level) supports anti-discrimination laws to protect gays and lesbians in the workplace.[309]As a candidate for governor in 2002, Romney said: \"Call me old fashioned, but I don't support gay marriage nor do I support civil union.\" During that 2002 campaign, he also supported hate crimes legislation and opposed other discrimination against gays, while supporting some partner benefits for gays.[310]Also in 2002, Romney opposed a Massachusetts constitutional amendment that would have banned same-sex marriage and domestic partnerships because the amendment, which was supported by the Democratic leader Tom Finneran, would have prohibited domestic partnership benefits for gays and lesbians.[311]Romney said,\"Basically I see the provision of basic civil rights and domestic partnership benefits [as] a campaign against Tom Finneran. I see Tom Finneran and the Democratic leadership as having opposed the application of domestic partnership benefits to gay and lesbian couples and I will support and endorse efforts to provide those domestic partnership benefits to gay and lesbian couples.\"[311]In November 2003, the Massachusetts Supreme Court ruled that the Massachusetts State Constitution requires that same-sex marriage be permitted under law; in response this time, Governor Romney supported a state constitutional amendment to forbid such marriages.[280]In 2006, Romney announced his support of the Federal Marriage Amendment, which would have federally defined marriage in the U.S. Constitution as the union of one man and one woman.[280][312][313]Romney said during his 2008 presidential campaign,[M]y view on marriage has been entirely consistent over my political career. And that is that I oppose same-sex marriage. I also oppose civil unions . . . ever since [same-sex marriage] became a prominent [feature] in my state, with the decision of the Supreme Judicial Court, I have taken every action that I could conceive of within the bounds of the law to defend traditional marriage and to stop same-sex marriage . . . I've been to Washington to testify in favor of traditional marriage. I've written a letter to every U.S. senator on the topic . . . I believe that traditional marriage is right for the nurturing and development of children, but that I do not want to discriminate against gay people in employment or housing or other parts of their life.[314]In July 2011, Romney refused to sign a pledge opposing gay marriage, a pledge that was being circulated by \"The Family Leader\", a conservative Christian group in Iowa.[315] On August 4, 2011, a month later, Romney signed the 2012 Presidential Pledge sponsored by the National Organization for Marriage.[316] He has expressed support for gay adoption.[317]Romney denounced the SOPA bill, agreeing to some extent with Newt Gingrich, Rick Santorum and Ron Paul, who oppose it also. Romney described the bill as \"intrusive\" and \"too expensive\".[318]Romney was against reviving the Fairness Doctrine, which required broadcasters to devote some of their airtime to discussing controversial matters of public interest, and to air contrasting views regarding those matters. Romney said, \"I'd veto it if it ever got to my desk. And I would fight against it vehemently. The effort to try to impose the Fairness Doctrine on radio stations is, if you will, censorship Democrat style. It basically says we're not going to let you keep talking about the things you want to talk about and the market wants to hear.\"[319]Romney has denounced what he calls the \"cesspool of obscenity known as pornography\".[320] At a commencement address before Regent University, the Evangelical Christian school founded by Pat Robertson, Romney said, \"Pornography and violence poison our music and movies and TV and video games.... The Virginia Tech shooter, like the Columbine shooters before him, had drunk from this cesspool.\"[320] In remarks to the Conservative Political Action Conference (CPAC) in 2008 Romney said that \"tolerance for pornography, even celebration of it, and sexual promiscuity, combined with the twisted incentives of government welfare, have led to today's grim realities: 68 percent of African-American kids born out of wedlock, 45 percent of Hispanic kids, 25 percent of white kids.\"[321]During his campaign for the 2008 Republican presidential nomination, Romney promised that if elected president he would work to have a pornography filter installed in every new computer sold in the U.S. so that parents could ensure their children would not be exposed to internet pornography.[322] He also said, \"I am not pursuing an effort to try and stop adults from being able to acquire or see things that I find objectionable—that's their right—but I do vehemently oppose practices or business procedures that will allow kids to be exposed to obscenity.\"[320] Speaking at the 2007 Iowa Republican Straw Poll convention, Romney said:\". . . I want to clean up the dirty water in which a lot of our kids are swimming, and by that I'm not just talking about pollution, I'm talking about moral pollution. I'm talking about what they see on TV and on the Internet. I'm concerned about the drug culture, I'm concerned about the pornography, the violence, the sex, the perversions that they see day in and day out. I want to make sure that every computer that goes into a home in the future, has a button there, or a place for the citizen, the parent, to be able to block all of that pornography from their kids' Internet screen.\"[245]Earlier in the campaign, conservatives such as Tony Perkins of the Family Research Council, the president of the American Family Foundation, and Daniel Weiss, media analyst for James Dobson's Focus on the Family had criticized Romney for not having done enough, in their view, to stop Marriott Hotels from selling access to hardcore pornography in their hotel rooms in the decade from 1992 to 2001 that Romney had served on the hotel chain's board.[320][323] Romney told the Associated Press that he did not recall pornography having come up for discussion while he had served on the board; and he said that he was unaware of how much revenue the hotels may have generated from pornography.[320]In the 2012 presidential campaign, Romney vowed to demand vigorous enforcement of anti-pornography laws if elected president.[324]"}}}