{"Environmental policy[edit]":{"text":"Nader favors environmental protection."},"Foreign policy[edit]":{"Israel/Palestinian territories[edit]":{"text":"Nader is an outspoken critic of Israeli foreign policy and backs the Israeli peace camp. On Meet the Press in early 2008, shortly after he had announced his candidacy for the 2008 presidential election, he also criticized Barack Obama's policy regarding the Israeli-Palestinian conflict,[1] to which the Republican Jewish Coalition responded by comparing Obama's pre-presidential record with Nader's views on the conflict.[2]"},"Defense and military[edit]":{"text":"Nader favors drastic cuts in both defense and military spending."},"text":"","Relations and views of other governments[edit]":{"text":"Nader is opposed to both the Afghan War and the Iraq War. He has stated that President Barack Obama's involvement in the Libyan Civil War is an impeachable offense."},"Cuba[edit]":{"text":"Nader favors reopening American negotiations with the Cuban government."}},"Constitutional policy[edit]":{"Voting[edit]":{"text":"Nader is in favor of national initiatives for direct democratic referenda at the federal level."},"text":"","Campaign finance[edit]":{"text":"Nader is a supporter of campaign finance reform, opposes the Citizens United decision, and has stated numerous times that corporations are not people."}},"Economic policy[edit]":{"Finance[edit]":{"text":"Nader supports a speculation tax in order to stem activity in the speculation market."},"Labor[edit]":{"text":"Nader endorses the repeal of the Taft–Hartley Act."},"text":"","Corporations[edit]":{"text":"Nader strongly supports the ending of corporate personhood, as he has not viewed corporations as entities worthy of the designation."}},"Social policy[edit]":{"Health care[edit]":{"text":"Nader is in favor of a national single-payer health care plan."},"Public safety[edit]":{"text":"He backed the National Maximum Speed Law as a safety measure.[3]"},"Civil rights[edit]":{"text":"Nader is a strong civil libertarian."},"text":""},"Energy policy[edit]":{"text":"Nader is against nuclear energy and in favor of the expansion of solar energy."}}