{"Civil liberties and democracy[edit]":{"Anti-terrorism and domestic surveillance[edit]":{"text":"Clinton voted for the USA PATRIOT Act in October 2001 when it was first enacted. In December 2005, when a political battle ensued over its renewal, Clinton supported a general filibuster against it, on the grounds that the renewal legislation did not appropriate enough money to New York for anti-terrorism efforts.[205] During the renewal debate she expressed some concerns with it regarding civil liberties.[206] She then voted in favor of a compromise renewed act in March 2006 that passed by an 89–10 margin.[207]Regarding the December 2005 NSA warrantless surveillance controversy, Clinton stated that she was \"troubled\" by President Bush's 2002 actions. In a statement, she said: \"The balance between the urgent goal of combating terrorism and the safeguarding of our most fundamental constitutional freedoms is not always an easy one to draw. However, they are not incompatible, and unbridled and unchecked executive power is not the answer.\"[208]"},"Executive authority[edit]":{"text":"Clinton's advisors have said that she believes that the \"president usually deserves the benefit of the doubt from Congress on matters of executive authority\".[228] In 2003, Clinton stated that she was \"a strong believer in executive authority,\" wishing that when her husband was president, Congress had been more willing to recognize presidential authority.[229]"},"Voting rights[edit]":{"text":"In a June 2015 speech at Texas Southern University, a historically black college, in Houston, Texas,[201] Clinton called for sweeping changes in national voter access laws, including automatically registering American citizens to vote at age 18 and mandating 20 days of early voting in all states.[202] Clinton said: \"Today Republicans are systematically and deliberately trying to stop millions of American citizens from voting. What part of democracy are they afraid of?\"[202] Clinton alleged that Republican efforts to limit voter registration have a disproportionate impact on \"people of color, poor people and young people.\"[202]In 2013, Clinton gave a speech to the American Bar Association, in which she \"slammed the Supreme Court's Shelby County ruling that year weakening the Voting Rights Act (VRA), called on Congress to fix the landmark law and urged the Obama administration to step up enforcement of voting rights cases.\"[203]"},"Habeas corpus[edit]":{"text":"Clinton \"vigorously opposed\" and voted against the Military Commissions Act of 2006, which changed the law to explicitly forbid the invocation of the Geneva Conventions when executing the writ of habeas corpus or in other civil actions. Clinton called the act \"deeply troubling\" and said: \"Our Nation must not indefinitely detain anyone without safeguards to ensure we are holding the right person. This is one of the bedrock principles enshrined in our Constitution; it is the way our Founders believed we could be secure against those who would abuse government power. I believe we do not have to abandon our constitutional principles or our values as Americans in the name of fighting terrorism.\"[209][210]Clinton was a co-sponsor of the Habeas Corpus Restoration Act in 2007.[211]"},"text":"The American Civil Liberties Union has given her a 75 percent lifetime rating through September 2007.[200]","Flag desecration[edit]":{"text":"Clinton supports making flag desecration illegal, but without adopting the constitutional Flag Desecration Amendment to do so.[212][213]Clinton introduced the Flag Protection Act of 2005. The bill (which was never enacted) called for a punishment of one year in jail, and a fine of $100,000.[214][215]"},"Electoral college[edit]":{"text":"In November 2000, Clinton called for a Constitutional amendment to abolish the Electoral College, replacing it with a national popular vote, saying \"we are a very different country than we were 200 years ago.... I believe strongly that in a democracy, we should respect the will of the people.\"[227]"},"Government secrecy[edit]":{"text":"Reacting to whistleblower site WikiLeaks and the 2010 U.S. diplomatic cables release, Clinton expressed her condemnation of any disclosure that puts lives at risk and threatens national security.[230]"},"Americans with disabilities[edit]":{"text":"Clinton's campaign website page concerned with disability rights issues states a serious concern for disabled Americans to have \"meaningful and gainful employment,\" and adds, \"Now, 25 years after the passage of the Americans with Disabilities Act … there is still much work to do, including improving access to meaningful and gainful employment for people with disabilities. Too many Americans with disabilities continue to be left out of the workforce, and for those who are employed, too many are in under-stimulating jobs that don't fully allow them to use their talents.\"[204]"},"Gun control[edit]":{"text":"In the 1999 Proposition B in Missouri campaign, which would have allowed concealed carry of firearms in the state, Clinton's voice was used in a robocall message aimed at women, saying \"It's just too dangerous for Missouri families.\"[216]In 2009, Clinton called for renewal of the expired federal assault weapons ban.[217]In a 2014 interview with CNN[218] Clinton expressed support for reinstating the federal assault weapons ban, and made the following statement in response to a question on gun control. \"I'm well aware that this is a hot political subject. And again, I will speak out no matter what role I find myself in. But I believe that we need a more thoughtful conversation. We cannot let a minority of people -- and that's what it is, it is a minority of people -- hold a viewpoint that terrorizes the majority of people.\"Clinton favors \"sensible gun control legislation\" and not limiting gun control lawsuits.[219] She made gun licensing and registration a part of her 2000 Senate campaign.[220]Clinton was one of 16 Senators who voted against the 2006 Vitter Amendment, which prohibits the funding of the confiscation of lawfully-held firearms during a disaster.[221]Clinton was taught to shoot and hunt by her father. Clarifying her position on gun rights, she said \"It's part of culture. It's part of a way of life. People enjoy hunting and shooting because it's an important part of who they are.\"[222] She made gun rights a part of her 2008 Presidential campaign, despite her previous attempts to introduce strict gun-control laws at a federal level.[223][224][225]The National Rifle Association gave Clinton an \"F\" rating in 2006.[226]"}},"Political philosophy[edit]":{"Scales and rankings[edit]":{"text":"Clinton's Crowdpac score is -6.4 on a left-right scale, where -10 is the most liberal and 10 is the most conservative. The score is based on a data aggregation of campaign contributions, votes, and speeches. This places her slightly right to rival Bernie Sanders by 1.7 points and matches Barack Obama's score of -6.4.[6]Clinton is rated a \"Hard-Core Liberal\" according to the OnTheIssues.org scale, which is based on her public statements on social and economic issues.[7] She is rated more liberal than Barack Obama, \"as liberal as Elizabeth Warren and barely more moderate than Bernie Sanders\".[8]Clinton \"was the 11th most liberal member of the Senate\" according to DW-NOMINATE, a multidimensional scaling method based on legislative votes.[9]Clinton's lifetime rating from the American Conservative Union (based on Senate votes) is 8.13%, similar to that of Senator Bernie Sanders (I-VT) and Senator Elizabeth Warren (D-MA), and lower than that of President Barack Obama's rating while he served in the Senate.[10]Bruce Reid, a co-founder of the Democratic Leadership Council, disagreed with an interviewer who said Clinton was at the liberal end of the Democratic Party: \"Well, I wouldn't say that. ... I've known her for 15 years and she's a Clinton Democrat from the get-go. She's always been quite culturally conservative. I worked with her on welfare reform. … She's always been a budget hawk.\"[11]"},"As described by herself[edit]":{"text":"In her 1996 book It Takes A Village, Clinton writes, \"Most of us would describe ourselves as 'middle of the road'—liberal in some areas, conservative in others, moderate in most, neither exclusively pro- nor anti-government.\"[3]At the CNN/YouTube Democratic primary debate in June 2007, in response to the question of whether she would describe herself as a liberal, Clinton said: \"I consider myself a modern progressive, someone who believes strongly in individual rights and freedoms, who believes that we are better as a society when we're working together and when we find ways to help those who may not have all the advantages in life get the tools they need to lead a more productive life for themselves and their family. So I consider myself a proud modern American progressive, and I think that's the kind of philosophy and practice that we need to bring back to American politics.\"[4]In a September 2015 Women for Hillary event, Clinton said, \"You know, I get accused of being kind of moderate and center. I plead guilty.\"[5]"},"text":""},"Foreign policy[edit]":{"Homeland security[edit]":{"text":"On December 8, 2004, in a speech regarding the passage of the Intelligence Reform and Terrorism Prevention Act (IRTPA) of 2004, Senator Clinton delivered remarks on her approach to homeland security. \"[This] legislation calls for dramatic improvements in the security of our nation's transportation infrastructure, including aviation security, air cargo security, and port security. Through this legislation, the security of the Northern Border will also be improved, a goal I have worked toward since 2001. Among many key provisions, the legislation calls for an increase of at least 10,000 border patrol agents from Fiscal Years 2006 through 2010, many of whom will be dedicated specifically to our Northern Border. There will also be an increase of at least 4,000 full-time immigration and customs enforcement officers in the next 5 years.[173]Later in the speech, Clinton described her satisfaction with the way in which IRTPA tackles what she views as the root causes of terrorism by improving education around the world and establishing schools in Muslim countries that will replace the current madrassas.I am also pleased that the legislation addresses the root causes of terrorism in a proactive manner. This is an issue that I have spent a good deal of time on in the past year because I believe so strongly that we are all more secure when children and adults around the world are taught math and science instead of hate. The bill we are voting on today includes authorization for an International Youth Opportunity Fund, which will provide resources to build schools in Muslim countries. The legislation also acknowledges that the U.S. has a vested interest in committing to a long-term, sustainable investment in education around the globe. Some of this language is modeled on legislation that I introduced in September, The Education for All Act of 2004, and I believe it takes us a small step towards eliminating madrassas and replacing them with schools that provide a real education to all children.[173]Clinton has sponsored and co-sponsored several bills relating to protecting Americans from acts of terrorism,[174][175] as well as providing assistance to the victims of such acts.[176]"},"Syria and fight against ISIL[edit]":{"text":"Clinton advocated for arming the moderate rebels in the Syrian Civil War, saying that \"the failure to help build up a credible fighting force of the people who were the originators of the protests against Assad ... left a big vacuum, which the jihadists have now filled.\"[188]On the American-led military actions against ISIL in Syria, Clinton advocates going further than what President Obama has done, calling for \"an intensification and acceleration\" of U.S. airstrikes and expanded deployment of U.S. special operations troops on the ground to assist local forces.[189] Clinton has also proposed a no-fly zone in northern Syria, enforced by the U.S. and allies, that would provide a humanitarian buffer zone (or \"safe haven\") that would protect civilians fleeing the Assad regime and ISIL.[189][190] Clinton has also called upon the Arab states of the Persian Gulf to stop funding terrorist groups, saying: \"Once and for all, the Saudis, the Qataris and others need to stop their citizens from directly funding extremist organizations.\"[189]Following the 2016 Brussels bombings, Clinton said: \"We need to work with the brightest minds of Silicon Valley to more effectively track and analyze ISIS' social media and map jihadists' networks online.\"[191]"},"Arab-Israeli conflict, relations with Israel[edit]":{"text":"Regarding the Arab-Israeli conflict, Clinton has stated that she is \"an emphatic, unwavering supporter of Israel's safety and security.\"[123]On July 18, 2006, Clinton spoke at a pro-Israel rally in New York in front of the United Nations. She supported Israel's efforts in the 2006 Israel-Lebanon conflict: \"We are here to show solidarity and support for Israel. We will stand with Israel, because Israel is standing for American values as well as Israeli ones.\"[124]On November 13, 2005, Clinton said that she supports the creation of the West Bank barrier, stating: \"This is not against the Palestinian people. This is against the terrorists. The Palestinian people have to help to prevent terrorism. They have to change the attitudes about terrorism.\"[125] She has also requested that Palestinian leaders \"change all textbooks in all grades\" from the current ones, which are \"hate-filled, violent and radical.\"[126][127][128][129]As a senator and throughout her career, Clinton has said that she regards Jerusalem as the \"eternal and indivisible capital of Israel,\" and Clinton supported legislation requiring the U.S. government to identify Jerusalem as the capital of Israel and move the U.S. Embassy to Israel from Tel Aviv to Jerusalem (the Jerusalem Embassy Act).[130][131][132] In 2011, as Secretary of State, Clinton filed a brief with the U.S. Supreme Court in the case of Zivotofsky v. Clinton, involving an act of Congress requiring that U.S. passports for persons born in Jerusalem read \"Jerusalem, Israel\" (rather than \"Jerusalem\") under place of birth.[132] Consistent with the U.S.'s policy of the last 60 years recognizing no state as having sovereignty over Jerusalem,[133] Clinton's brief argued that \"any American action, even symbolically, toward recognizing Jerusalem as the capital of Israel\" might have an influence on the Israeli-Palestinian peace process.[132] The Supreme Court subsequently struck down the passport law on separation-of-powers grounds, holding that Congress had intruded upon the president's constitutional power to recognize foreign states.[133]During an interview while the 2014 Israel–Gaza conflict was ongoing, Clinton said that Hamas had intentionally provoked Israel by firing rockets into that country. In regard to whether Israel's response against Hamas had been proportionate, she said, \"I'm not a military planner, but Hamas puts its missiles – its rockets – in civilian areas. Part of it is that Gaza's pretty small and it's very densely populated. They put their command and control of Hamas military leaders in those civilian areas. Israel, I know, has sent warnings and tried to get people to move, but in any kind of conflict there are going to be civilian casualties, and we need to try to get to a cease-fire as soon as possible.\"[134]"},"Humanitarian intervention abroad[edit]":{"text":"As first lady, Clinton said, \"I am very pleased that this president and administration have made democracy one of the centerpieces of our foreign policy.\" Hillary Clinton favored intervention in Haiti (1994), the Bosnian War (1995), as well as in the Kosovo War (1999). Before the Kosovo war, she phoned Bill Clinton from Africa. As she recalled later, \"I urged him to bomb\", arguing that Bill Clinton could not let the massacres in Kosovo \"go on at the end of a century that has seen the major holocaust of our time.\"[177]In a February 2005 speech at the annual Munich Conference on Security Policy, Clinton expressed regret that the international community had failed to effectively intervene in the 1990s during the Rwandan Genocide and early in the Bosnian War. She praised the United Nations and NATO interventions that did occur later in the Bosnian War (leading to the Dayton Agreement), Kosovo War, and East Timor. Regarding the ongoing large-scale killing in the Darfur conflict, she then advocated \"at least a limited NATO role in logistics, communication and transportation in Darfur in support of the African Union.\"[178]During the July 2007 CNN/YouTube Democratic debate in South Carolina, Clinton was characterized by The Chicago Tribune as against U.S. military intervention. Asked again whether U.S. troops should be sent to Darfur, Clinton focused on \"...sanctions, divestment and UN peacekeepers.\" When pressed with the question, \"How about American troops on the ground?\" she said, \"American ground troops I don't think belong in Darfur at this time.\"[179]"},"Libya[edit]":{"text":"Clinton reportedly played a key role in persuading Obama to militarily intervene in Libya during the Libyan Civil War,[180] and deemed it worthwhile to intervene due to fears of further atrocities by Libyan dictator Muammar Gaddafi, a unified European-Arab front in favor of intervention and a belief that the Libyan opposition could govern in the aftermath of an intervention.[180] After the conclusion of the Libyan Civil War and the demise of Gaddafi, there remained factional violence in Libya until it erupted into renewed civil war in 2014. Terrorist groups have taken refuge in Libya, and large numbers of refugees have fled to neighboring countries and across the Mediterranean.[181] When asked to defend her record on Libya, Clinton called it \"a classic case of a hard choice\" and found that the overthrow of Gaddafi represented \"smart power at its best.\"[181]Clinton has said that history's judgment on the intervention, and her role in it, are not yet final. In November 2015, she said to the Council on Foreign Relations that \"the Libyan people have voted twice in free and fair elections for the kind of leadership they want. They have not been able to figure out how to prevent the disruptions that they are confronted with because of internal divides and because of some of the external pressures that are coming from terrorist groups and others. So I think it's too soon to tell. And I think it's something that we have to be, you know, looking at very closely.\"[182]"},"Armenian Genocide[edit]":{"text":"During her time in the Senate, Clinton was a co-sponsor of the Armenian Genocide Resolution, and as senator twice wrote to President Bush calling on him to refer to the Armenian Genocide in his annual commemorative statement.[185][186] (The use of the word \"genocide\" is contested by the government of Turkey.)[186] In 2008 (the year Clinton unsuccessfully sought the Democratic nomination for president), Clinton stated that \"I believe the horrible events perpetrated by the Ottoman Empire against Armenians constitute a clear case of genocide.\"[186]As secretary of state under Obama, Clinton shifted her position on the atrocity; consistent with administration policy, neither Clinton nor the Department of State used the word genocide, which angered Armenians and the Armenian National Committee of America.[186][187] At a State Department event in January 2012, Clinton stated that the atrocity \"has always been viewed, and I think properly so, as a matter of historical debate\" causing \"high emotions\" and \"that is the right posture for the United States Government\" to avoid using the word.[186]After leaving office as secretary of state, Clinton used the term genocide; a Clinton aide told Newsweek in April 2015 that \"Hillary Clinton has a record of expressing her own view that this was a genocide.\"[186]"},"Iraq War[edit]":{"text":"On October 11, 2002, Clinton voted in favor of the Authorization for Use of Military Force Against Iraq, commonly known as the Iraq War Resolution, to give President Bush authority for the Iraq War.[147] In an interview on December 18, 2006, she expressed regret for the vote: \"Obviously, if we knew then what we know now, there wouldn't have been a vote, and I certainly wouldn't have voted for it.\"[148] By February 2007, Clinton failed to state that her vote was a mistake, or to apologize for it, as anti-war Democrats demanded. \"If the most important thing to any of you is choosing someone who did not cast that vote or has said his vote was a mistake, then there are others to choose from,\" Clinton told an audience in Dover, New Hampshire.[149]In the second Democratic debate of the 2008 presidential race, Clinton said that she voted for the resolution under the impression that Bush would allow more time for UN inspectors to find proof of weapons of mass destruction before proceeding. Reporter Carl Bernstein and others have questioned why Clinton would have voted against the Levin Amendment, which would have required President Bush to allow more time to UN weapons inspectors and also would have required a separate Congressional authorization to allow a unilateral invasion of Iraq, if her vote was simply a vote for strong diplomacy.[150][151][152]During an April 20, 2004 interview on Larry King Live, Clinton was asked about her October 2002 vote in favor of the Iraq war resolution.Obviously, I've thought about that a lot in the months since. No, I don't regret giving the president authority because at the time it was in the context of weapons of mass destruction, grave threats to the United States, and clearly, Saddam Hussein had been a real problem for the international community for more than a decade.... The consensus was the same, from the Clinton administration to the Bush administration. It was the same intelligence belief that our allies and friends around the world shared.But, she said, the Bush Administration \"really believed it. They really thought they were right, but they didn't let enough sunlight into their thinking process to really have the kind of debate that needs to take place when a serious decision occurs like that.\"[153]In a November 29, 2005 letter to her constituents, Senator Clinton said, \"There are no quick and easy solutions to the long and drawn out conflict [the Bush] Administration triggered … I do not believe that we should allow this to be an open-ended commitment without limits or end. Nor do I believe that we can or should pull out of Iraq immediately.\"[154]On June 8, 2006, Clinton said of the US airstrike that killed Abu Musab al-Zarqawi: \"I saw firsthand the terrible consequences of Zarqawi's terrorist network when Bill, Chelsea and I visited the hotel ballroom in Amman, Jordan last November where Zarqawi's followers had detonated a bomb at a wedding, killing and wounding innocent people. We owe our thanks to our men and women in uniform and others in Iraq who have been fighting Zarqawi and other insurgents and who are responsible for today's success.\"[155]In a speech on June 13, 2006, Clinton sharply criticized President George W. Bush's handling of the Iraq War,[156] saying that Bush \"rushed to war\" and \"refused to let the UN inspectors conduct and complete their mission … We need to be building alliances instead of isolation around the world ... There must be a plan that will begin to bring our troops home.\"[157] In the same speech, however, Clinton reiterated her longstanding opposition to a timeline for U.S. withdrawal, saying: \"I do not think it is a smart strategy either for the president to continue with his open-ended commitment which I think does not put enough pressure on the Iraqi government, nor do I think it is a smart policy to set a date certain.\"[156][157]Clinton opposed the Iraq War troop surge of 2007 and supported a February 2007 non-binding Senate resolution against it, which failed to gain cloture.[158] On February 5, 2007, Clinton said: \"Believe me, I understand the frustration and the outrage … You have to have 60 votes to cap troops, to limit funding to do anything. If we in Congress don't end this war before January 2009, as president, I will.\"[159] On February 17, 2007, Hillary Clinton announced the Iraq Troop Protection and Reduction Act of 2007.[160] This act would compel President Bush to begin relegating troops from Iraq within 90 days of remote passage, or, according to Clinton, Congress would have to dismantle their authorization for the war. The Act would also end the blank check to the Iraqi government and submit them to harsh consequences if boundaries are violated. Lastly, the Act would require the Secretary of Defense to verify the condition, in terms of supplies and in terms of their training, of all Iraqi troops before they are sent.[161]In March 2007 she voted in favor of a war spending bill that required President Bush to begin withdrawing troops from Iraq within a certain deadline; it passed almost completely along party lines[162] but was subsequently vetoed by President Bush.In May 2007, Clinton was one of only 14 senators to vote against a compromise war funding bill that removed previously vetoed withdrawal deadlines but tied funding to progress benchmarks for the Iraqi government. She said, \"I fully support our troops [but this measure] fails to compel the president to give our troops a new strategy in Iraq.\"[163]While calling for ending the war in Iraq, Clinton's indicated in July 2007 that she advocates keeping a reduced number of U.S. troops in Iraq for the foreseeable future, stating \"we cannot lose sight of our very real strategic national interests in this region.\"[164] In the speech, she posited redeploying U.S. forces to protect the Kurdish region in the north, to engage in targeted operations against al-Qaeda in Iraq, and to train and equip Iraqi forces.[164] Clinton's position is similar to that of the Iraq Study Group in that she highlights the need for political reconciliation in Iraq, supports the withdrawal of U.S. combat brigades, and favors keeping a reduced number of troops to serve in training and support roles such as protection of the U.S. Embassy.[164]On August 22, 2007, Clinton credited the troop surge and related new tactics with helping to produce the Anbar Awakening in Al Anbar Governorate,[165] but said that overall the increase in troops had not met stated goals: \"The surge was designed to give the Iraqi government time to take steps to ensure a political solution. It has failed.\"[165] Furthermore, Clinton, following the lead of Senate Armed Services Committee chair Carl Levin, called on the Iraqi Parliament to replace Nouri al-Maliki as Prime Minister of Iraq with \"a less divisive and more unifying figure,\" saying that Maliki had failed to make progress in bridging differences between the hostile factions within Iraq: \"Iraqi leaders have not met their own political benchmarks to share power, modify the de-Baathification laws, pass an oil law, schedule provincial elections, and amend their constitution.\"[166] (Four days later, Maliki responded angrily to the suggestion, saying, \"There are American officials who consider Iraq as if it were one of their villages, for example Hillary Clinton and Carl Levin. This is severe interference in our domestic affairs. Carl Levin and Hillary Clinton are from the Democratic Party and they must demonstrate democracy. I ask them to come to their senses and to talk in a respectful way about Iraq.\"[167])In an open letter to President Bush dated November 17, 2007, Clinton stated \"The President must make it crystal clear that the United States will not maintain permanent bases in Iraq...\" \"They would damage U.S. interests in Iraq and the broader region, and I will continue to strongly oppose them.\"[168]By late November 2007, with still more evidence that the surge and other tactics and developments had led to a significant lessening of the civil violence in Iraq,[169] Clinton acknowledged the successes but said that the underlying equation had not changed: \"Our troops are the best in the world; if you increase their numbers they are going to make a difference. The fundamental point here is that the purpose of the surge was to create space for political reconciliation and that has not happened, and there is no indication that it is going to happen, or that the Iraqis will meet the political benchmarks. We need to stop refereeing their civil war and start getting out of it.\"[170]At the January 16, 2008 Democratic debate in Las Vegas, Clinton, along with Senators Barack Obama and John Edwards, maintained that they cannot guarantee the removal of all U.S. troops by the end of their first presidential term due to continuing support roles. All three pledged to begin the withdrawal of combat brigades within 60 days of taking office. Additionally, Clinton used the opportunity to ask Senator Obama to co-sponsor legislation to prevent President Bush from signing long-term agreements with the government of Iraq without the express consent of congress, stating: \"So I've introduced legislation that clearly requires President Bush to come to the United States Congress. It is not enough, as he claims, to go to the Iraqi parliament, but to come to the United States Congress to get anything that he's trying to do, including permanent bases, numbers of troops, all the other commitments he's talking about as he's traveling in that region.\"[171]"},"Security vs. human rights[edit]":{"text":"On November 15, 2007, when asked \"[is] national security more important than human rights?\" Clinton responded, \"I agree with that completely. The first obligation of the president of the United States is to protect and defend the United States of America. That doesn't mean that it is to the exclusion of other interests. And there's absolutely a connection between a democratic regime [in Pakistan] and heightened security for the United States.\"[183]"},"Russia and Ukraine[edit]":{"text":"As secretary of state, Clinton oversaw the completion of the New START nuclear arms control treaty between the United States and Russia, and successfully pushed for its ratification.[196][197]This was part of Clinton's broader role in the 2009 \"reset\" of U.S.-Russia relations. Clinton defended the \"reset\" in 2014, saying that the signing of the New START treaty, enhanced sanctions on Iran and the securing of supply lines to American troops in Afghanistan were all successes that came from the reset.[198]After cooling of U.S.-Russia relations due to Russia's annexation of Crimea and support of separatists in eastern Ukraine Clinton said that Russian president Vladimir Putin can be dangerous, his latest aggression in Ukraine must be answered with a joint reaction by the West.[199]"},"text":"","Cuban embargo[edit]":{"text":"In 2014, Clinton expressed her support for lifting the embargo on Cuba, describing it as \"Castro's best friend.\" This was a shift from her earlier views. In 2000, Clinton said she was \"not ready to vote to lift the embargo\", insisting that \"Castro should make some good faith show of moving toward ending repression, freeing political prisoners and some steps toward democratization.\"[172] She held the same view for the same reasons in 2008.[172] In Hard Choices, Clinton claimed that near the end of her tenure as Secretary of State that she recommended that Obama review the Cuban embargo, as it was not achieving its goals and might have been counterproductive.[172]"},"United Nations[edit]":{"text":"On February 13, 2005, at the Munich Conference on Security Policy, Senator Clinton outlined her support for a strong United Nations:My first observation is simple but it must govern all that we do: The United Nations is an indispensable organization to all of us – despite its flaws and inefficiencies. This means quite simply, that everyone here today, and governments everywhere, must decide that our global interests are best served by strengthening the UN, by reforming it, by cleaning up its obvious bureaucratic and managerial shortcomings, and by improving its responsiveness to crises, from humanitarian to political. […] At its founding in San Francisco sixty years ago, fifty members signed the Charter. Today, the UN has 191 members, and, quite frankly, many of them sometimes act against the interests of a stronger UN, whether consciously or not, with alarming regularity. Since the UN is not, in the final analysis, an independent hierarchical organization, like for example a sports team or a corporation, but no more – or less – than a collection of its members, the UN becomes progressively weakened by such action. Ironically, 'the UN' – an abstraction that everyone from journalists to those of us in this room use in common discussions – is often blamed for the actions (or inactions) of its members.[184]Clinton has co-sponsored a Senate resolution \"expressing the sense of the Senate on the importance of membership of the United States on the United Nations Human Rights Commission.\""},"Iran[edit]":{"text":"Hillary Clinton has described Iran as a long-term strategic challenge to the United States, its NATO allies, and Israel. In 2006, she called for sanctions to deter Iran from obtaining nuclear weapons[135] and said: \"We cannot take any option off the table in sending a clear message to Iran that they will not be permitted to acquire nuclear weapons.\"[136] In 2007, she accused Iran of state-sponsored terrorism and using its surrogates to supply explosives that kill U.S. troops in Iraq. She criticized the Bush administration for refusing to talk to Iran about its nuclear program; meanwhile, Iran allegedly enhanced its nuclear-enrichment capabilities.[137]On September 26, 2007, Clinton voted for a symbolic non-binding amendment to label the Army of the Guardians of the Islamic Revolution as a \"foreign terrorist organization,\" and to use diplomatic economic, intelligence economic, and U.S. military \"instruments\" to enforce U.S. policy against Iran and \"its proxies\" within Iraq.[138] Clinton insisted that she continued to support vigorous diplomacy with Iran, defending her vote by saying Iranian arms shipments to Iraq have slowed down since the Senate resolution passed. But her Democratic opponents criticized her for contributing to what they said was Bush administration saber rattling on Iran.[139]In October 2007, Clinton cosponsored a bill prohibiting the use of funds for military action in Iran without \"explicit Congressional authorization.\" That bill has not yet been voted on.[139]On April 22, 2008, Clinton threatened Iran with nuclear annihilation if they attacked Israel with nuclear weapons. On ABC News' Good Morning America, she said, \"If Iran were to launch a nuclear attack on Israel what would our response be? I want the Iranians to know that if I'm the president, we will attack Iran. That's what we will do. There is no safe haven.\" She continued, \"Whatever stage of development they might be in their nuclear weapons program in the next 10 years during which they may foolishly consider launching an attack on Israel, we would be able to totally obliterate them.\"[140]During Clinton's tenure as Secretary of State, \"upping sanctions on Iran was a clear priority.\"[141] Clinton was personally involved in the U.S. State Department's successful efforts to convince other nations, including Russia and China, to rapidly ramp up international sanctions against Iran.[141] Clinton also successfully secured the passage of United Nations Security Council Resolution 1929 in June 2010, which added strict new sanctions on Iran, including an arms embargo and limits on the country's financial and shipping activities.[141] The sanctions imposed on Iran by the U.S. during Clinton's tenure are generally regarded as one of several factors that compelled Iran to go to the negotiating table over its nuclear program.[141]According to experts, \"Clinton's team also played a role in the sanctions that Congress passed\" during Clinton's tenure, although \"Congress did pass some sanctions that went further than the administration's wishes.\"[141] One such measure, placing sanctions on the Iran's central bank, was enacted by Congress and signed into law by President Obama over the objections of State Department officials.[142] The State Department ultimately implemented it, although it issued waivers from the sanctions for several countries, prompting criticism from some lawmakers and advocacy groups.[142]During her 2008 election campaign, Clinton criticized Obama for being willing to negotiate with Iran without preconditions.[143] As Secretary of State, Clinton helped arrange secret lower-level talks with the nation in 2012 and in 2013.[143] After resigning as Secretary of State, she stated that negotiations were the most likely way for the US to influence the country's nuclear development.[144]On April 2, 2015, Clinton confirmed her support for an agreement to lift economic sanctions on Iran in exchange for limits on the country's nuclear program, calling it \"an important step\" in controlling the nation's security.[145] In January 2016, Clinton said, \"I'm very proud of the Iran Nuclear Agreement. I was very pleased to be part of what the president put into action when he took office. I was responsible for getting those sanctions imposed which put the pressure on Iran. It brought them to the negotiating table which resulted in this agreement. But I think we still have to carefully watch them.\"[146]"},"NATO and U.S. relations with allies[edit]":{"text":"Clinton has also criticized the \"inflammatory rhetoric\" of Ted Cruz and Donald Trump, adding that Trump's proposal to build a wall on the U.S.–Mexico border and his proposed ban on Muslims entering the United States and harm the security of the United States and the world as a whole. Clinton added that Trump's suggestion for the U.S. to withdraw from involvement in the North Atlantic Treaty Organization would benefit the Russian government, saying in an address at Stanford University that: \"If Mr. Trump gets his way, it will be like Christmas in the Kremlin.\"[192] Clinton added that \"Putin already hopes to divide Europe.\"[193] Clinton has said that the U.S.'s partnerships through NATO have been one of the best security investments made by the United States.[194]Clinton has stressed the role of international alliances and coordination in counterterrorism efforts,[194] saying in March 2016 that \"We need our allies as much as ever\" and adding that these alliances provide the United States and Europe with a strategic advantage over nations such as China or Russia.[195]"}},"Economic policy[edit]":{"Fiscal policy and taxation[edit]":{"text":"According to Vox, Clinton was more liberal on economic issues than President Obama and former-president Bill Clinton, and had a more liberal voting record than Obama when they both served in the United States Senate.[12]In a May 2016 report, the Committee for a Responsible Federal Budget (CRFB) estimated that Clinton's \"proposals would cost $1.80 trillion over a decade with interest, and they would be nearly fully paid for with $1.60 trillion of offsets – primarily from taxes on high earners.\"[13] Among the major initiatives proposed by Clinton are the enactment of the \"New College Compact\"; an expansion of the Affordable Care Act; an expansion of early childhood education and paid family leave; increased spending on infrastructure, increased funding for veterans, and expanded research funding.[13] The CRFB concluded that \"Secretary Clinton's policies would not substantially add to current law debt levels\" but would keep debt at historically high post-war levels, which are currently on track to increase from 74% of GDP in 2015 to 86% in 2026.[13] A December 2015 analysis by McClatchy newspapers similarly concluded that Clinton's proposals \"would cost at least $1.1 trillion over 10 years as she looks to pump billions of additional dollars into reducing college costs, increasing treatment for drug addiction and helping employers pay for mandatory family and sick leave,\" mostly offset by new revenue.[14]During her 2016 campaign for the presidency, Clinton has pledged not to raise taxes on working and middle-class families, defined as those with annual incomes below $250,000. Clinton's pledge has been controversial within the Democratic Party.[15][16] Clinton supports taxes on sugary drinks, a policy opposed by Clinton's primary rival, Senator Bernie Sanders, who opposes such taxes and contends that they would violate Clinton's pledge not to raises taxes of families with incomes below $250,000.[17]A March 2016 analysis by the Urban-Brookings Tax Policy Center summarized Clinton's tax proposals as follows: \"Hillary Clinton proposes raising taxes on high-income taxpayers, modifying taxation of multinational corporations, repealing fossil fuel tax incentives, and increasing estate and gift taxes. Her proposals would increase revenue by $1.1 trillion over the next decade. Nearly all of the tax increases would fall on the top 1 percent; the bottom 95 percent of taxpayers would see little or no change in their taxes. Marginal tax rates would increase, reducing incentives to work, save, and invest, and the tax code would become more complex. The analysis does not address a forthcoming proposal to cut taxes for low- and middle-income families.\"[18] Clinton specifically has proposed a 4% surcharge on taxpayers earning over $5 million a year; a 30% minimum tax rate on millionaires, defined as those with adjusted gross incomes above $1 million (the \"Buffett Rule\"), a 28% cap on most deductions, and increased taxes on long-term capital gains. The proposal also increases several business taxes, and seeks to penalize excessive risk-taking in the financial sector while at the same time creating incentives for business programs that would help workers and communities in distress.[19][20] The Tax Policy Center estimates that Clinton's plan, on average; would: leave the poorest earners' taxes essentially unchanged; increase middle-income households' taxes by $44 (a 0.001% change); increase the top 1%'s taxes by $78,000; and increase the top 0.1%'s taxes by $520,000.[19]Clinton has proposed a number of new tax credits.[21] Clinton has proposed a new caregiver tax credit of up to $1,200.[19][21] Clinton has also proposed a tax credit for up to $5,000 per family to those paying out-of-pocket healthcare costs in excess of 5 percent of their annual income[22] and a tax credit aimed at families paying for college.[21]In December 2015, Clinton outlined a plan to crack down on the use of corporate tax inversions.[23][24] Clinton specifically criticized Pfizer's plan to make use of the controversial tax-avoidance manuveur by means of its proposed merger with Allergan.[23][24] Richard Phillips, senior policy analyst at Citizens for Tax Justice, praised Clinton for her support for limiting inversions (which he described as \"a loophole through which U.S. companies pretend to be foreign in order to avoid taxes\"), but criticized her proposal to use the new revenue to reduce corporate taxes, arguing that the revenue should go toward public investments or deficit reduction instead.[25]Howard Gleckman, senior fellow at the Tax Policy Center, said that Clinton's proposals \"would make the tax code more complex, especially for high-income households, and would reduce incentives to work, save, and invest.\"[26]The conservative Tax Foundation estimated in January 2016 that, in the long term, the plan would decrease economic growth by 1%, wages by 0.8% and jobs by 311,000.[20][27] The Tax Foundation estimates an increase in revenues of $498 billion, but applied dynamic scoring analysis to that figure and reduced it to $191 billion due to weaker economic growth.[20][27] The Clinton campaign \"said the Tax Foundation's analysis is misleading and doesn't take into account her tax relief for businesses and individuals, nor her investments that would promote growth.\"[20]In a 2005 fund-raising speech in San Francisco, she was highly critical of the George W. Bush tax cuts, saying that \"Many of you are well enough off that … the tax cuts may have helped you. We're saying that for America to get back on track, we're probably going to cut that short and not give it to you. We're going to take things away from you on behalf of the common good.\"[28] Clinton has sponsored legislation designed to reduce the deficit by reinstating some taxes that had been cut.[citation needed] She has co-sponsored legislation related to debt and deficit reduction.[citation needed] In 2007, Clinton advocated repealing portions of the Bush tax cuts, effectively increasing some taxes to the higher rates which existed in 2000.[29]In January 2008 Clinton called upon Congress to pass an economic stimulus package totaling as much as $110 billion, to deal with the effects of a possible recession. The package would consist of funds to help deal with the effect of the subprime mortgage crisis, to help lower-income families pay for higher home energy costs, to extend unemployment insurance, and to possibly provide some tax refunds.[30]"},"Bankruptcy[edit]":{"text":"In 2001, Clinton voted for bankruptcy reform legislation, supported by credit card companies and banks, that would have made it more difficult for borrowers to discharge their debt as part of bankruptcy proceedings. The bill did not pass at that time. Similar legislation was passed in 2005, but Clinton did not participate in voting. She later said that she would have voted no.[81]In 2006 and 2007, while in the Senate, Clinton introduced the Student Borrower Bill of Rights. The legislation \"would have made it easier for cash-strapped student borrowers to pay back their loans, have their loans refinanced, qualify for income-based loan payments, and discharge student debt in bankruptcy.\"[82] The legislation did not pass at the time.[82]"},"Capitalism and economic philosophy[edit]":{"text":"In a 1996 interview, Clinton commented on the relationship between government and the private sector, saying: \"I just believe that there's got to be a healthy tension among all of our institutions in society, and that the market is the driving force behind our prosperity, our freedom in so many respects to make our lives our own but that it cannot be permitted just to run roughshod over people's lives as well.\"[31]In a speech in October 2014, Clinton stated \"Don’t let anybody tell you that it’s corporations and businesses that create jobs. You know that old theory, trickle-down economics. That has been tried; that has failed. It has failed rather spectacularly.\"[32]In a July 2015 speech at the New York University Stern School of Business, Clinton condemned what she called \"short-termism\" and \"quarterly capitalism\"—\"the obsession with share prices and quarterly earnings over real value creation, which Clinton views as dangerous to the economy.\"[33][34] Clinton called for \"new, creative, disruptive ideas to save capitalism\"[34] and has said that capitalism \"needs to be reinvented, it needs to be put back into balance.\"[33]In October 2015, Clinton said in a Democratic primary debate that \"When I think about capitalism I think about all the business that were started because we have the opportunity and the freedom to do that and to make a good living for themselves and their families … We would be making a grave mistake to turn our backs on what built the greatest middle class in the history.\"[35] Unlike Senator Bernie Sanders, a rival candidate in the 2016 Democratic primaries, Clinton is not a supporter of the Nordic model, saying in the same debate: \"We are not Denmark. I love Denmark. We are the United States of America, and it's our job to rein in the excesses of capitalism so it doesn't run amok.\"[35][36] and \"what we have to do every so often in America … is save capitalism from itself.\"[36]Noting that the U.S. economy has performed better under Democratic presidents than Republican ones since World War II, Clinton has said: \"The economy does better when you have a Democrat in the White House and that's why we need to have a Democrat in the White House in January 2017.\"[37]In March 2016, she laid out a detailed economic plan, which The New York Times called \"optimistic\" and \"wide-ranging\".[38] Basing her economic philosophy on inclusive capitalism, Clinton proposed a \"clawback\" which would rescind tax relief and other benefits for companies that move jobs overseas; providing incentives for companies that share profits with employees, communities and the environment, rather than focusing on short-term profits to increase stock value and rewarding shareholders; increasing collective bargaining rights; and placing an \"exit tax\" on companies that move their headquarters out of America in order to pay a lower tax rate overseas.[38]"},"Health care[edit]":{"text":"In a speech to Harvard Medical School on June 4, 1998, Clinton outlined general support for federal universal affordable health care for Americans. \"There are 41 million people without health insurance. Who will take care of these people in the future? How will we pay for their care? How will we pay for the extra costs that come when someone is not treated for a chronic disease or turned away from the emergency room? The job of health care reform cannot be done when access to care depends on skin color or the neighborhood they live in or the amount of money in their wallet. Let's continue to work toward universal affordable, quality health care.\"[69]Diane Blair, a political science professor who died in 2000, left notes of a dinner conversation with Clinton in 1993. Blair wrote that Clinton \"thinks managed competition a crock; single-payer necessary; maybe add to Medicare.\" Clinton has said that she has never supported single-payer health care.[70]Clinton later said that health care coverage improvements need to be made incrementally, in contrast to the more ambitious, wide-ranging plan that failed in 1993 to 1994.[71]Clinton supported a 2007 proposal to increase funding for the State Children's Health Insurance Program by $35 billion over five years.[72]In September 2007, as part of her presidential campaign, Clinton proposed her own health system reform plan (dubbed the \"American Health Choices Plan\"), which would require that individuals have health care coverage from some source. Clinton explained that the coverage options available would be enrollment in private insurance plans via an \"individual mandate\" and an \"employer mandate\" requiring employers to provide health care benefits, or enrollment in a public program via an expanded version of Medicare or federal employee health plans.[73][74]The projected cost of the plan was $110 billion annually and would require all employers to cover their employees' health insurance or contribute to the costs of their employees' health insurance coverage; tax credits will be provided to companies with fewer than 25 employees to help cover costs.[73][75] In order to pay for the program's estimated $110 billion per year cost, Clinton favored repealing portions of the Bush tax cuts, effectively increasing some taxes to the higher rates which existed in 2000.[29]"},"Trade[edit]":{"text":"During the 1993 internal debate over the North American Free Trade Agreement, Clinton made clear her feeling that its passage was getting higher priority within the administration than it should, especially compared to the Clinton health care reform plan.[46][47][48][49] By most accounts, Clinton was also unenthusiastic about the merits of the agreement, believing it would cause a loss of American jobs and would be politically unpopular.[46][47][50][51] Once her husband decided to proceed with NAFTA, Clinton as First Lady participated in at least five meetings at the White House aimed at securing Congressional passage of the agreement,[52] which Gergen and former official Robert J. Shapiro felt showed she had been a \"good soldier\" in getting behind a settled decision,[50][51] but which other attendees interpreted as showing Clinton was in fact behind the agreement.[48] During later years of the administration and in her memoir, Clinton touted her husband's support for NAFTA.[53]In 2005, while representing New York in the U.S. Senate, Clinton said: \"During my tenure as senator, I have voted for every trade agreement that has come before the Senate, and I believe that properly negotiated trade agreements can increase living standards and foster openness and economic development for all parties.\"[54]Later in 2005, Clinton voted against the Central America Free Trade Agreement,[55] believing that it did not provide adequate environmental or labor standards.[56] Again, she differed with her husband who, as the former president, supported the agreement.[57]Clinton, together with fellow New York Senator Charles Schumer, welcomed a 2006 decision by the United States Commerce Department that called for a 108.3% duty on imports from Chinese candlemakers, as the imports sought to circumvent an Anti-dumping Duty Order.[58] Clinton stated, \"This is a real victory for the Syracuse candle-making industry. Our manufacturers deserve a level playing field and we owe it to them to make sure that others do not unfairly circumvent our fair trade practices. Syracuse has a proud history of candle production but attempts by importers to undercut our producers have put that tradition at risk. I am pleased that the Department of Commerce heeded our call to take action against these unfair practices and recognized the importance of this decision to local producers, especially here in Syracuse. We will continue to make the case on behalf of Syracuse candle-makers as the Commerce Department considers its final determination.\"[59]During her 2008 presidential campaign, Clinton repeatedly criticized the NAFTA agreement,[52][60] despite it being one of the major achievements of her husband's administration.[53] She said, \"NAFTA did not do what many had hoped. NAFTA was a mistake to the extent that it did not deliver on what we had hoped it would.\"[53] She did say that she believed in the underlying idea behind trade agreements such as NAFTA: \"I believe in the general principles it represented. But what we have learned is that we have to drive a tougher bargain. Our market is the market that everybody wants to be in. We should quit giving it away so willy-nilly. I believe we need tougher enforcement of the trade agreements we already have.\"[51] She promised that if elected, she would work to implement changes to it that would benefit American workers,[52] saying \"I want to be a president who focuses on smart, pro-American trade. I will review every trade agreement. I'm going to ask for revisions that I think will actually benefit our country, particularly our workers, our exporters... And NAFTA will be part of that review, to try to reform and improve it.\"[53]Former top Obama adviser David Axelrod said on MSNBC that when Hillary Clinton was secretary of state from 2009 to 2013, she \"owned\" the 12-nation Trans-Pacific Partnership (TPP).[54] In November 2012, during her visit in Australia Clinton, referring to the TPP, stated that it was \"the gold standard in trade agreements.\"[54] In February 2013, Clinton left her job with the general framework of TPP in place.[54] In her 2014 memoir Hard Choices, she wrote:\"Because TPP negotiations are still ongoing, it makes sense to reserve judgment until we can evaluate the final proposed agreement. It’s safe to say the TPP won’t be perfect -- no deal negotiated among a dozen countries ever will be -- but its higher standards, if implemented and enforced, should benefit American businesses and workers.\"During her presidential campaign, in April 2015, Clinton said in New Hampshire that: \"Any trade deal has to produce jobs and raise wages and increase prosperity and protect our security\".[54] On the date of its final drafting, 5 October 2015, Clinton stated her opposition to the agreement citing her previous objections that it did not meet the high standards she had set for such agreements.[61]"},"Social Security tax cap[edit]":{"text":"In 2008, Clinton supporting retaining the cap on the Federal Insurance Contributions Act (FICA) tax, the payroll tax which funds Social Security and Medicare. Under the cap at that time, the FICA tax applied to income up to $102,000, with income in excess of this amount (earned by the top 6% of income-earners) not taxable. Clinton said that a repeal of the FICA tax cap would amount to a \"tax increase on the middle class.\"[80]"},"Subprime mortgage crisis relief[edit]":{"text":"On December 5, 2007, Clinton unveiled her plan to ameliorate the effects of the 2007 subprime mortgage financial crisis on homeowners. She called for a 90-day moratorium on foreclosures, in order that lenders and mortgage servicers have sufficient time to get through paperwork complications and an expected high volume of troubled borrowers without having to shut out the lights, and a five-year freeze on the interest rates of adjustable rate mortgages, so that borrowers would not get slammed by expected 30, 40 or more percent increases in monthly payments due to the effects of the crisis and of unwise initial borrowing decisions.[68]"},"Financial regulation and Wall Street reform[edit]":{"text":"Clinton called for more robust financial regulation early on in the financial crisis of 2007–08. Clinton specifically called for regulations to crack down on financial derivatives and subprime mortgages and strengthen oversight of financial institutions and private-equity markets.[39][40] In a 2007 speech, Clinton \"called for major federal intervention in the market for subprime loans, arguing that 'we need to acknowledge that Wall Street has played a significant role in our current problems, and in particular the housing crisis.'\"[40] Clinton supported the subsequent Dodd–Frank Wall Street Reform and Consumer Protection Act of 2010, a major overhaul of U.S. financial regulations enacted in the wake of the Great Recession.[41][42] Several key architects and supports of the Dodd-Frank Act, including Barney Frank and Gary Gensler, are Clinton supporters who advise her on financial regulations during her 2016 campaign.[42]On December 7, 2015, in a New York Times op-ed, Clinton outlined her plans for regulating Wall Street.[43] Clinton wrote: \"As president, I would not only veto any legislation that would weaken financial reform, but I would also fight for tough new rules, stronger enforcement and more accountability that go well beyond Dodd-Frank.\"[43] Clinton also called for an enhanced Volcker rule that would close \"loopholes that still allow banks to make speculative gambles with taxpayer-backed deposits.\"[43]Clinton has received criticism for her ties with Wall Street and special interests.[44][45]"},"text":"","Jobs and minimum wage[edit]":{"text":"In her book Hard Choices, Clinton stated that there were regulatory hurdles for businesses to create jobs in America and India, saying, \"There were still too many barriers and restrictions, but American companies were slowly gaining access to Indian markets, creating jobs and opportunities for people in both countries.\"[62]In a speech at a campaign event for Massachusetts gubernatorial candidate Martha Coakley in 2014, Clinton said: \"Don't let anyone tell you that raising the minimum wage will kill jobs – they always say that. I've been through this. My husband gave workers a raise in the 1990s. I voted to raise the minimum wage and guess what, millions of jobs were created or paid better and more families were secure.\" She followed that statement by saying \"[a]nd don't let anybody tell you that it's corporations and businesses that create jobs. You know that old theory, trickle-down economics. That has been tried, that has failed. It has failed rather spectacularly.\"[63][64][65][66]While campaigning for the presidency in 2015 and 2016, Clinton has proposing raising the federal minimum wage to $12 an hour as a floor. Clinton has also expressed support for the \"Fight for $15\" campaign for higher minimum wages in individual states and cities (such as New York and Los Angeles).[67]"},"Campaign finance[edit]":{"text":"In 2002, Clinton voted in favor of the Bipartisan Campaign Reform Act (McCain-Feingold Act), which imposed restrictions on soft money and political campaign advertising.[76]In 2007, Clinton spoke in favor of public financing of some campaigns: \"I believe we have to move, eventually in our country, toward a system of public financing that really works for candidates running for federal office. I will support that as president.\"[77] At the same time, her own prodigious fundraising allowed her to opt out of the public financing scheme for presidential elections, the first campaign in 30 years to completely do so.[77]While campaigning in May 2015, Clinton stated that if elected president, she would appoint Supreme Court justices who would overturn the controversial 2010 decision in Citizens United v. FEC,[78] which \"launched a new era of unbridled fundraising\" in U.S. elections.[79] Clinton stated: \"I will do everything I can to appoint Supreme Court justices who protect the right to vote and do not protect the right of billionaires to buy elections.\"[78]"}},"Social policy[edit]":{"Arts and culture[edit]":{"text":"Clinton has frequently expressed support for the arts and humanities. Clinton served as honorary chairwoman of a committee that issued a report, Creative America, in February 1997, calling for an appropriation by $2 per citizen by the year 2000 for museums, libraries, the National Endowment for the Arts, and the National Endowment for the Humanities, which would represent a modest increase in federal arts and humanities spending.[231] Clinton's position was in contrast to that of congressional Republicans who called for an end to all federal funding of the National Endowment for the Arts.[231] Clinton stated at the time that: \"The arts and humanities can offer children safe and productive alternatives to crime, violence, gangs and drugs, transporting them beyond the bounds of their difficult circumstances.\"[231]While in the Senate, Clinton—along with fellow New York Senator Chuck Schumer—unsuccessfully pushed for the inclusion of a $1 million appropriation for the Museum at Bethel Woods (a museum commemorating the Woodstock Music Festival of 1969) in an 2007 omnibus health and education spending bill. Republicans criticized the proposed expenditure as wasteful, while Schumer and Clinton said that the museum would \"continue to promote education, the arts, culture and tourism in the region.\"[232]In January 2013, while secretary of state, Clinton published an article in Vanity Fair magazine, writing that \"art is also a tool of diplomacy\" and promoting the Department of State's longstanding Art in Embassies Program.[233]On the campaign trail in 2015, Clinton has expressed support for art education,[234] and has said: \"I believe that the arts and culture are important in their own right... but they're also important drivers for economic growth, tourism, and attracting young people.\"[235]"},"Stem cell research[edit]":{"text":"Clinton cosponsored the Stem Cell Research Enhancement Act of 2005, which called for federal funding of stem cell research based on stem cell lines derived from discarded human embryos. The bill was vetoed by President Bush. She also voted for the 2007 bill with the same name that passed in Congress.[237][283]"},"Native American issues[edit]":{"text":"Clinton cosponsored the Indian Health Care Improvement Act Amendment of 2007.[320]During both her 2008 and 2016 campaigns for the presidency, Clinton has met with Native American leaders and held events on Indian reservations.[321]During her 2008 run, Clinton released a position statement on Native American issues emphasizing the need to both provide vital services and support tribal sovereignty.[320] Clinton specifically committed, among other things, \"to meaningful increases to the Indian Health Service budget\" to improve health care for Native Americans (who suffer from significant health disparities); to \"appoint Native Americans to key positions in a number of federal departments and agencies\"; to increase funding for the American Indian Head Start Program; to improve housing and law enforcement in Indian country; and to increase support for tribal colleges and universities.[320]"},"Veterans[edit]":{"text":"On MSNBC's Rachel Maddow Show on October 23, 2015, Maddow asked Clinton about the controversy over Department of Veterans Affairs (VA) patients that have been backlogged and put on secret waiting lists while waiting for an appointment.[329][330] An audit by the VA Inspector General in 2014 found that 57,000 veterans had waited more than 90 days for their scheduled appointments, and that approximately 70 percent of VA facilities maintained secret, off-the-books waiting lists of patients.[329] In response, Clinton acknowledged that there were problems, \"but it’s not been as widespread as it has been made out to be\" she said.[329][330] \"There have been a number of surveys of veterans, and overall, veterans who do get treated are satisfied with their treatment,\" adding, \"Nobody would believe that from the coverage that you see and the constant berating of the VA that comes from the Republicans, in part, in pursuit of this ideological agenda that they have.\"[329][330] Clinton said that recent efforts to speed up treatment for veterans should be given a chance to work, but that VA health reforms may need a “SWAT team” to ensure accountability.[330][331]"},"Church and state[edit]":{"text":"In a 2005 speech, Clinton said that religious political officials should be able to \"live out their faith in the public square.\"[305]Speaking at an event for candidates on faith and compassion in April 2008, Clinton said that \"we want religion to be in the public square. If you are a person of faith, you have a right and even an obligation to speak from that wellspring of your faith.\"[306]"},"Internet neutrality[edit]":{"text":"In 1998, at a press conference related the White House Millennium Council, Clinton stated that the internet needed \"gatekeeping\".[312]Senator Clinton on May 18, 2006 released a statement outlining her intentions to be an original cosponsor of the Internet Freedom Preservation Act, also known as the Dorgan and Snowe bill, as an amendment to the Telecommunications Act of 1996, that protects network neutrality in the United States. The bill aims to protect internet consumers and small businesses from Internet service providers charging large companies different amounts for Internet access than smaller customers. She says that the Internet must continue to use an \"open and non-discriminatory framework\" so that it may be used as a forum where \"views are discussed and debated in an open forum without fear of censorship or reprisal\".[313]\"I support net neutrality... [The Internet] does not decide who can enter its marketplace and it does not pick which views can be heard and which ones silenced. It is the embodiment of the fundamental democratic principles upon which our nation has thrived for hundreds of years.\"[313]Clinton reiterated her support for net neutrality on January 9, 2007, when the Internet Freedom Preservation Act was reintroduced: \"As evidenced by the diverse coalition of the consumer, business and citizen groups that span the political and ideological spectrum, and who all strongly support the concept of network neutrality, it is critical that Congress take steps to preserve the principles enshrined therein.\"[314]While secretary of state, Clinton delivered a major speech (entitled \"Remarks of Internet Freedom\") in January 2010, declaring that \"We stand for a single Internet where all of humanity has equal access to knowledge and ideas.\"[315]"},"Faith-based initiatives[edit]":{"text":"Clinton supports faith-based programs that address social issues and provide social services, saying that \"there is no contradiction between support for faith-based initiatives and upholding our constitutional principles.\"[237][307]"},"Death penalty[edit]":{"text":"Clinton supports the death penalty,[310] and made note of this support for it during her 2000 Senate campaign.[311] Clinton sponsored the Innocence Protection Act, which requires DNA testing before administering federal executions.[237]"},"Income inequality[edit]":{"text":"Clinton believes that income inequality is a barrier to equal opportunity.[240][241]"},"Education[edit]":{"text":"Senator Clinton voted for President Bush's No Child Left Behind Act in 2001 and still supports it today according to her Senate page on education, while believing that President Bush has not provided enough funding, cutting the program's budget by $12 billion.[243] In June 2007, with the Act up for renewal by Congress,[244] she criticized the program, saying that its emphasis on testing has caused American children to narrow their studies and lose their creative edge.[245]Moreover, Clinton has proposed a $10 billion program for pre-K education that will address the 80% of children who are not enrolled in such programs.[246][247] During the Iowa caucus and New Hampshire primary season (Dec 2007), a series of campaign ads were run as Holiday wishes to the public to promote this position.Clinton is against education vouchers for use at private schools. On September 13, 2000, she said, \"I do not support vouchers. And the reason I don't is because I don't think we can afford to siphon dollars away from our underfunded public schools.\"[248] Outlining a different objection, on February 21, 2006, she said: \"First family that comes and says 'I want to send my daughter to St. Peter's Roman Catholic School' and you say 'Great, wonderful school, here's your voucher.' Next parent that comes and says, 'I want to send my child to the school of the Church of the White Supremacist …' The parent says, 'The way that I read Genesis, Cain was marked, therefore I believe in white supremacy. … You gave it to a Catholic parent, you gave it to a Jewish parent, under the Constitution, you can't discriminate against me.' So what if the next parent comes and says, 'I want to send my child to the School of the Jihad'? … I won't stand for it.\"[249]Clinton sent her own daughter, Chelsea, to public school from kindergarten through eighth grade when they lived in Little Rock, Arkansas,[250] and then to private school in Washington, D.C. while they lived in the White House in the interests of keeping the first daughter's education, and life in general, at a low profile.[251]Clinton supports the Common Core State Standards.[252] She said this about Common Core: “The really unfortunate argument that's been going on around Common Core, it’s very painful because the Common Core started off as a bipartisan effort. It was actually nonpartisan. It wasn’t politicized....Iowa has had a testing system based on a core curriculum for a really long time. And [speaking to Iowans] you see the value of it, you understand why that helps you organize your whole education system. And a lot of states unfortunately haven't had that, and so don't understand the value of a core, in this sense a Common Core.”[253]"},"Racial justice[edit]":{"text":"Addressing crowds on the campaign trail in 2015 and 2016, Clinton has said both \"Yes, black lives matter\"[274] and \"all lives matter.\"[275]Clinton has met with Black Lives Matter leadership, to which activist DeRay Mckesson said \"We didn’t agree about all the issues, but in the end I think that we felt heard\". In the meeting Clinton supported ending private prisons and immigration detention centers.[276]"},"Poverty[edit]":{"text":"At an April 2008 candidates' forum on faith and compassion, Clinton said that \"the incredible demands that God places on us, and that the prophets ask of us, and that Christ called us to respond to on behalf of the poor are unavoidable.\"[236][237]In 2008, Clinton said that if elected president, she would appoint a \"cabinet-level poverty czar\" focused on \"ending poverty as we know it.\"[238]In the Senate, linton voted for an increase in the federal minimum wage.[237] While campaigning for the presidency in 2015 and 2016, Clinton has proposing raising the federal minimum wage to $12 an hour as a floor. Clinton has also expressed support for the \"Fight for $15\" campaign for higher minimum wages in individual states and cities (such as New York and Los Angeles).[67] She was criticized by liberal groups for supporting an increase in the work requirement for welfare.[237][239]"},"Crime[edit]":{"text":"In 2000, during a Senate debate in Manhattan, Clinton voiced her support for drug courts to address drug abuse problems when she stated, \"We need more treatment [for drug addicts]. It is unfair to urge people to get rid of their addiction and not have the treatment facilities when people finally make up their minds to get treatment.\"[308]In 1994, during a National Center For Women and Policing conference, Clinton voiced her support for three strikes laws when she stated \"We need more police, we need more and tougher prison sentences for repeat offenders. The three strikes and you're out for violent offenders has to be part of the plan.\"[309]"},"Women's rights[edit]":{"text":"Clinton gave an influential speech called \"Women's Rights are Human Rights\" on September 5, 1995 at the United Nations Fourth World Conference on Women in Beijing.[262][263][264]In 2013, she launched a partnership between the Bill, Hillary & Chelsea Clinton Foundation and the Bill and Melinda Gates Foundation to gather and study data on the progress of women and girls around the world since the United Nations Fourth World Conference on Women in Beijing in 1995.[265][266] This is called \"No Ceilings: The Full Participation Project.\"[265][266]In 2014, Clinton defined being a \"feminist\" as favoring equal rights for women, saying, \"I don't see anything controversial about that at all.\"[267] She also told those who think of feminism as outdated, \"I don't think you've lived long enough.\"[267] That year she also stated that \"[W]omen and girls … [are] central to our foreign policy,\" adding that nations that support women are more stable and \"less likely to breed extremism.\"[268]In 2014, Clinton supported a proposed Oregon state Equal Rights Amendment, which Oregon ended up adopting.[269][270]In 2015, when Clinton was asked whether she considered herself a feminist, she replied, \"Yes, absolutely.\"[271]As secretary of state, Clinton created the post of Ambassador-at-Large for Global Women's Issues.[272]Clinton has called for the U.S. to ratify the Convention on the Elimination of All Forms of Discrimination Against Women, which was signed by President Jimmy Carter in 1980 but never ratified by the Senate.[273]"},"Abortion and birth control[edit]":{"text":"In a speech on January 24, 2005, to the New York State Family Planning Providers, Senator Clinton outlined her stance on abortion. \"When I spoke to the conference on women in Beijing in 1995 – ten years ago this year – I spoke out against any government interfering with the reproductive rights and decisions of women and families. So we have a lot of experience from around the world that is a cautionary tale about what happens when a government substitutes its opinion for an individual's. There is no reason why government cannot do more to educate and inform and provide assistance so that the choice guaranteed under our constitution either does not ever have to be exercised or only in very rare circumstances.\" She emphasized that, \"I believe we can all recognize that abortion in many ways represents a sad, even tragic choice to many, many women.\" She praised the role of moral values in preventing unwanted pregnancies while supporting continued research into the most effective means of preventing these pregnancies. \"Research shows that the primary reason that teenage girls abstain is because of their religious and moral values. We should embrace this – and support programs that reinforce the idea that abstinence at a young age is not just the smart thing to do, it is the right thing to do. But we should also recognize what works and what doesn't work, and to be fair, the jury is still out on the effectiveness of abstinence-only programs. I don't think this debate should be about ideology, it should be about facts and evidence.\"[277][278]A July 13, 2005 New York Times article titled \"The Evolution of Hillary Clinton\" characterizes Clinton as seeking to find middle ground between voters with various views on the criminalization of abortion.[279] In April 2007 Clinton expressed dismay at the Supreme Court's Gonzales v. Carhart ruling that upheld the Partial-Birth Abortion Ban Act.[280]NARAL Pro-Choice America consistently gave Clinton a 100 percent pro-choice rating from 2002 to 2006.[281]Clinton opposed the 2014 Burwell v. Hobby Lobby Supreme Court decision, stating, \"It's the first time that our court has said that a closely held corporation has the rights of a person when it comes to religious freedom, which means the corporation's employers can impose their religious beliefs on their employees, and, of course, denying women the right to contraceptives as part of a health care plan is exactly that. I find it deeply disturbing that we are going in that direction.\"[282]"},"From childhood to retirement[edit]":{"text":"In September 2007 Clinton worked on a concept of starting a workable savings plan for everyone. Although some of her casual brainstorming about providing every 18-year-old with a small savings grant was misconstrued.[242]"},"Video game regulation[edit]":{"text":"Clinton urged an inquiry into the Hot Coffee mod portion of Grand Theft Auto: San Andreas, which unlocked hidden sexually graphic images.[316] She said that if the game's manufacturer did not change the game's ESRB rating from M (Mature 17+) to AO (Adults Only 18+), she would introduce federal legislation to regulate video games. On July 20, 2005, the ESRB changed the rating and as a result, the game was removed from the shelves of Wal-Mart, Target, Best Buy, and other stores.[317][318]Five months later, Clinton introduced the legislation anyway. On December 16, 2005, Clinton introduced the Family Entertainment Protection Act, S.2126,[319] a bill that would prohibit the sale of sexual or violent video games to anybody under the age of 18."},"text":"","LGBT rights[edit]":{"text":"In a March 2007 interview with ABC News correspondent Jake Tapper, Clinton said that the U.S. military's \"Don't ask, don't tell\" policy was not working and that openly homosexual people should be allowed to serve: \"We are being deprived of thousands of patriotic men and women who want to serve their country who are bringing skills into the armed services that we desperately need, like translation skills.\"[288]In the same interview, when asked if homosexuality is immoral, she declined to respond: \"Well I'm going to leave that to others to conclude.\"[288] Later that day, Clinton released a statement regarding US General Peter Pace's comment that homosexual acts are immoral. She stated: \"I disagree with what he said and do not share his view, plain and simple.\"[289] She went further the following day, stating that \"what I believe\" is that \"homosexuality is not immoral.\"[290][291]Before its repeal in 2010, Clinton had said that she would, indeed, seek to repeal the \"Don't Ask, Don't Tell\" policy.[292]On December 7, 2003, in an interview with John Roberts of CBS News, then-Senator Clinton said that she opposed allowing same-sex marriage while affirming her support for some form of civil unions for same-sex couples: \"I think that the vast majority of Americans find [same-sex marriage] to be something they can't agree with. But I think most Americans are fair. And if they believe that people in committed relationships want to share their lives and, not only that, have the same rights that I do in my marriage, to decide who I want to inherit my property or visit me in a hospital, I think that most Americans would think that that's fair and that should be done.\"[293]In the same interview with Roberts, Clinton expressed opposition to the Federal Marriage Amendment, a proposed constitutional amendment to define marriage as the union of one man and one woman, and thereby ban same-sex marriage. \"I think that would be a terrible step backwards. It would be the first time we've ever amended the Constitution to deny rights to people. And I think that should be left to the states. You know, I find it hard to believe in one program [health care] I'm agreeing with Newt Gingrich, now I'm about to agree with Dick Cheney. But I think Vice President Cheney's position on gay marriage is the right one.\"[293]In 2004, in a speech she made on the floor of the Senate on the subject, Clinton said: \"I believe marriage is not just a bond but a sacred bond between a man and a woman. I have had occasion in my life to defend marriage, to stand up for marriage, to believe in the hard work and challenge of marriage. So I take umbrage at anyone who might suggest that those of us who worry about amending the Constitution are less committed to the sanctity of marriage, or to the fundamental bedrock principle that it exists between a man and a woman, going back into the midst of history as one of the founding, foundational institutions of history and humanity and civilization, and that its primary, principal role during those millennia has been the raising and socializing of children for the society into which they are to become adults.\"[294][295] (video)Following Hernandez v. Robles, a 2006 ruling of the New York Court of Appeals (the state's highest court) that denied any state constitutional right to same-sex marriage, Clinton reiterated her support for \"full equality\" under the civil unions mechanism.[296]In August 2007, Clinton participated with other Democratic presidential primary candidates in a forum on LGBT issues hosted by the Human Rights Campaign and Logo. When responding to questions regarding same-sex marriage, Clinton said she would move to repeal the third section of the Defense of Marriage Act,[297] which federally defines marriage as the union of one man and one woman.[298] She also said that she remained opposed to same-sex marriage as a \"personal position\" and that she strongly believed that whether same-sex marriage should be legalized should be left to the individual states to decide.[299][300]Clinton reiterated these positions several weeks later during an interview with Ellen DeGeneres shortly after an Iowa judge had ruled that a state prohibition against same-sex marriage was unconstitutional under Iowa law.[301]In March 2013, Clinton came out in favor of allowing same-sex couples to marry \"personally and as a matter of policy and law\" in a video posted on the website of the Human Rights Campaign.[302]In 2014, Clinton stated that same-sex marriage should be decided on a state-by-state basis.[303]On April 28, 2015—the day the Supreme Court heard oral argument on Obergefell v. Hodges—Clinton issued a statement by means of Twitter further addressing her position on same-sex marriage. Clinton tweeted: \"Every loving couple & family deserves to be recognized & treated equally under the law across our nation. - H.\" She also used the hashtags: #LoveCantWait and #LoveMustWin, and her campaign staff changed their H-shaped, red-white-and-blue campaign logo to gay pride rainbow colors, for use on Twitter and on Facebook.[294]In June 2015, Clinton explained why she changed her position on same-sex marriage at a CNN town hall, saying that she \"evolved over time\". She added, \"I'm very, very proud to state that I'm a full supporter of marriage equality right now.\"[304]"},"Environment[edit]":{"text":"Evaluating all her votes throughout Clinton's Senate career, the League of Conservation Voters (LCV) has given Clinton a lifetime 82 percent pro-environment action rating.[254]Clinton accepts the scientific consensus on climate change.[255] In a December 2014 speech to the LCV, Clinton said, \"The science of climate change is unforgiving, no matter what the deniers may say. Sea levels are rising; ice caps are melting; storms, droughts and wildfires are wreaking havoc. … If we act decisively now we can still head off the most catastrophic consequences.\"[255] Clinton has called climate change \"the most consequential, urgent, sweeping collection of challenges we face as a nation and a world.\"[256]In 2007, Clinton co-sponsored the Climate Stewardship and Innovation Act (a greenhouse gas cap-and-trade initiative proposed by John McCain and Joseph Lieberman which aimed to reduce greenhouse gas emissions by 60 percent from 2000 levels by 2050) and the Global Warming Pollution Reduction Act (a more ambitious plan propose by Bernie Sanders and Barbara Boxer which sought to reduce greenhouse gas emissions by 80 percent from 2000 levels by 2050).[257] Clinton's then-colleague Barack Obama also cosponsored both bills.[257]Clinton is a supporter of the Clean Power Plan (proposed by the Obama administration's EPA), which would regulate carbon emissions from power plants.[255] In her speech to the LCV, Clinton stated that \"the unprecedented action that President Obama has taken must be protected at all costs.\"[255]Clinton has supported offshore oil drilling, and in 2006 voted for a bill to open new Gulf Coast areas to drilling.[255]While secretary of state, Clinton supported hydraulic fracturing (fracking) abroad, encouraging developing countries to sign deals with American fossil fuel companies to extract shale gas by fracking.[255]In a speech to the AFL-CIO, Clinton stated that she supports a green building fund and green-collar job training.[258]Clinton supports the protection of the Arctic National Wildlife Refuge, and would not allow drilling there. She co-sponsored the Roadless Area Conservation Act.[259]Some environmentalists have expressed concern about the millions of dollars of contributions from major fossil fuel companies accepted by the Clinton Foundation.[255][256]Clinton opposes issuance by the State Department of a cross-border permit for the Northern leg of the Keystone XL pipeline.[260]Clinton was endorsed by the Sierra Club in her 2000 Senate campaign.[261]"},"Drug policy[edit]":{"text":"In May 2007, Clinton suggested the federal government was being \"excessive\" in its approach to patients who used medical marijuana. The following month, while campaigning in New Hampshire, Clinton has said she would end federal raids against such patients in states where the use of marijuana for medical purposes is legal.[322]During a CNN town-hall event in June 2014, Clinton said that on medical marijuana, \"I don't think we've done enough research yet. Although I think for people who are in extreme medical conditions and have anecdotal evidence that it works, there should be availability under appropriate circumstances. But I do think we need more research, because we don't know how it interacts with other drugs.\"[323] There's a lot we don't know.\" On recreational marijuana, which has been legalized in Colorado and a few other states, Clinton said: \" states are the laboratories of democracy. We have at least two states that are experimenting with that right now. I want to wait and see what the evidence is.\"[323]In 2015, as Clinton began her 2016 presidential campaign, her views on marijuana were described as similar to the \"cautious, leave-it-to-the-states strategy\" of the Obama administration.[323]At an ABC town-hall event on April 2016, Clinton stated that she favored the removal of marijuana from Schedule I of the Controlled Substances Act, which would make scientific studies of the substance significantly easier.[324] Clinton also stated: \"We have enough anecdotal evidence ... about what marijuana can do for medical conditions, easing pain. And we need to be doing research on it because I am 100 percent in favor of medical uses for marijuana. But I want to know what the evidence is.\"[324]In her 2016 policy position on marijuana, Clinton says that she supports rescheduling marijuana to Schedule II; \"allowing states that have enacted marijuana laws to act as laboratories of democracy, as long as they adhere to certain federal priorities such as not selling to minors, preventing intoxicated driving, and keeping organized crime out of the industry\"; and \"focus[ing] federal enforcement resources on violent crime, not simple marijuana possession.\"[325]While campaigning for the presidency, Clinton has hosted forums on the opioid addiction crisis in the United States,[326] listing it as a top concern.[327] Clinton has pledged to make substance-abuse treatment, including medication-assisted treatment, available to more addicts.[327][328] Clinton also has pledged to make naloxone (Narcan), an antidote to opioid overdose, available to all police departments.[327]"}},"Immigration policy[edit]":{"text":"Clinton's stance on illegal immigration has softened over time.[106] In a 2003 radio appearance, Clinton said: \"We've got to do several things and I am, you know, adamantly against illegal immigrants. ... Certainly we've got to do more at our borders. And people have to stop employing illegal immigrants.\"[106]In April 2006, speaking to the U.S. Hispanic Chamber of Commerce, Clinton said her work for her New York constituents could fall afoul of the Border Protection, Anti-terrorism and Illegal Immigration Control Act of 2005, since some of her constituents are illegal immigrants. \"I realize I would be a criminal, too. My staff would be criminal. We help people with all kinds of problems.\"[107]On March 8, 2006, she strongly criticized H.R. 4437, a bill passed by the House of Representatives in December 2005 and sent to the Senate, Clinton called the measure \"a rebuke to what America stands for\" and said it would be \"an unworkable scheme to try to deport 11 million people, which you have to have a police state to try to do.\" She believed the solution to the illegal immigration problem was to make \"a path to earned citizenship for those who are here, working hard, paying taxes, respecting the law, and willing to meet a high bar for becoming a citizen.\"[108][109]In September 2006, Clinton voted for the Secure Fence Act, authorizing the construction of 700 miles (1,100 km) of fencing along the United States–Mexico border.[110]In May and June 2007, Clinton cast preliminary votes (in terms of amendments and cloture) in support of the high-profile, compromise-based but very controversial, comprehensive immigration reform bill known as the Secure Borders, Economic Opportunity and Immigration Reform Act of 2007.[111] When the bill was again brought forward, she continued to vote in favor of cloture motions to consider it.[112] In October 2007, Clinton voted in favor of a small subset of the previous bill, the DREAM Act.[113]In 2007, in a speech to the Indian Institute of Technology Clinton repeated her call for an increase in the number of H-1B visas.[114]At a debate at Drexel University in Philadelphia on October 30, 2007, Clinton committed to support of New York Governor Eliot Spitzer's plan to give driver's licenses to illegal immigrants. Two minutes later, she recanted the position and blamed the Bush administration for not passing immigration reform.[115] The following day, she clarified her position in a prepared statement by coming out in support of Spitzer's bill.[116] Two weeks later, after Spitzer abandoned the plan due to widespread opposition, Clinton reversed her position on the issue once again, stating: \"I support Governor Spitzer's decision today to withdraw his proposal. As president, I will not support driver's licenses for undocumented people and will press for comprehensive immigration reform that deals with all of the issues around illegal immigration, including border security and fixing our broken system.\"[117] At a University of Nevada, Las Vegas debate on November 16, when asked again if she supported granting driver's licenses to undocumented immigrants, she gave a one-word answer: \"No.\"[118]On March 27, 2008 Clinton again vowed to block the bill. Speaking to a New York group of open-border advocates, she said: \"[The bill] is certainly not in keeping with my understanding of the Scriptures because this bill would literally criminalize the Good Samaritan and probably even Jesus himself.\"[119] Clinton earned a 2008 rating of \"D-\" from Americans for Better Immigration, an immigration reduction organization.[120]In 2014, Clinton stated that children from Central America who entered the United States illegally \"should be sent back as soon as it can be determined who responsible adults in their families are, because there are concerns whether all of them should be sent back. But I think all of them who can be should be reunited with their families.\"[121] She added: \"We have to send a clear message. Just because your child gets across the border, that doesn’t mean the child gets to stay. We don't want to send a message that is contrary to our laws or will encourage more children to make that dangerous journey.\"[106][121]On May 5, 2015, Clinton stated that allowing illegal immigrants to have a path to citizenship \"is at its heart a family issue.\"[122] Clinton also \"sharply criticized Republican presidential candidates who favor granting legal status for some undocumented immigrants, but oppose citizenship,\" saying: \"When they talk about 'legal status,' that is code for 'second-class status.'\"[122] Clinton said that she supported President Obama's Deferred Action for Childhood Arrivals program, which grants undocumented youth (those who entered the U.S. as children) the chance to apply for a stay of deportation.[122]"},"Energy policy[edit]":{"Coal[edit]":{"text":"During a debate in March 2016, Clinton said that \"we need\" to implement \"all of the president’s executive actions\" on the environment and that we need to \"quickly move to make a bridge from coal to natural gas to clean energy.\"[86]Speaking at a CNN town hall forum in March 2016, Clinton said: \"I'm the only candidate which has a policy about how to bring economic opportunity using clean renewable energy as the key into coal country. Because we're going to put a lot of coal miners and coal companies out of business, right? And we're going to make it clear that we don't want to forget those people. Those people labored in those mines for generations, losing their health, often losing their lives to turn on our lights and power our factories. Now we've got to move away from coal and all the other fossil fuels, but I don't want to move away from the people who did the best they could to produce the energy that we relied on.\"[87]When confronted about her \"out of business\" statement while campaigning in West Virginia, Clinton stated \"I don't know how to explain it other than what I said was totally out of context for what I meant because I have been talking about helping coal country for a very long time. It was a misstatement because what I was saying is the way things are going now, they will continue to lose jobs. It didn't mean that we were going to do it. What I said is that is going to happen unless we take action to help and prevent it.\"[88][89]"},"Nuclear power[edit]":{"text":"Clinton wants to renew permits for existing nuclear power plants that are safe to operate and increase public investment in advanced nuclear power.[93][94]At a February 2007 campaign rally in Columbia, South Carolina, Clinton stated, \"I think nuclear power has to be part of our energy solution... We get about 20% of our energy from nuclear power in our country... other countries like France get much much more, so we do have to look at it because it doesn't put greenhouse gas emissions into the air.\"[95] Subsequently in a July 2007 Democratic debate, when asked about nuclear power as an alternative energy source, she said, \"I'm agnostic about nuclear power. Until we figure out what we're going to do with the waste and the cost, it's very hard to see nuclear as a part of our future. But that's where American technology comes in. Let's figure out what we're going to do about the waste and the cost if we think nuclear should be a part of the solution.\"[96]In Democratic primary debates in 2016, Clinton said that she supported greater oversight of the Indian Point nuclear power plant, which had experienced calls for closure following leaks and other problems.[97] Clinton said any action \"needs to be done in a careful, thoughtful way\" and that: \"We also have to be realistic and say, 'You get 25% of the electricity in the greater New York City area from Indian Point.' I don't want middle-class taxpayers to see a huge rate increase.\"[97]"},"Renewable energy[edit]":{"text":"At a February 2016 event, Clinton said \"I have said repeatedly that we are going to move from fossil fuels to clean energy. We're going to have to do it in a quick, but thoughtful way.\"[85] Clinton has also called for the deployment of 500 million more solar panels over the next four years.[85] In an April 2016 town-hall event broadcast on MSNBC, Clinton called for the U.S. to \"use clean renewable energy to create more jobs\" and said: And somebody is going to be the 21st century clean energy superpower. It's either going to be China, Germany or us. I want it to be us because there will be a lot of jobs, again, that have to be done right here in America.\"[85]Clinton supports the wind energy production tax credit and has called for making it permanent.[85]Clinton has praised efforts to use vegetable oils as alternative energy.[98]"},"Ethanol[edit]":{"text":"While in the Senate, Clinton had long opposed ethanol subsidies before she in May 2006 introduced a bill to create a $50 billion fund to expand the use of ethanol and other alternative fuels.[90] In 2007, Clinton expressed support for corn ethanol as a biofuel.[91] In August 2015, the Clinton campaign said that she would \"strengthen\" the Renewable Fuel Standard to promote development of advanced biofuels and access to ethanol products.[92]"},"Climate change[edit]":{"text":"In June 2014 she proposed $100 billion per year by 2020 for climate change mitigation.[99]In 2015, Clinton has stated that her goal is to have enough clean renewable energy to power every home within ten years in the United States.[100]At the heart of Clinton's clean-energy policy is a national goal of installing 500,000,000 solar panels. By 2027 she aims to secure a third of America's electricity from renewable sources.[101]As Secretary of State under President Obama, Clinton promoted fracking services by American companies to various countries. As candidate for president she has called for regulation of chemicals used in this method of drilling for natural gas and sharp reductions in the methane released by current production methods.[102]"},"Keystone XL pipeline[edit]":{"text":"Clinton opposes issuance by the State Department of a cross-border permit for the Northern leg of the Keystone XL pipeline.[103] She announced her opposition in September 2015. Previously, she had delayed announcing her opposition to the pipeline, noting that as Secretary of State, she had set in motion the review process a number of years previously to evaluate the pipeline, and preferred to allow time for her successor John Kerry, and President Obama to make the decision. “I will refrain from commenting because I had a leading role in getting that process started,” Clinton had said, “and I think that we have to let it run its course.”[104] Politifact found that Clinton had not flip-flopped on the issue.[105]"},"text":"Clinton supports energy conservation, releasing oil reserves, increasing the number of hydrogen-powered vehicles, and ratification of the Kyoto Protocol. She opposes drilling in the Arctic National Wildlife Refuge[83] and the Bush administration's energy policy.[83]Clinton supports cap-and-trade, which allows companies to trade carbon credits, seeks an 80% carbon cut by 2050, seeks a 10% national energy reduction by 2020, advocates a zero emission policy for federal buildings by 2030, calls for raising gas mileage standards to 35 m.p.g. within 10 years (having indicated a willingness to use administrative power if Congress fails to act on this), and opposes drilling in the Atlantic.[84]Clinton was endorsed by the League of Conservation Voters in 2015.[85]"}}